[{"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4692", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Venkatraman_Ramakrishnan> . ?uri <http://dbpedia.org/property/prizes> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Quantos cientistas ganharam um pr\u00eamio pela sociedade liderada por Venkatraman Ramakrishnan?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2826", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/highSchool> <http://dbpedia.org/resource/Denbigh_High_School_(Newport_News,_Virginia)> } ", "question": "Quem fez o ensino m\u00e9dio na Denbigh High School?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Burro_Flats_Painted_Cave> <http://dbpedia.org/ontology/governingBody> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Boeing_B-17_Flying_Fortress> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Burro_Flats_Painted_Cave> <http://dbpedia.org/ontology/governingBody> ?u_0 .<http://dbpedia.org/resource/Boeing_B-17_Flying_Fortress> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}], "id": "1869", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Burro_Flats_Painted_Cave> <http://dbpedia.org/ontology/governingBody> ?uri. <http://dbpedia.org/resource/Boeing_B-17_Flying_Fortress> <http://dbpedia.org/ontology/manufacturer> ?uri} ", "question": "Qual fabricante do Boeing B-17 Flying fortress \u00e9 o gerente do burro Flats Painted Caves?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3114", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Drop.io> <http://dbpedia.org/property/owner> ?uri. <http://dbpedia.org/resource/Sean_Parker> <http://dbpedia.org/ontology/knownFor> ?uri . }", "question": "Qual propriet\u00e1rio do Drop.io tornou Sean Parker famoso?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2312", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Newin_Chidchob> <http://dbpedia.org/property/nationality> ?uri. <http://dbpedia.org/resource/Seni_Pramoj> <http://dbpedia.org/ontology/nationality> ?uri} ", "question": "Que pa\u00eds fornece uma cidadania tamb\u00e9m Newin Chidchob e Seni Pramoj?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "4923", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual pessoa tem oponente Ike Clanton?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1618", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Atamurat-Kerkichi_Bridge> <http://dbpedia.org/property/builder> ?uri } ", "question": "Quem \u00e9 o construtor da ponte Atamurat-Kerkichi?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}], "id": "994", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?uri } ", "question": "Qual \u00e9 o nome da cordilheira de Le Gibloux?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/parent> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/parent> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_1"}], "id": "1803", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/parent> <http://dbpedia.org/resource/Warner_Bros.> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Conte comigo todos os distribuidores de videogames cuja empresa-m\u00e3e \u00e9 a Warner Bros."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2642", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Blue_Jacket> . ?x <http://dbpedia.org/property/combatant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Quem todos estiveram envolvidos nas guerras travadas pelo comandante Blue Jacket?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4802", "query": "ASK WHERE { <http://dbpedia.org/resource/End_of_the_Rainbow> <http://dbpedia.org/property/characters> <http://dbpedia.org/resource/Judy_Garland> }", "question": "Judy Garland \u00e9 uma personagem de End of the Rainbow?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Thomas_Bryan_Martin> <http://dbpedia.org/ontology/associate> ?u_0", "target_var": "?u_0"}], "id": "3535", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Bryan_Martin> <http://dbpedia.org/ontology/associate> ?uri } ", "question": "Quem \u00e9 o associado de Thomas Bryan Martin?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Steve_Buyer> <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}], "id": "4831", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steve_Buyer> <http://dbpedia.org/ontology/battle> ?uri } ", "question": "Em que guerras Steve Buyer se envolveu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3911", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Herbert_Pell> <http://dbpedia.org/property/children> ?x . ?x <http://dbpedia.org/ontology/profession> ?uri  . }", "question": "Qual \u00e9 a profiss\u00e3o dos filhos de Herbert Pell?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Silver_Airways> <http://dbpedia.org/ontology/hubAirport> <http://dbpedia.org/resource/Washington_Dulles_International_Airport>", "target_var": "?u_-1"}], "id": "2107", "query": "ASK WHERE { <http://dbpedia.org/resource/Silver_Airways> <http://dbpedia.org/ontology/hubAirport> <http://dbpedia.org/resource/Washington_Dulles_International_Airport> }", "question": "A Silver Airways tem um hub no Aeroporto Internacional Washington Dulles?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3044", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records> . }", "question": "De quem s\u00e3o as gravadoras Victor Entertainment e Celluloid Records?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "416", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Gemini_8>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>}", "question": "Quais astronautas participaram da miss\u00e3o Gemini 8?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> .?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}], "id": "505", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/Tokyo_Broadcasting_System> . ?x <http://dbpedia.org/property/writer> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quantas pessoas escreveram coisas transmitidas no Tokyo Broadcasting System?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4152", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/notableCommander> <http://dbpedia.org/resource/Herbert_Bautista> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "Qual \u00e9 o mascote da unidade militar cujo comandante \u00e9 Herbert Bautista?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4255", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Ragaway> <http://dbpedia.org/ontology/restingPlace> ?uri. <http://dbpedia.org/resource/Chuck_Connors> <http://dbpedia.org/ontology/restingPlace> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}", "question": "Qual cidade \u00e9 o local de descanso de Martin Ragaway e Chuck Connors?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3941", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/New_Mexico> . ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Microsoft_Surface>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual nova empresa sediada no M\u00e9xico produz o Surface?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "414", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quem \u00e9 a pessoa que est\u00e1 no conselho do Freedom of the City?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1183", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Geneva> . ?uri <http://dbpedia.org/property/company> ?x  . }", "question": "As empresas sediadas em Genebra possuem quais programas de TV?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Morphine>", "target_var": "?u_0"}], "id": "485", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Morphine>  . }", "question": "Quem morreu devido \u00e0 morfina?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar>", "target_var": "?u_-1"}], "id": "893", "query": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }", "question": "O Walt Disney Studio tem uma subsidi\u00e1ria chamada PixarCascadia_"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "555", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Levon_Ashotovich_Grigorian> . ?x <http://dbpedia.org/ontology/occupation> ?uri  . }", "question": "O que o famoso parente de Levon Ashotovich Grigorian faz para viver?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3825", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shaquil_Barrett> <http://dbpedia.org/property/debutteam> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri  . }", "question": "Onde est\u00e1 localizada a equipe de estreia de Shaquil Barrett?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ivanpah_Solar_Power_Facility> <http://dbpedia.org/ontology/owner> ?u_0", "target_var": "?u_0"}], "id": "1197", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ivanpah_Solar_Power_Facility> <http://dbpedia.org/ontology/owner> ?uri } ", "question": "Quem \u00e9 o propriet\u00e1rio da Ivanpah Solar Power Facility?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4253", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charing_Cross_Bridge_(Monet_series)> <http://dbpedia.org/property/artist> ?uri. <http://dbpedia.org/resource/Dorothea_Sharp> <http://dbpedia.org/property/influencedBy> ?uri} ", "question": "Que artista de Charing Cross Bridge influenciou Dorothea Sharp em sua carreira?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Mind_sport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Game>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Mind_sport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Game>", "target_var": "?u_0"}], "id": "4058", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Mind_sport>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Game>}", "question": "Qual \u00e9 o jogo cujo g\u00eanero \u00e9 Mind sport?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2221", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/AeroKlub_Wroc\u0142aw> . ?x <http://dbpedia.org/property/nationality> ?uri  . }", "question": "Engenharia de qual pa\u00eds estudou na Aero Klub em Wroclaw?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3504", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/USS_Camp_(DE-251)> <http://dbpedia.org/property/shipBuilder> ?uri. <http://dbpedia.org/resource/Emerald_Air_(United_States)> <http://dbpedia.org/ontology/destination> ?uri} ", "question": "Qual \u00e9 o lugar comum onde o USS Camp DE-251 foi constru\u00eddo e \u00e9 um dos destinos do Emerald Air?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3654", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Liste as religi\u00f5es dos comandantes do Ex\u00e9rcito Real da Tail\u00e2ndia."}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4758", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arkansas_wine> <http://dbpedia.org/property/officialName> ?uri } ", "question": "Qual \u00e9 o nome oficial do vinho Arkansas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3006", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marcus_Samuelsson> <http://dbpedia.org/property/birthPlace> ?uri. <http://dbpedia.org/resource/Samuel_of_Waldebba> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Em que pa\u00eds nasceram Marcus Samuelsson e Samuel de Waldebba?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2187", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mall_of_America> <http://dbpedia.org/property/owned> ?x . ?x <http://dbpedia.org/property/headquarters> ?uri  . }", "question": "Onde fica a sede da controladora do Mall of America?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3036", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Seberang_Perai> . ?x <http://dbpedia.org/property/crosses> ?uri  . }", "question": "A ponte que come\u00e7a em Seberang Perai atravessa o qu\u00ea?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Kate_Lundy> <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Julia_Gillard>", "target_var": "?u_-1"}], "id": "3918", "query": "ASK WHERE { <http://dbpedia.org/resource/Kate_Lundy> <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Julia_Gillard> }", "question": "Julia Gillard \u00e9 a primeira-ministra de Kate Lundy?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1272", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michigan_Renaissance_Festival> <http://dbpedia.org/property/location> ?uri. <http://dbpedia.org/resource/Comcast_SportsNet_Chicago> <http://dbpedia.org/ontology/broadcastArea> ?uri . }", "question": "Comcast SportsNet \u00e9 transmitido em qual \u00e1rea, que tamb\u00e9m tem o Michigan Renaissance Festival?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "290", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri } ", "question": "quais cidades est\u00e3o localizadas nas margens do mar mediterr\u00e2neo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4827", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Maharashtra> . ?x <http://dbpedia.org/property/purpose> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}", "question": "Qual \u00e9 o prop\u00f3sito de algumas organiza\u00e7\u00f5es Maharashtran?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/territory> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_0 .?u_0 <http://dbpedia.org/ontology/territory> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/territory> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_0 .?u_0 <http://dbpedia.org/ontology/territory> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/territory> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/territory> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/territory> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_1 .?u_1 <http://dbpedia.org/ontology/territory> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/territory> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?u_1 .?u_1 <http://dbpedia.org/ontology/territory> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "252", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Fusil_Gras_mle_1874> <http://dbpedia.org/ontology/usedInWar> ?x . ?x <http://dbpedia.org/ontology/territory> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Em quantos territ\u00f3rios foram travadas as guerras onde o Fusil Gras Mile 1874 foi usado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3245", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/builder> <http://dbpedia.org/resource/Mota-Engil> . ?x <http://dbpedia.org/ontology/crosses> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "A Mota Engil construiu pontes sobre quais rios?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mathematics>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mathematics> .?u_0 <http://dbpedia.org/ontology/field> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> ?u_1 .?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mathematics>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mathematics> .?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}], "id": "350", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mathematics> . ?x <http://dbpedia.org/ontology/field> ?uri }", "question": "Quantas outras \u00e1reas existem dos cientistas cujo uma das \u00e1reas \u00e9 Matem\u00e1tica?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1187", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Twin_Cities_400> <http://dbpedia.org/ontology/operatedBy> ?uri. <http://dbpedia.org/resource/Leona_Baumgartner> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Twin cities 400 \u00e9 operado por qual cidade, que \u00e9 o local de nascimento de Leona Baumgarter?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "1961", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/New_York_City_FC>  . }", "question": "Quantas pessoas atualmente jogam pelo NYC FC?"}]