[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_La_Liga>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/youthclubs> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_La_Liga> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/youthclubs> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_La_Liga>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_La_Liga> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/youthclubs> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/youthclubs> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/youthclubs> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/youthclubs> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}], "id": "2268", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_La_Liga> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Contar todos aqueles cujo clube juvenil se apresentou na La Liga 14-15?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Atlantic_Ocean>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cities> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Atlantic_Ocean> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cities> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Atlantic_Ocean>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Atlantic_Ocean> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cities> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/cities> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/cities> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/cities> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}], "id": "4633", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Atlantic_Ocean> . ?x <http://dbpedia.org/property/cities> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}", "question": "Quantas cidades existem \u00e0 volta do mar que desagua no Atl\u00e2ntico?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2518", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Maryland_Jockey_Club> <http://dbpedia.org/property/keyPeople> ?uri } ", "question": "Liste os importadores do Maryland Jockey Club?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2439", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Bjarne_Stroustrup> . ?uri <http://dbpedia.org/property/programmingLanguage> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 o n\u00famero total de empresas que usam uma linguagem desenvolvida por Bjarne Stroustrup?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4037", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cam_Plante> <http://dbpedia.org/property/playedFor> ?uri } ", "question": "Para quem o Cam PLante atua?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Inma_Gonz\u00e1lez>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Inma_Gonz\u00e1lez> .?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Inma_Gonz\u00e1lez>", "target_var": "?u_1"}], "id": "1893", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Inma_Gonz\u00e1lez> . ?x <http://dbpedia.org/ontology/basedOn> ?uri  . }", "question": "Que obra famosa deriva daquela cujas letras foram escritas por Inma Gonzales?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> .?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}], "id": "4244", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Lung_cancer> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}", "question": "Quantos pr\u00eamios foram dados aos que morreram de c\u00e2ncer de pulm\u00e3o?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ashot_Grashi>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ashot_Grashi> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ashot_Grashi>", "target_var": "?u_1"}], "id": "4829", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ashot_Grashi> . ?x <http://dbpedia.org/ontology/occupation> ?uri  . }", "question": "Onde os filhos de Ashot Grashi trabalhavam?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2640", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Seven_Springs_Mountain_Resort> . ?uri <http://dbpedia.org/property/owner> ?x  . }", "question": "Quem tem a\u00e7\u00f5es em algo famoso para o Seven Spring Mountain Resort?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "194", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Into_the_Dalek> <http://dbpedia.org/property/executiveProducer> ?uri. <http://dbpedia.org/resource/Wizards_vs_Aliens> <http://dbpedia.org/ontology/producer> ?uri} ", "question": "Qual produtor executivo de Into the Dalek tamb\u00e9m produziu Wizards vs Aliens?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1474", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/deputy> <http://dbpedia.org/resource/Andrew_Peacock> . ?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Alexander_Downer>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quem \u00e9 o titular do cargo cujo deputado foi Andrew Peacock e o predecessor foi Alexander Downer?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4616", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/deathDate> <http://dbpedia.org/resource/Euboea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Philosopher>}", "question": "Qual famoso fil\u00f3sofo morreu na ilha Eubeia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1211", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hamas> <http://dbpedia.org/property/international> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/PoliticalParty>}", "question": "Qual \u00e9 a religi\u00e3o do partido pol\u00edtico que \u00e9 um partido internacional do Hamas?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year> .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_0"}], "id": "2438", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Australian_of_the_Year> . ?x <http://dbpedia.org/ontology/award> ?uri }", "question": "Quantos t\u00edtulos honor\u00e1rios existem dos cientistas que receberam o pr\u00eamio de Australiano do Ano?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1657", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Buckethead> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Cite alguns programas de TV cujo tema \u00e9 feito por uma banda associada ao Buckethead?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2700", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/K._Terry_Dornbush> <http://dbpedia.org/property/almaMater> ?uri } ", "question": "Qual \u00e9 a alma mater de K. Terry Dornbush?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3082", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brian_Peddle> <http://dbpedia.org/property/predecessor> ?x . ?x <http://dbpedia.org/property/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o local de nascimento do titular do cargo que \u00e9 o antecessor de Brian Peddle?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Southend-on-Sea>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Southend-on-Sea> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "2705", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Southend-on-Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Qual \u00e9 o rio que vem da montanha Southend-on-Sea?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4226", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richard_Hofstadter> <http://dbpedia.org/property/doctoralAdvisor> ?x . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . }", "question": "Qual \u00e9 o local de nascimento do conselheiro de Richard Hofstadter?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2302", "query": "ASK WHERE { <http://dbpedia.org/resource/Abdelhameed_Amarri> <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Khartoum> }", "question": "Abdelhameed Amarri joga atualmente pelo Cartum?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1130", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Levi_Lincoln,_Jr.> . ?x <http://dbpedia.org/property/successor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Governor>}", "question": "Qual \u00e9 o sucessor dos governadores cujo filho \u00e9 Levi Lincoln Jr.?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1461", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Jeffery> <http://dbpedia.org/property/primeminister> ?uri } ", "question": "Quem \u00e9 o primeiro-ministro a quem Michael Jeffery serviu?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)>", "target_var": "?u_0"}], "id": "276", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)>  . }", "question": "Quantas pessoas s\u00e3o conhecidas pelo Dragons &#39;Den?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2222", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Piotr_Gruszka> <http://dbpedia.org/property/hometown> ?uri } ", "question": "O que \u00e9 a cidade natal de Pitro Gruszka?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4322", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/magazine> <http://dbpedia.org/resource/Jump_Square> . ?x <http://dbpedia.org/property/author> ?uri  . }", "question": "Quantos escritores diferentes escreveram para a Jump Square?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1302", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ralph_Flanders> <http://dbpedia.org/property/occupation> ?uri } ", "question": "Quem \u00e9 o empregador de Ralph Flanders?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Aardman_Animations> <http://dbpedia.org/ontology/keyPerson> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Aardman_Animations> <http://dbpedia.org/ontology/keyPerson> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Aardman_Animations>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Aardman_Animations> <http://dbpedia.org/ontology/keyPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Aardman_Animations>", "target_var": "?u_1"}], "id": "2517", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Aardman_Animations> <http://dbpedia.org/ontology/keyPerson> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Liste os pr\u00eamios dados \u00e0s pessoas importantes da Aardman Animations?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "222", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Christopher_Franke> . ?uri <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/J._Michael_Straczynski>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual programa de TV desenvolvido por J. Michael Stracznski tem artista como Christopher Franke?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Athens> <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Giorgos_Kaminis>", "target_var": "?u_-1"}], "id": "2036", "query": "ASK WHERE { <http://dbpedia.org/resource/Athens> <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Giorgos_Kaminis> }", "question": "Giorgos Kaminis \u00e9 o prefeito de Atenas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1924", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/European_Go_Federation> <http://dbpedia.org/property/membership> ?uri } ", "question": "Nomeie os membros da European Go Federation?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "573", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/TNT_(TV_channel)> . ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jeff_Conaway>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Em qual sitcom Jeff Conaway atuou e teve a TNT como sua rede?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1236", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Grey_Goose_(vodka)> <http://dbpedia.org/property/manufacturer> ?uri. <http://dbpedia.org/resource/Eristoff> <http://dbpedia.org/property/manufacturer> ?uri . }", "question": "Gppse e eristoff cinza s\u00e3o produzidos por qual empresa?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3544", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/National_Academy_Museum_and_School> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Onde est\u00e3o os t\u00famulos dos ex-alunos do museu e da escola oficial da academia?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2133", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_Frisbie_Hoar> <http://dbpedia.org/property/order> ?uri } ", "question": "Qual \u00e9 a ordem de George Frisbie Hoar?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1334", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/superintendent> <http://dbpedia.org/resource/Michelle_D._Johnson> . ?uri <http://dbpedia.org/property/mascot> <http://dbpedia.org/resource/Gyrfalcon>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Entre as universidades que t\u00eam o Gyrfalcon como mascote e que t\u00eam Michelle D. Johnson como superintendente?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2457", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/Bryan_Mantia> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa cuja banda de composi\u00e7\u00e3o do tema tamb\u00e9m teve Bryan Mantia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "418", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Strontium_90_(band)> . ?uri <http://dbpedia.org/property/composer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Liste os programas de televis\u00e3o cujos compositores est\u00e3o associados ao Strontium 90?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4914", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster> . ?uri <http://dbpedia.org/property/currentMembers> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Diga o nome da banda, pelo menos um de seus membros \u00e9 famoso por tocar a Fender Stratocaster?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>", "target_var": "?u_0"}], "id": "1104", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }", "question": "Conte os participantes da NBA."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "257", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/system> <http://dbpedia.org/resource/Norfolk_Southern_Railway> . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RailwayLine>}", "question": "Quem tem estoque nas linhas ferrovi\u00e1rias administradas pela Norfolk Southern Railway?"}]