[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1813", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/McLean_Hospital> . ?x <http://dbpedia.org/property/restingplace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Congressman>}", "question": "Onde est\u00e1 a l\u00e1pide do congressista que morreu no hospital McLean?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2426", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/The_GNOME_Project> . ?uri <http://dbpedia.org/property/programmingLanguage> ?x  . }", "question": "O que est\u00e1 escrito em uma linguagem de programa\u00e7\u00e3o desenvolvida pelo Projeto GNOME?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3950", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Best_Mate> <http://dbpedia.org/property/race> ?uri. <http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?uri} ", "question": "Qual ra\u00e7a \u00e9 o Best Mate tamb\u00e9m \u00e9 a ra\u00e7a do Martin Molony?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4428", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Francis_Palmer_Smith> . ?x <http://dbpedia.org/property/address> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Onde est\u00e1 localizado o edif\u00edcio cujo arquiteto foi Francis Palmer Smith?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1626", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/L\u00ea_H\u1ed3ng_Phong> . ?x <http://dbpedia.org/property/birthPlace> ?uri  . }", "question": "Onde nasceu a pessoa cujo sucessor foi Le Hong Phong?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "789", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fergie_Sutherland> <http://dbpedia.org/property/race> ?uri. <http://dbpedia.org/resource/Coneygree> <http://dbpedia.org/property/race> ?uri . }", "question": "Em qual corrida Coneygree, o cavalo de corrida, e Fergie Sutherland, a treinadora de cavalos participaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3786", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Hillary_Clinton> . ?x <http://dbpedia.org/property/keyPeople> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>}", "question": "Liste todas as pessoas importantes da organiza\u00e7\u00e3o sem fins lucrativos que tem Hilary Clinton como pessoa-chave?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1864", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bobby_Skinstad> <http://dbpedia.org/property/school> ?uri } ", "question": "Listar a escola de Bobby Skinstad?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2009_FIFA_Club_World_Cup_squads> <http://dbpedia.org/ontology/currentMember> <http://dbpedia.org/resource/Lionel_Messi>", "target_var": "?u_-1"}], "id": "2865", "query": "ASK WHERE { <http://dbpedia.org/resource/2009_FIFA_Club_World_Cup_squads> <http://dbpedia.org/ontology/currentMember> <http://dbpedia.org/resource/Lionel_Messi> }", "question": "Lionel Messi fez parte das sele\u00e7\u00f5es da Copa do Mundo da FIFA 2009?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "871", "query": "ASK WHERE { <http://dbpedia.org/resource/Writings_and_Drawings> <http://dbpedia.org/property/illustrator> <http://dbpedia.org/resource/Bob_Dylan> }", "question": "Escritos e desenhos foram ilustrados por Bob Dylan?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team> <http://dbpedia.org/property/champion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team> <http://dbpedia.org/property/champion> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team> <http://dbpedia.org/property/champion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team> <http://dbpedia.org/property/champion> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}], "id": "3271", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/champion> <http://dbpedia.org/resource/2015_Alabama_Crimson_Tide_football_team> . ?uri <http://dbpedia.org/property/athletics> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Contar todas as universidades que participaram do torneio ganho pelo Alabama Crimson Tides em 2015?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Lotuspool_Records> <http://dbpedia.org/ontology/distributingLabel> <http://dbpedia.org/resource/Napster>", "target_var": "?u_-1"}], "id": "3833", "query": "ASK WHERE { <http://dbpedia.org/resource/Lotuspool_Records> <http://dbpedia.org/ontology/distributingLabel> <http://dbpedia.org/resource/Napster> }", "question": "A Lotuspool Records foi distribu\u00edda pelo Napster?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "73", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }", "question": "Liste a moeda base do pa\u00eds cujo hino \u00e9 Oj, svijetla majska zoro."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1752", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Merritt_Cabal> <http://dbpedia.org/ontology/knownFor> ?uri. <http://dbpedia.org/resource/Lucifer's_Hammer> <http://dbpedia.org/ontology/publisher> ?uri} ", "question": "Por qual revista Marritt Cabal \u00e9 conhecida e que tem L\u00facifer Hammer como editora?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}], "id": "1421", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?uri } ", "question": "Qual \u00e9 a empresa-m\u00e3e de Ford Falcon Cobra?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/San_Francisco_Giants>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/San_Francisco_Giants> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_0"}], "id": "4221", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/San_Francisco_Giants>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Quantos jogadores h\u00e1 no San Francisco Giants?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4693", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Seattle_Great_Wheel> <http://dbpedia.org/property/locationTown> ?uri. <http://dbpedia.org/resource/Geography_Club_(play)> <http://dbpedia.org/property/place> ?uri} ", "question": "Em que lugar do Geography Club fica a roda gigante de Seattle?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "4369", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Best_Mate> <http://dbpedia.org/property/race> ?uri  . }", "question": "Quantas corridas o Best Mate ganhou?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4575", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/John_Scott_Harrison>  . }", "question": "Qual governador de Charles Willing teve um filho chamado John Scott?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3809", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lyubov_Dostoyevskaya> <http://dbpedia.org/property/relatives> ?uri } ", "question": "Liste os parentes de Lyubov Dostoyevskaya?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Peruvian_Army> <http://dbpedia.org/ontology/notableCommander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/militaryRank> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Peruvian_Army> <http://dbpedia.org/ontology/notableCommander> ?u_0 .?u_0 <http://dbpedia.org/ontology/militaryRank> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Peruvian_Army> <http://dbpedia.org/ontology/notableCommander> ?u_1", "target_var": "?u_1"}], "id": "2244", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Peruvian_Army> <http://dbpedia.org/ontology/notableCommander> ?x . ?x <http://dbpedia.org/ontology/militaryRank> ?uri  . }", "question": "Qual \u00e9 a patente militar do importante comandante do Ex\u00e9rcito Peruano?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/West_Coast_Airlines> <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Seattle>", "target_var": "?u_-1"}], "id": "3047", "query": "ASK WHERE { <http://dbpedia.org/resource/West_Coast_Airlines> <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Seattle> }", "question": "As companhias a\u00e9reas da costa oeste voam para Seattle?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Arlington_County,_Virginia>", "target_var": "?u_0"}], "id": "2445", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Arlington_County,_Virginia> } ", "question": "Quais unidades est\u00e3o guarnecidas no condado de Arlington, Virg\u00ednia?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Ethics>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/placeOfDeath> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Ethics> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/placeOfDeath> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Ethics>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Ethics> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "494", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Ethics> . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Em quantos lugares diferentes os fil\u00f3sofos da ehtics morreram?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3130", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Dognapper>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Quem \u00e9 o personagem fict\u00edcio que estrelou em The Dognapper?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4321", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/property/developer> ?uri } ", "question": "Quem \u00e9 o desenvolvedor do Dart (linguagem de programa\u00e7\u00e3o)?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/publisher> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_0 <http://dbpedia.org/ontology/publisher> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/publisher> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_0 <http://dbpedia.org/ontology/publisher> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/publisher> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/publisher> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/publisher> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_1 <http://dbpedia.org/ontology/publisher> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/publisher> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> .?u_1 <http://dbpedia.org/ontology/publisher> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_0"}], "id": "4397", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Jazz> . ?x <http://dbpedia.org/ontology/publisher> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Qual casa publicou livros sobre Jazz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1164", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Incredible_Hulk_(1982_TV_series)> <http://dbpedia.org/property/narrated> ?uri. <http://dbpedia.org/resource/Tales_of_Suspense> <http://dbpedia.org/property/writers> ?uri} ", "question": "Qual pessoa narrou O Incr\u00edvel Hulk e tamb\u00e9m o escritor de Contos de Suspense?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3734", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Buckinghamshire> . ?x <http://dbpedia.org/ontology/parent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quem s\u00e3o os pais de escritores nascidos e criados em Buckinghamshire?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1730", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/PATTS_College_of_Aeronautics> <http://dbpedia.org/property/athletics> ?uri. <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?uri} ", "question": "Liste os esportes mais comuns praticados pela PATTS College of Aeronautics e pela lytechnic University of the Philippines Taguig?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4812", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/material> <http://dbpedia.org/resource/Concrete> . ?x <http://dbpedia.org/ontology/builder> ?uri  . }", "question": "Quantas empresas constru\u00edram pontes de concreto?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/director> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/director> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_1 <http://dbpedia.org/ontology/director> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_0 <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/director> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> .?u_0 <http://dbpedia.org/ontology/director> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/director> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}], "id": "2402", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Parsons_School_of_Design> . ?uri <http://dbpedia.org/ontology/director> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes foram dirigidos por almunies da Parsons School of Design?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Association_football>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Association_football> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1 .?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Association_football>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Association_football> .?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "3403", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Association_football> . ?x <http://dbpedia.org/ontology/sport> ?uri }", "question": "Contar o n\u00famero de esportes praticados pela escola que tamb\u00e9m joga futebol da associa\u00e7\u00e3o?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "618", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/battles> <http://dbpedia.org/resource/SFOR> . ?x <http://dbpedia.org/ontology/battle> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>}", "question": "Os militares de quais pa\u00edses lutaram na batalha da SFOR?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Hyderabad>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Hyderabad> .?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Hyderabad>", "target_var": "?u_1"}], "id": "1697", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Hyderabad> . ?x <http://dbpedia.org/ontology/party> ?uri  . }", "question": "Liste as pessoas que morreram em Hyderabad e s\u00e3o membros de um partido pol\u00edtico?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3593", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Kansas_City,_Missouri> . ?uri <http://dbpedia.org/property/champion> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballLeague>}", "question": "Qual \u00e9 a liga de futebol americano cujo campe\u00e3o \u00e9 de Kansas City, Missouri?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/doctoralAdvisor> <http://dbpedia.org/resource/Ernest_Rutherford>", "target_var": "?u_0"}], "id": "1957", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/doctoralAdvisor> <http://dbpedia.org/resource/Ernest_Rutherford>  . }", "question": "Quantas teses foram orientadas por Ernest Rutherford?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1221", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/writers> <http://dbpedia.org/resource/Kentaro_Takekuma> . ?x <http://dbpedia.org/property/publisher> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Comic>}", "question": "Quem \u00e9 o editor da hist\u00f3ria em quadrinhos, um de seus autores \u00e9 Kentaro Takekuma?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2073", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralAdvisor> <http://dbpedia.org/resource/Ernest_Rutherford> . ?uri <http://dbpedia.org/property/knownFor> <http://dbpedia.org/resource/Manhattan_Project>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Liste os cientistas cujo orientador de doutorado \u00e9 Ernest Rutherford e s\u00e3o conhecidos pelo Projeto Manhattan?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3410", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Western_Naval_Command> <http://dbpedia.org/property/garrison> ?uri } ", "question": "Onde est\u00e1 a guarni\u00e7\u00e3o do Comando Naval Ocidental?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Bengalis>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Bengalis> .?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Bengalis>", "target_var": "?u_1"}], "id": "869", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Bengalis> . ?x <http://dbpedia.org/ontology/party> ?uri  . }", "question": "Qual \u00e9 o partido pol\u00edtico dos bengalis?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2718", "query": "ASK WHERE { <http://dbpedia.org/resource/John_of_Damascus> <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Anglican_Communion> }", "question": "Jo\u00e3o Damasceno foi canonizado pela Comunh\u00e3o Anglicana?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1042", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Jean-Marc_Germain> . ?uri <http://dbpedia.org/property/mayor> ?x  . }", "question": "O prefeito de qual cidade \u00e9 casado com Jean Marc Germain?"}]