[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>", "target_var": "?u_1"}], "id": "3488", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> . ?x <http://dbpedia.org/property/writer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalWork>}", "question": "Quem escreveu can\u00e7\u00f5es que foram gravadas no Criteria Studios?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Volleyball>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Volleyball>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/athletics> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Volleyball>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Volleyball>", "target_var": "?u_0"}], "id": "1133", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Volleyball> . ?x <http://dbpedia.org/property/athletics> ?uri }", "question": "Contar o n\u00famero de esportes praticados pelas universidades que tamb\u00e9m praticam Voleibol?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1805", "query": "ASK WHERE { <http://dbpedia.org/resource/Brazil> <http://dbpedia.org/property/largestCity> <http://dbpedia.org/resource/S\u00e3o_Paulo> }", "question": "S\u00e3o Paulo \u00e9 a maior cidade do Brasil?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Katy_B> <http://dbpedia.org/ontology/recordLabel> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Katy_B> <http://dbpedia.org/ontology/recordLabel> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B> .?u_0 <http://dbpedia.org/ontology/recordLabel> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Katy_B> <http://dbpedia.org/ontology/recordLabel> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B> .?u_1 <http://dbpedia.org/ontology/recordLabel> ?u_0", "target_var": "?u_0"}], "id": "3492", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Katy_B> . ?x <http://dbpedia.org/ontology/recordLabel> ?uri  . }", "question": "Por quantas gravadoras Katy B lan\u00e7ou seus singles?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/William_L._Dayton> <http://dbpedia.org/ontology/appointer> ?u_0", "target_var": "?u_0"}], "id": "4709", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_L._Dayton> <http://dbpedia.org/ontology/appointer> ?uri } ", "question": "Quem nomeou William L. Dayton?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Wichita_Recordings> <http://dbpedia.org/ontology/distributingLabel> <http://dbpedia.org/resource/PIAS_Recordings>", "target_var": "?u_-1"}], "id": "4630", "query": "ASK WHERE { <http://dbpedia.org/resource/Wichita_Recordings> <http://dbpedia.org/ontology/distributingLabel> <http://dbpedia.org/resource/PIAS_Recordings> }", "question": "A PIAS Recordings \u00e9 a gravadora distribuidora da Wichita Recordings?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/X_the_Unknown> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gerald_Gibbs_(cinematographer)>", "target_var": "?u_-1"}], "id": "3453", "query": "ASK WHERE { <http://dbpedia.org/resource/X_the_Unknown> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gerald_Gibbs_(cinematographer)> }", "question": "Gerald Gibbs foi o diretor de fotografia de X the unknown?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3199", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Trevor_Peacock>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Trevor Peacock narrou em qual filme?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Leslie_Sanchez> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_0"}], "id": "3634", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Leslie_Sanchez> <http://dbpedia.org/ontology/education> ?uri } ", "question": "A quais institui\u00e7\u00f5es de ensino Lesli Sanchez foi para estudar?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_Les_Paul>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_Les_Paul> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}], "id": "3939", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_Les_Paul>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Quais s\u00e3o alguns artistas famosos que arrasaram em uma Les Paul?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2015_Pro_Duta_FC_season> <http://dbpedia.org/property/stadium> ?u_0", "target_var": "?u_0"}], "id": "1811", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2015_Pro_Duta_FC_season> <http://dbpedia.org/property/stadium> ?uri } ", "question": "Qual \u00e9 o est\u00e1dio da temporada 2015 do Pro Duta FC?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}], "id": "4049", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?uri } ", "question": "Pointe d&#39;Aveneyre pertence a que cordilheira?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1428", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Jerry_Bock> . ?x <http://dbpedia.org/ontology/basedOn> ?uri  . }", "question": "Os musicais de Jerry Bock foram adaptados de quantas coisas?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3131", "query": " SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Mark_Stevens_(film_editor)> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Joel_Schumacher> } ", "question": "Contar os filmes editados por Mark Stevens (montador) e dirigidos por Joel Schumacher?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3396", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Grasim_Bhiwani_Textiles> <http://dbpedia.org/property/parent> ?x . ?x <http://dbpedia.org/property/foundation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Em que cidade foi fundada a empresa propriet\u00e1ria da Grasim Bhiwani Textiles?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2820", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Argentine_Primera_Divisi\u00f3n> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "De quem os clubes juvenis costumavam participar da Primera Division argentina?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1452", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/deathCause> <http://dbpedia.org/resource/Hanging> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Liste algumas pessoas que eram oponentes de algu\u00e9m que morreu enforcado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "593", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Newark_station_(Delaware)> <http://dbpedia.org/property/line> ?x . ?x <http://dbpedia.org/property/owner> ?uri  . }", "question": "Quem \u00e9 o dono da linha ferrovi\u00e1ria que passa pela esta\u00e7\u00e3o de Newark?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "41", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Crystal_Harris> . ?uri <http://dbpedia.org/property/editor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Magazine>}", "question": "O editor de qual revista \u00e9 casado com Crystal Harris?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "560", "query": "ASK WHERE { <http://dbpedia.org/resource/Compaq> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Software> }", "question": "A Compaq \u00e9 uma empresa de software?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?u_0 .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/governmentType> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/governmentType> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?u_1 .?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}], "id": "3273", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kerguelen_Islands> <http://dbpedia.org/ontology/governmentType> ?x . ?x <http://dbpedia.org/ontology/currency> ?uri  . }", "question": "Qual \u00e9 a moeda do pa\u00eds das Ilhas Kerguelen?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3244", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company> . ?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Brian_Dunkleman>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual sitcom \u00e9 transmitida pela FOX e apresentada por Brian Dunkleman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "243", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Amitava_Datta> <http://dbpedia.org/property/almaMater> ?x . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Quais esportes s\u00e3o praticados na alma mater de Amitava Datta?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1339", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Edsel> <http://dbpedia.org/property/parent> ?uri } ", "question": "Qual \u00e9 a empresa-m\u00e3e da Edsel?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3799", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/Playtone>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos shows s\u00e3o feitos pela Playtone?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rhode_Island_Route_15> <http://dbpedia.org/ontology/routeJunction> ?u_0", "target_var": "?u_0"}], "id": "261", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rhode_Island_Route_15> <http://dbpedia.org/ontology/routeJunction> ?uri } ", "question": "Qual \u00e9 o entroncamento da rota 15 de Rhode Island?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Owyhee_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Oregon>", "target_var": "?u_-1"}], "id": "2764", "query": "ASK WHERE { <http://dbpedia.org/resource/Owyhee_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Oregon> }", "question": "O rio owyhee corre para oregon?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1689", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Mrunalini_Kunte> . ?x <http://dbpedia.org/property/knownFor> ?uri  . }", "question": "Pelo que o famoso parente de Mrunalini Kunte \u00e9 conhecido?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1725", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lawrence_Okoye> <http://dbpedia.org/property/nationality> ?uri } ", "question": "De que pa\u00eds \u00e9 a nacionalidade de Lawrence Okoye?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4792", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Barasat_(Lok_Sabha_constituency)> . ?x <http://dbpedia.org/ontology/party> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "De qual partido \u00e9 o pol\u00edtico que foi selecionado no c\u00edrculo eleitoral de Barasat?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "834", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Pugh> <http://dbpedia.org/property/associatedActs> ?uri } ", "question": "Nomeie os atos associados de Martin Pugh?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1866", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/illustrator> <http://dbpedia.org/resource/Hiroyuki_Takei> . ?x <http://dbpedia.org/property/author> ?uri  . }", "question": "Quem \u00e9 o autor da obra ilustrada por Hiroyuki Takei?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2496", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carl_Stokes> <http://dbpedia.org/property/president> ?uri. <http://dbpedia.org/resource/Joseph_Stiglitz> <http://dbpedia.org/property/president> ?uri . }", "question": "Quem era o presidente na \u00e9poca em que Carl Stokes e Joseph Stiglitz ocupavam um cargo na estrutura pol\u00edtica dos Estados Unidos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2988", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mercedes-Benz_Superdome> <http://dbpedia.org/ontology/tenant> ?uri } ", "question": "Quais s\u00e3o os inquilinos do Mercedes-Benz Superdome?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1601", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Leallah> <http://dbpedia.org/property/trainer> ?x . ?x <http://dbpedia.org/property/birthPlace> ?uri  . }", "question": "Qual \u00e9 a cidade natal do treinador de Leallah?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3875", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Susie_Liggat> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o alguns programas de TV semelhantes ao produzido por Susie Liggat?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> .?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> .?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "4694", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual programa de televis\u00e3o \u00e9 baseado em Massachusetts e tem como tema de abertura &quot;Where Everybody Knows Your Name&quot;?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "480", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/John_Fanning_(businessman)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Nomeie o software que foi desenvolvido por John Fanning?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Current_River_(Missouri)> <http://dbpedia.org/ontology/mouthMountain> ?u_0", "target_var": "?u_0"}], "id": "2825", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Current_River_(Missouri)> <http://dbpedia.org/ontology/mouthMountain> ?uri } ", "question": "Qual \u00e9 a montanha da foz do rio Current (Missouri)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4329", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/titles> <http://dbpedia.org/resource/Doctor_of_the_Church> . ?x <http://dbpedia.org/ontology/canonizedBy> ?uri  . }", "question": "Quem canonizou algu\u00e9m que \u00e9 m\u00e9dico da igreja?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/First_National_Bank_and_Trust_Building_(Lima,_Ohio)> <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/Chicago>", "target_var": "?u_-1"}], "id": "3540", "query": "ASK WHERE { <http://dbpedia.org/resource/First_National_Bank_and_Trust_Building_(Lima,_Ohio)> <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/Chicago> }", "question": "foi o primeiro banco nacional e edif\u00edcio de confian\u00e7a arquitetado por Chicago?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4638", "query": "ASK WHERE { <http://dbpedia.org/resource/Holler_If_Ya_Hear_Me_(musical)> <http://dbpedia.org/property/lyrics> <http://dbpedia.org/resource/Tupac_Shakur> }", "question": "Tupac escreveu as letras de Holler If Ya Hear Me?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/James_Roberts_(trade_unionist)> <http://dbpedia.org/ontology/vicePresident> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}], "id": "3046", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/vicePresident> <http://dbpedia.org/resource/James_Roberts_(trade_unionist)> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "Onde est\u00e1 a l\u00e1pide dos membros do parlamento que serviram com James Roberts como o vice-presidente dos EUA?"}]