[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/owner> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_0 <http://dbpedia.org/property/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_0 <http://dbpedia.org/property/owner> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}], "id": "3017", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Boston> . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Quem \u00e9 o dono de uma ponte em Boston?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1566", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paul_Demi\u00e9ville> <http://dbpedia.org/property/fields> ?uri. <http://dbpedia.org/resource/Sylvain_L\u00e9vi> <http://dbpedia.org/property/fields> ?uri . }", "question": "Em que campos Paul Demiville e Sylvain levi s\u00e3o especialistas?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/tenant> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction> .?u_0 <http://dbpedia.org/ontology/tenant> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction>", "target_var": "?u_1"}], "id": "31", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/PCL_Construction> . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }", "question": "Quantos tenats houve, das constru\u00e7\u00f5es de constru\u00e7\u00f5es PCL?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?u_0 .<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}], "id": "937", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?uri. <http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?uri} ", "question": "Qual n\u00e3o fic\u00e7\u00e3o do Thud tamb\u00e9m \u00e9 o campo do Jon Speelman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1215", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Victor_Hope,_2nd_Marquess_of_Linlithgow> <http://dbpedia.org/property/primeminister> ?uri. <http://dbpedia.org/resource/British_Gazette> <http://dbpedia.org/property/editor> ?uri} ", "question": "Quem foi o primeiro-ministro de Victor Hope, 2\u00ba Marqu\u00eas de Linlithgow e tamb\u00e9m o editor da British Gazette?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1937", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/Alain_Vigneault>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HockeyTeam>}", "question": "Qual \u00e9 o time de h\u00f3quei cujo t\u00e9cnico \u00e9 Alain Vigneault?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Patterson_Houses> <http://dbpedia.org/ontology/municipality> ?u_0", "target_var": "?u_0"}], "id": "1129", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Patterson_Houses> <http://dbpedia.org/ontology/municipality> ?uri } ", "question": "Qual \u00e9 o munic\u00edpio de Patterson Houses?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/archipelago> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> .?u_0 <http://dbpedia.org/property/archipelago> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete>", "target_var": "?u_0"}], "id": "309", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }", "question": "Conte-me tudo sob o arquip\u00e9lago, onde Papeete \u00e9 a maior cidade."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4901", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Lake_Washington> . ?x <http://dbpedia.org/property/sourceLocation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Onde come\u00e7am os rios que terminam no lago washington?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Soccer_Bowl_'76> <http://dbpedia.org/ontology/city> ?u_0", "target_var": "?u_0"}], "id": "3113", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Soccer_Bowl_'76> <http://dbpedia.org/ontology/city> ?uri } ", "question": "onde aconteceu o boliche de futebol em 76?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Inthakin> <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?u_0 .<http://dbpedia.org/resource/Inthakin> <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_0"}], "id": "495", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?uri. <http://dbpedia.org/resource/Inthakin> <http://dbpedia.org/ontology/type> ?uri} ", "question": "Que ideologia pol\u00edtica do Partido Palang Dharma \u00e9 a relegi\u00e3o de Inthakin?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> <http://dbpedia.org/resource/C_(programming_language)>", "target_var": "?u_-1"}], "id": "3357", "query": "ASK WHERE { <http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> <http://dbpedia.org/resource/C_(programming_language)> }", "question": "O GIMP \u00e9 escrito em C?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3830", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Bergen-Belsen_concentration_camp> . ?x <http://dbpedia.org/ontology/relative> ?uri  . }", "question": "Quem \u00e9 parente das pessoas que morreram no campo de concentra\u00e7\u00e3o de Bergen-Belsen?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "305", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/style> <http://dbpedia.org/resource/Burr_Truss> . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Em que estado posso encontrar pontes no estilo Burr Truss?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3793", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/PlayStation_2> . ?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Asus>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}", "question": "Quais informa\u00e7\u00f5es. aparelho \u00e9 fabricado pela Asus e \u00e9 o antecessor do PS 2?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Adventures_of_Tom_Sawyer> <http://dbpedia.org/ontology/coverArtist> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Adventures_of_Tom_Sawyer> <http://dbpedia.org/ontology/coverArtist> ?u_0 .<http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?u_0", "target_var": "?u_0"}], "id": "2201", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Adventures_of_Tom_Sawyer> <http://dbpedia.org/ontology/coverArtist> ?uri. <http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?uri} ", "question": "Qual artista da capa de The Adventures of Tom Sawyer tamb\u00e9m foi a fonte de inspira\u00e7\u00e3o de The Appple Tree?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "843", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Andr\u00e9_Bourgeois> . ?x <http://dbpedia.org/ontology/genre> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RecordLabel>}", "question": "Que tipo de m\u00fasica \u00e9 produzida na gravadora fundada por Andre Bourgeois?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3872", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frank_Steunenberg> <http://dbpedia.org/property/lieutenant> ?x . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . }", "question": "Qual \u00e9 o local da morte do tenente de Frank Steunenberg?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/hairColor> <http://dbpedia.org/resource/Brown_hair>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/title> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/hairColor> <http://dbpedia.org/resource/Brown_hair> .?u_0 <http://dbpedia.org/property/title> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/hairColor> <http://dbpedia.org/resource/Brown_hair>", "target_var": "?u_1"}], "id": "2251", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/hairColor> <http://dbpedia.org/resource/Brown_hair> . ?x <http://dbpedia.org/property/title> ?uri  . }", "question": "Quantos t\u00edtulos foram conquistados pelas rainhas da beleza de cabelos castanhos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/High_Desert_(Oregon)> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}], "id": "211", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/High_Desert_(Oregon)> <http://dbpedia.org/ontology/border> ?uri } ", "question": "Quais s\u00e3o as fronteiras de High Desert (Oregon)?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Burnside_Distribution_Corporation> <http://dbpedia.org/ontology/locationCity> ?u_0", "target_var": "?u_0"}], "id": "3997", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Burnside_Distribution_Corporation> <http://dbpedia.org/ontology/locationCity> ?uri } ", "question": "Qual \u00e9 a cidade local da Burnside Distribution Corporation?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "679", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Birdman_Enterprises> . ?x <http://dbpedia.org/property/nationality> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Engineer>}", "question": "As pessoas de que pa\u00eds trabalham nas empresas Birdman?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "565", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oskar_Blues_Brewery> <http://dbpedia.org/property/location> ?uri } ", "question": "Onde est\u00e1 Oskar Blues?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3290", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Paul_Leonard_(writer)> . ?x <http://dbpedia.org/ontology/series> ?uri  . }", "question": "O trabalho de Paul Leonard pode ser dividido em quantas s\u00e9ries?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4354", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Lovelace_Medal> . ?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Norbert_Wiener_Award_for_Social_and_Professional_Responsibility> . }", "question": "Quem ganhou a Medalha Lovelace e o Pr\u00eamio Norbert Wiener de Responsabilidade Social e Profissional?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "680", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Mariveles,_Bataan> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Liste os esportes associados a Mariveles, Bataan?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "180", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_Gregory_I> <http://dbpedia.org/property/veneratedIn> ?uri } ", "question": "Quais lugares sagrados consideravam o Papa Greg\u00f3rio I um santo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4279", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mike_McCurry_(press_secretary)> <http://dbpedia.org/ontology/president> ?uri. <http://dbpedia.org/resource/Al_Gore_presidential_campaign,_2000> <http://dbpedia.org/ontology/incumbent> ?uri} ", "question": "Qual titular da campanha presidencial de Al Gore foi tamb\u00e9m presidente de Mike McCurry?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2495", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frontaccounting> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/GNOWSYS> <http://dbpedia.org/ontology/developer> ?uri} ", "question": "Qual software \u00e9 desenvolvido pela GNOWSYS e licenciado pela Frontaccounting?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2316", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pulau_Ubin> <http://dbpedia.org/ontology/largestCity> ?uri. <http://dbpedia.org/resource/Pulau_Ujong> <http://dbpedia.org/ontology/capital> ?uri} ", "question": "Qual centro administrativo de Pulau Ujong \u00e9 tamb\u00e9m a maior cidade de Pulau Ubin?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4273", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/PrivateCore> } ", "question": "Qual \u00e9 a empresa-m\u00e3e da PrivateCore?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Gloucestershire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> .?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Gloucestershire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Gloucestershire> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> .?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Gloucestershire> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "3683", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> . ?uri <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Gloucestershire>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Nomeie o rio com a foz Essex e o local de origem como Gloucestershire?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4762", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dick_Redding> <http://dbpedia.org/property/birthDate> ?uri } ", "question": "Em que prov\u00edncia nasceu Dick Redding?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "432", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingmar_Bergman> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/James_F._O'Brien> <http://dbpedia.org/ontology/award> ?uri} ", "question": "Que pr\u00eamios foram concedidos a Ingmar Bergman e James O&#39;Brien?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "289", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/characters> <http://dbpedia.org/resource/Catwoman> . ?x <http://dbpedia.org/property/characters> ?uri }", "question": "Contar o n\u00famero de personagens da pe\u00e7a cujo personagem \u00e9 a Mulher-Gato?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1027", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/University_of_the_West_Indies> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "Onde mais os graduados da University of West Indies estudaram?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "535", "query": "ASK WHERE { <http://dbpedia.org/resource/NOAAS_Davidson_(S_331)> <http://dbpedia.org/ontology/homeport> <http://dbpedia.org/resource/Seattle> }", "question": "O NOAAS Davidson (S 331) tem um porto dom\u00e9stico em Seattle?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3631", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Bjarne_Stroustrup> . ?uri <http://dbpedia.org/property/programmingLanguage> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Liste as escolas cujo mascote \u00e9 um animal da ordem dos Ungulados com dedos iguais?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "188", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri  . }", "question": "Contar o n\u00famero de cidades no Mar Mediterr\u00e2neo?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3915", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Judson_Huss> <http://dbpedia.org/property/deathPlace> ?uri } ", "question": "Diga o local da morte de Judson Huss?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "270", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/\u014ctani_University> <http://dbpedia.org/property/affiliation> ?uri } ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o da tani University?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1728", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Benelux> <http://dbpedia.org/property/currency> ?uri } ", "question": "Qual \u00e9 a moeda base do Benelux?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4075", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Temenos_Group> <http://dbpedia.org/property/foundation> ?uri. <http://dbpedia.org/resource/Jerzy_J\u00f3zef_Potocki> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Que lugar de funda\u00e7\u00e3o do Grupo Temenos \u00e9 o lugar da morte de Jerzy Jzef Poocki?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2157", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Data_center_services> . ?x <http://dbpedia.org/property/services> ?uri }", "question": "Me d\u00ea uma contagem dos servi\u00e7os da empresa que fornece Data center como os servi\u00e7os?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3931", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Europa_(moon)> <http://dbpedia.org/property/discoverer> ?uri. <http://dbpedia.org/resource/Callisto_(moon)> <http://dbpedia.org/ontology/discoverer> ?uri} ", "question": "Quem descobriu Europa e Callisto?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "111", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Outlook.com> . ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/OneDrive> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual empresa oferece o servi\u00e7o Outlook.com e OneDrive?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "220", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/architect> <http://dbpedia.org/resource/Chumash_people> . ?x <http://dbpedia.org/ontology/governingBody> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Que corpo governa o lugar feito pelo povo chumash?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "627", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Waxiang_people> <http://dbpedia.org/property/related> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EthnicGroup>}", "question": "Qual \u00e9 a religi\u00e3o do grupo \u00e9tnico ao qual pertencem os parentes do povo Waxiang?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Alexander_Magleby> <http://dbpedia.org/ontology/university> <http://dbpedia.org/resource/Dartmouth_College>", "target_var": "?u_-1"}], "id": "1181", "query": "ASK WHERE { <http://dbpedia.org/resource/Alexander_Magleby> <http://dbpedia.org/ontology/university> <http://dbpedia.org/resource/Dartmouth_College> }", "question": "Alexander Magleby estudou no Dartmouth College?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3381", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Noe_Valley,_San_Francisco> . ?uri <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/USS_Kittiwake_(ASR-13)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o titular do cargo cujo distrito eleitoral \u00e9 Noe Valley, San Francisco e pertence \u00e0 unidade militar USS Kittiwake (ASR-13)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2422", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Shore_Plaza> <http://dbpedia.org/property/address> ?uri } ", "question": "Onde est\u00e1 localizada a pra\u00e7a da costa sul?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associate> <http://dbpedia.org/resource/John_Betts_(Connecticut_politician)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associate> <http://dbpedia.org/resource/John_Betts_(Connecticut_politician)> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/John_Betts_(Connecticut_politician)> <http://dbpedia.org/ontology/associate> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/John_Betts_(Connecticut_politician)> <http://dbpedia.org/ontology/associate> ?u_0 .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associate> <http://dbpedia.org/resource/John_Betts_(Connecticut_politician)>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/John_Betts_(Connecticut_politician)> <http://dbpedia.org/ontology/associate> ?u_1", "target_var": "?u_1"}], "id": "790", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Betts_(Connecticut_politician)> <http://dbpedia.org/ontology/associate> ?x . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Quais s\u00e3o os locais de descanso dos associados de John Betts, um pol\u00edtico de Connecticut?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4275", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Waddy_Wachtel>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Waddy Wachtel fez a m\u00fasica para quais filmes?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2d_Command_and_Control_Squadron> <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Colorado>", "target_var": "?u_-1"}], "id": "461", "query": "ASK WHERE { <http://dbpedia.org/resource/2d_Command_and_Control_Squadron> <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Colorado> }", "question": "O 2\u00ba Esquadr\u00e3o de Comando e Controle foi barrado no Colorado?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/39th_Infantry_Regiment_(War_of_1812)>", "target_var": "?u_0"}], "id": "4402", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/39th_Infantry_Regiment_(War_of_1812)>  . }", "question": "Cuja unidade militar era o 39\u00ba regimento de infantaria em 1812?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "551", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Korean_Peninsula> <http://dbpedia.org/ontology/border> ?uri. <http://dbpedia.org/resource/Sodagreen> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Em que pa\u00eds fronteiri\u00e7o da Pen\u00ednsula Coreana era o estado de Sodagreen?"}]