[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4588", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kurt_Vonnegut_Memorial_Library> <http://dbpedia.org/ontology/location> ?uri. <http://dbpedia.org/resource/Louis_LeCocq> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Dos lugares onde existe a Biblioteca Memorial Kurt Vonnegut, onde Louis LeCocq morreu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "283", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ashton_Historic_District> . ?x <http://dbpedia.org/property/college> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}", "question": "Qual \u00e9 a faculdade do jogador de basquete que mora no distrito hist\u00f3rico de Ashton?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Kingdom_of_Israel_(united_monarchy)>", "target_var": "?u_0"}], "id": "4918", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Kingdom_of_Israel_(united_monarchy)> } ", "question": "Durante os reinados de que monarcas era o nome do reino israelita como Monarca Unido?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "842", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sleepy-Time_Squirrel> <http://dbpedia.org/property/director> ?x . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual \u00e9 a pessoa conhecida por quem \u00e9 o diretor de cinema de Sleepy-Time Squirrel?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1513", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kaulahea_I> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/property/title> ?uri  . }", "question": "Qual \u00e9 o t\u00edtulo do sucessor de Kaulahea I?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Reading,_Berkshire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Essex>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Reading,_Berkshire> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Reading,_Berkshire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Reading,_Berkshire> .?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Reading,_Berkshire> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Reading,_Berkshire> .?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "1168", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Reading,_Berkshire> . ?uri <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Essex>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Nomeie o rio que passa por Reading Berkshire e tem uma foz em Essex?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1592", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dornier_Aerodyne> <http://dbpedia.org/property/nationalOrigin> ?uri } ", "question": "Qual na\u00e7\u00e3o \u00e9 a origem de Dornier Aerodyne?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3460", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nearestCity> <http://dbpedia.org/resource/Orange,_Virginia> . ?uri <http://dbpedia.org/property/restingplace> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Diga o nome de alguns pol\u00edticos enterrados em um lugar perto de Orange Virginia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3165", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tales_of_Suspense> <http://dbpedia.org/property/writers> ?uri. <http://dbpedia.org/resource/Karakuri_D\u00f4ji_Ultimo> <http://dbpedia.org/property/author> ?uri} ", "question": "Qual escritor de Tales of Suspense \u00e9 tamb\u00e9m o escritor de karakuri Dji Ultimo?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2284", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Qu\u00e1n_Th\u00e1nh_Temple> <http://dbpedia.org/property/buildingType> ?uri } ", "question": "Que tipo de constru\u00e7\u00e3o \u00e9 o Templo Qun Thnh?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3575", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/I_Can't_Change_the_World> <http://dbpedia.org/property/album> ?x . ?x <http://dbpedia.org/property/artist> ?uri  . }", "question": "Quem \u00e9 o artista do \u00e1lbum que tem a m\u00fasica I Can&#39;t Change the World?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ilya_Savelev> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?u_0 .<http://dbpedia.org/resource/Ilya_Savelev> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}], "id": "4870", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?uri. <http://dbpedia.org/resource/Ilya_Savelev> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Em que cidade come\u00e7a a rota da ferrovia de alta velocidade Moscou-Kazan e onde nasceu Ilya Savelev?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Erik_Bork>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> .?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Erik_Bork>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Erik_Bork> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> .?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Erik_Bork> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2305", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> . ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Erik_Bork>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Listar programas de TV com o produtor Erik Bork e a companhia DreamWorks Television?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0 .<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0 .?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0 .?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0 .<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0 .?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_1 .<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_0 .<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?u_1 .?u_0 <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?u_1 .?u_0 <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}], "id": "952", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pointe_d'Aveneyre> <http://dbpedia.org/ontology/mountainRange> ?uri. <http://dbpedia.org/resource/Le_Gibloux> <http://dbpedia.org/ontology/mountainRange> ?uri . }", "question": "Qual cordilheira \u00e9 aquela com Ponte d&#39;Aveneyre e Le Gibloux?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4942", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/operatedBy> <http://dbpedia.org/resource/Russian_Railways> . ?x <http://dbpedia.org/ontology/routeStart> ?uri  . }", "question": "Em quais cidades algumas ferrovias operadas por ferrovias russas come\u00e7am?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3053", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Demis_Roussos> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Colaboradores de Demis Roussos compuseram m\u00fasicas para quais filmes?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4559", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/placeOfBurial> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Em quantos lugares est\u00e3o os t\u00famulos de todos os que morreram na Inglaterra?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/San_Diego_Convention_Center>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/venue> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/venue> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/San_Diego_Convention_Center> .?u_0 <http://dbpedia.org/property/venue> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/venue> ?u_0 .?u_0 <http://dbpedia.org/property/venue> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/San_Diego_Convention_Center>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/San_Diego_Convention_Center> .?u_1 <http://dbpedia.org/property/venue> ?u_0", "target_var": "?u_0"}], "id": "1489", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/venue> <http://dbpedia.org/resource/San_Diego_Convention_Center> . ?x <http://dbpedia.org/property/venue> ?uri  . }", "question": "Cite todos os locais da conven\u00e7\u00e3o que tamb\u00e9m foram sediados na Conven\u00e7\u00e3o de San Diego?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "927", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Brian_Dunkleman>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Brian Dunkleman \u00e9 o apresentador de qual programa de TV?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3545", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Ferrero_SpA>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>}", "question": "Qual bebida foi lan\u00e7ada pela Ferrero SpA?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/Filipinos>", "target_var": "?u_0"}], "id": "4361", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/Filipinos>  . }", "question": "Quantas pessoas famosas s\u00e3o dos filipinos?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1921", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Riverside_Stadium> . ?uri <http://dbpedia.org/ontology/managerClub> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quantas pessoas dirigiram um clube propriet\u00e1rio do Riverside Stadium?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_0 <http://dbpedia.org/ontology/lieutenant> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant> .?u_0 <http://dbpedia.org/ontology/lieutenant> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant> .?u_0 <http://dbpedia.org/ontology/lieutenant> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_1 <http://dbpedia.org/ontology/lieutenant> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> .?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant> .?u_1 <http://dbpedia.org/ontology/lieutenant> ?u_0", "target_var": "?u_1"}], "id": "351", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell> . ?uri <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant> . }", "question": "Quem teve Joe Purcell e Winston Bryant como tenentes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4898", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/children> <http://dbpedia.org/resource/William_Campbell_Preston_Breckinridge> . ?x <http://dbpedia.org/ontology/parent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quem era o pai da pessoa cujo filho \u00e9 William CP breckinridge?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3393", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Willem_Cornelis_Janse_van_Rensburg> <http://dbpedia.org/property/restingplace> ?uri. <http://dbpedia.org/resource/Thomas_Fran\u00e7ois_Burgers> <http://dbpedia.org/property/restingplace> ?uri . }", "question": "Onde est\u00e3o os cemit\u00e9rios de Willem Cornelis Janse van Rensburg e Thomas Franois Burgers?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/George_Cash> <http://dbpedia.org/property/parliament> <http://dbpedia.org/resource/Western_Australia>", "target_var": "?u_-1"}], "id": "2721", "query": "ASK WHERE { <http://dbpedia.org/resource/George_Cash> <http://dbpedia.org/property/parliament> <http://dbpedia.org/resource/Western_Australia> }", "question": "George Cash estava no parlamento australiano ocidental?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4981", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/mouthLocation> <http://dbpedia.org/resource/Saunders_County,_Nebraska> . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stream>}", "question": "Por quais estados passa o riacho que termina no condado de Saunders?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "718", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/district> <http://dbpedia.org/resource/Blytheville_School_District> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Quais s\u00e3o os mascotes da escola no distrito escolar de Blytheville?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2702", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carmel_Winery> <http://dbpedia.org/property/locationCountry> ?uri. <http://dbpedia.org/resource/Teperberg_1870> <http://dbpedia.org/property/locationCountry> ?uri . }", "question": "Em que pa\u00eds est\u00e3o as vin\u00edcolas Carmel e Teperberg 1870?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> .?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> .?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2722", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> . ?uri <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de TV transmitido pela Fox e apresentado por Ryan Seacrest?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4561", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }", "question": "Conte as religi\u00f5es seguidas por pessoas que vivem na Col\u00fambia Brit\u00e2nica."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "308", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/currentMember> <http://dbpedia.org/resource/Ndonga_Mianga> . ?x <http://dbpedia.org/property/name> ?uri  . }", "question": "Liste alguns companheiros de equipe do Ndonga Mianga?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1675", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lysistrata> <http://dbpedia.org/property/characters> ?uri } ", "question": "Listar os personagens de Lysistrata?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "366", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/Brian_Graden> . ?uri <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Broadcast_syndication>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual distribuidor de programas de TV \u00e9 transmiss\u00e3o de transmiss\u00e3o e \u00e9 desenvolvido por Brian Graden?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4506", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/borough> <http://dbpedia.org/resource/Tendring> . ?x <http://dbpedia.org/ontology/district> ?uri  . }", "question": "Em quantos distritos existe um bairro chamado zelador?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_1 <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_1 <http://dbpedia.org/ontology/athletics> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_0 <http://dbpedia.org/ontology/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> .?u_0 <http://dbpedia.org/ontology/athletics> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_1"}], "id": "2078", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Lanao_del_Sur> . ?x <http://dbpedia.org/ontology/athletics> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Que jogos s\u00e3o disputados nas universidades de Lanao Del Sur?"}]