[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2964", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/design> <http://dbpedia.org/resource/Cable-stayed_bridge> . ?x <http://dbpedia.org/property/crosses> ?uri  . }", "question": "Sobre quais rios existe uma ponte estaiada?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "2672", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Cite algumas empresas sediadas no Texas?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/jurisdiction> <http://dbpedia.org/resource/Nazi_Germany>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/jurisdiction> <http://dbpedia.org/resource/Nazi_Germany> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/jurisdiction> <http://dbpedia.org/resource/Nazi_Germany>", "target_var": "?u_1"}], "id": "2778", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/jurisdiction> <http://dbpedia.org/resource/Nazi_Germany> . ?x <http://dbpedia.org/ontology/leader> ?uri  . }", "question": "Quem foram alguns chefes de governo na Alemanha nazista?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Banlung> <http://dbpedia.org/ontology/timeZone> ?u_0", "target_var": "?u_0"}], "id": "2948", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Banlung> <http://dbpedia.org/ontology/timeZone> ?uri } ", "question": "Nomeie o tiemzone de Banlung?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2817", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/doctoralStudents> <http://dbpedia.org/resource/Mary_Ainsworth> . ?x <http://dbpedia.org/property/doctoralStudents> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Nomeie todos os alunos de doutorado do cientista que tamb\u00e9m orientou Mary Ainsworth?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2758", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/billed> <http://dbpedia.org/resource/Norman,_Oklahoma> . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Wrestler>}", "question": "Onde morreu o lutador que foi faturado em Norman, Oklahoma?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/Shahid_Khan>", "target_var": "?u_0"}], "id": "1756", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/Shahid_Khan> } ", "question": "De quais times de futebol \u00e9 propriet\u00e1rio de Shahid Khan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "724", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/National_Capital_Region_Athletic_Association> . ?x <http://dbpedia.org/property/athletics> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Quais esportes existem nas universidades filiadas \u00e0 National Capital Region Athletic Association?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3957", "query": "ASK WHERE { <http://dbpedia.org/resource/Dean_Wurzberger> <http://dbpedia.org/property/managerclubs> <http://dbpedia.org/resource/Santa_Clara_University> }", "question": "Reitor Wurzberger administrava um clube na universidade de santa clara?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> .?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> .?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> .?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> .?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>", "target_var": "?u_0"}], "id": "1588", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> . ?uri <http://dbpedia.org/ontology/ingredient> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>}", "question": "Quantos pratos s\u00e3o feitos com um ingrediente pertencente a esp\u00e9cies de plantas com flores?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3347", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2014\u201315_Football_League_Championship> . ?uri <http://dbpedia.org/ontology/managerClub> ?x  . }", "question": "Quem s\u00e3o os dirigentes dos clubes participantes do Campeonato da Liga de Futebol 2014-2015?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3970", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/material> <http://dbpedia.org/resource/Wrought_iron> . ?x <http://dbpedia.org/ontology/river> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Pontes sobre as quais rios s\u00e3o feitos de Ferro Forjado?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4707", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Albert_Kwesi_Ocran> <http://dbpedia.org/property/allegiance> ?uri } ", "question": "Qual \u00e9 a lealdade de Albert Kwesi Ocran?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Niederkirchnerstra\u00dfe>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Niederkirchnerstra\u00dfe> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Niederkirchnerstra\u00dfe>", "target_var": "?u_1"}], "id": "43", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Niederkirchnerstra\u00dfe> . ?x <http://dbpedia.org/ontology/leader> ?uri  . }", "question": "Quantas pessoas dirigiram organiza\u00e7\u00f5es com sede em Niederkirchnerstrae?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Europe>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Europe> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>", "target_var": "?u_0"}], "id": "3001", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Europe>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>}", "question": "Quais s\u00e3o alguns mares dentro da europa?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "210", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Queer_as_Folk_(UK_TV_series)> <http://dbpedia.org/ontology/producer> ?x . ?x <http://dbpedia.org/property/notableworks> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quais s\u00e3o as obras not\u00e1veis da pessoa que produziu Queer as Folk?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Swimming_at_the_2008_Summer_Olympics_\u2013_Men's_400_metre_individual_medley> <http://dbpedia.org/ontology/bronzeMedalist> ?u_0", "target_var": "?u_0"}], "id": "677", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Swimming_at_the_2008_Summer_Olympics_\u2013_Men's_400_metre_individual_medley> <http://dbpedia.org/ontology/bronzeMedalist> ?uri } ", "question": "Quem foi o medalhista de bronze de nata\u00e7\u00e3o nos 400 metros medley individual dos Jogos Ol\u00edmpicos de Ver\u00e3o de 2008?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Incredible_Hulk_(1982_TV_series)> <http://dbpedia.org/ontology/narrator> <http://dbpedia.org/resource/Stan_Lee>", "target_var": "?u_-1"}], "id": "354", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Incredible_Hulk_(1982_TV_series)> <http://dbpedia.org/ontology/narrator> <http://dbpedia.org/resource/Stan_Lee> }", "question": "Stan Lee narrou o incr\u00edvel programa de TV Hulk?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "949", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Pioneer_Corporation> <http://dbpedia.org/property/country> ?uri  . }", "question": "Em quantos estados a empresa Pioneer opera?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}], "id": "2843", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri } ", "question": "Qual \u00e9 a equipe de estreia de Butch Metzger?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler>", "target_var": "?u_0"}], "id": "577", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } ", "question": "Cujo aluno de doutorado \u00e9 Etienne Bieler \\ xc9tienne_Bi \\ xe9ler"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}], "id": "3928", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Quais pa\u00edses usaram o Solidus como moeda?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "544", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Edsel> <http://dbpedia.org/property/parent> ?uri. <http://dbpedia.org/resource/1967_Mexican_Grand_Prix> <http://dbpedia.org/property/firstTeam> ?uri} ", "question": "Qual empresa-m\u00e3e da Edsel foi a primeira equipe do Grande Pr\u00eamio do M\u00e9xico de 1967?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}], "id": "367", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> . ?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> . }", "question": "Quem esteve nos conflitos de Fort Barrancas e Gadsden?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1612", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/assembly> <http://dbpedia.org/resource/Jefferson_North_Assembly> . ?x <http://dbpedia.org/property/related> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Cite alguns carros semelhantes aos que s\u00e3o montados na Jefferson North Assembly?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3550", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WRVU> <http://dbpedia.org/property/licensee> ?uri. <http://dbpedia.org/resource/Todd_J._Campbell> <http://dbpedia.org/ontology/almaMater> ?uri} ", "question": "Qual licenciado do WRVU tamb\u00e9m \u00e9 a alma mater do Todd J. Campbell?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Eddie_Anderson_(safety)> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Joe_Porter_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eddie_Anderson_(safety)> <http://dbpedia.org/ontology/team> ?u_0 .<http://dbpedia.org/resource/Joe_Porter_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_0"}], "id": "3716", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eddie_Anderson_(safety)> <http://dbpedia.org/ontology/team> ?uri. <http://dbpedia.org/resource/Joe_Porter_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?uri . }", "question": "Para qual time Joe Porter e Eddie Anderson jogaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3779", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Corringham_railway_station> <http://dbpedia.org/property/borough> ?uri. <http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?uri} ", "question": "Qual bairro da esta\u00e7\u00e3o ferrovi\u00e1ria de Corringham tamb\u00e9m \u00e9 a autoridade local da Escola de Ensino M\u00e9dio do Condado de Buckhurst Hill?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "135", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Conglomerate_(American_group)> <http://dbpedia.org/property/pastMembers> ?uri. <http://dbpedia.org/resource/Before_I_Let_You_Go> <http://dbpedia.org/ontology/musicalArtist> ?uri} ", "question": "Qual banda tinha os membros do The Conglomerate e fez &#39;Before I let you go&#39;?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4480", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> . ?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Ludwig_Von_Drake>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Diga o nome do personagem fict\u00edcio cuja esp\u00e9cie \u00e9 o pato americano Pekin e tem parentes chamados Ludwig Von Drake?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Carl_McCall> <http://dbpedia.org/ontology/governor> ?u_0", "target_var": "?u_0"}], "id": "1437", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carl_McCall> <http://dbpedia.org/ontology/governor> ?uri } ", "question": "Quem \u00e9 o governador de Carl McCall?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "47", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/governingBody> <http://dbpedia.org/resource/Maritime_Museum_of_San_Diego> . ?x <http://dbpedia.org/property/location> ?uri  . }", "question": "Onde posso encontrar coisas administradas pelo museu mar\u00edtimo de San Diego?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "734", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Liste os filmes dirigidos por Stanley Kubrick?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1534", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League> . ?x <http://dbpedia.org/property/draftTeam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Para qual time as pessoas foram convocadas, que est\u00e3o na National Hockey League?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2004", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Joseph_Clay_(Georgia)> <http://dbpedia.org/ontology/appointer> ?uri. <http://dbpedia.org/resource/Maryland_Jockey_Club> <http://dbpedia.org/property/keyPeople> ?uri} ", "question": "Qual pessoa-chave do clube de j\u00f3quei de maryland nomeou Joseph Clay?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_0 .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_0 .?u_0 <http://dbpedia.org/ontology/developer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/developer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_1 .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/developer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?u_1 .?u_1 <http://dbpedia.org/ontology/developer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}], "id": "3795", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Macintosh_Quadra_660AV> <http://dbpedia.org/ontology/operatingSystem> ?x . ?x <http://dbpedia.org/ontology/developer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quem desenvolveu o software para o sistema operacional do Macintosh Quadra 660AV?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Carlos_Emmons_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_0"}], "id": "2519", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carlos_Emmons_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?uri } ", "question": "De que times de futebol americano jogou Carlos Emmons?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Don_R._Berlin> <http://dbpedia.org/ontology/employer> ?u_0", "target_var": "?u_0"}], "id": "1972", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Don_R._Berlin> <http://dbpedia.org/ontology/employer> ?uri } ", "question": "Quem \u00e9 o empregador de Don R. Berlin?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "996", "query": "ASK WHERE { <http://dbpedia.org/resource/Peter_Crouch> <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Stoke_City_F.C.> }", "question": "Peter Crouch est\u00e1 atualmente no Stoke City FC?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "61", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Outlook.com> . ?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Microsoft_Visual_Studio>  . }", "question": "Quem fornece o servi\u00e7o do Outlook e tamb\u00e9m produtos como o Visual Studio?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2405", "query": "ASK WHERE { <http://dbpedia.org/resource/Mount_St._Peter_Church> <http://dbpedia.org/property/architecture> <http://dbpedia.org/resource/International_Style_(architecture)> }", "question": "A Igreja do Monte S\u00e3o Pedro \u00e9 feita no estilo arquitet\u00f4nico internacional?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "95", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Mating_Habits_of_the_Earthbound_Human> <http://dbpedia.org/property/starring> ?uri. <http://dbpedia.org/resource/Mams_Taylor> <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri . }", "question": "Que mulher agiu nos h\u00e1bitos de acasalamento dos humanos presos \u00e0 Terra e \u00e9 freq\u00fcentemente associada a Mams Taylor?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "478", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/guests> <http://dbpedia.org/resource/Brian_d'Arcy_James> . ?x <http://dbpedia.org/property/guests> ?uri }", "question": "Quantos outros convidados existem nos epis\u00f3dios de televis\u00e3o cujos convidados \u00e9 Brian d&#39;Arcy James?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4359", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/He's_a_Pirate> <http://dbpedia.org/property/writer> ?uri } ", "question": "Quem \u00e9 o escritor de Ele \u00e9 um pirata?"}]