[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/region> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/language> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/language> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Nebraska> <http://dbpedia.org/ontology/language> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/region> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/region> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/region> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Nebraska> <http://dbpedia.org/ontology/language> ?u_1", "target_var": "?u_0"}], "id": "422", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Nebraska> <http://dbpedia.org/ontology/language> ?x . ?x <http://dbpedia.org/property/region> ?uri  . }", "question": "Em quantos outros estados moram pessoas cujas l\u00ednguas s\u00e3o faladas em Nebraska?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Michael_Hahn> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}], "id": "90", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Hahn> <http://dbpedia.org/ontology/almaMater> ?uri } ", "question": "Qual \u00e9 a alma mater de Michael hahn?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2236", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jimmie_Lou_Fisher> <http://dbpedia.org/property/governor> ?uri } ", "question": "Liste os governadores de Jimmie Lou Fisher?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}], "id": "670", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> . ?uri <http://dbpedia.org/property/team> ?x  . }", "question": "Quantas pessoas j\u00e1 jogaram por um clube cujo treinador \u00e9 Fred Hoiberg?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Callisto_(moon)> <http://dbpedia.org/ontology/discoverer> ?u_0", "target_var": "?u_0"}], "id": "3040", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Callisto_(moon)> <http://dbpedia.org/ontology/discoverer> ?uri } ", "question": "Quem descobriu Callisto?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rishikesh> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}], "id": "26", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rishikesh> <http://dbpedia.org/ontology/leaderName> ?uri } ", "question": "qual pol\u00edtico est\u00e1 governando atualmente sobre Rishkiesh?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "429", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carmel_Winery> <http://dbpedia.org/property/locationCountry> ?uri } ", "question": "Onde fica a vin\u00edcola Carmel?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Little_Colorado_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Grand_Canyon>", "target_var": "?u_-1"}], "id": "683", "query": "ASK WHERE { <http://dbpedia.org/resource/Little_Colorado_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Grand_Canyon> }", "question": "O pequeno rio Colorado corre no Grand Canyon?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4463", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marine_Corps_Air_Station_Kaneohe_Bay> <http://dbpedia.org/property/architect> ?uri } ", "question": "Diga o nome do arquiteto da Base A\u00e9rea dos Fuzileiros Navais em Kaneohe Bay?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3945", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/system> <http://dbpedia.org/resource/Norfolk_Southern_Railway> . ?x <http://dbpedia.org/property/owner> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}", "question": "Quantas organiza\u00e7\u00f5es diferentes s\u00e3o propriet\u00e1rias das linhas ferrovi\u00e1rias que fazem parte da Norfolk Southern Railway?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2031", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Inyo_National_Forest> . ?uri <http://dbpedia.org/ontology/parentMountainPeak> <http://dbpedia.org/resource/Nevado_de_Toluca>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}", "question": "Qual montanha est\u00e1 localizada na Floresta Nacional de Inyo e tem um pico pai chamado Nevado de Toluca?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2232", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingmar_Bergman> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri . }", "question": "Quais pr\u00eamios foram dados a Ingmar Bergman e Charles LeMaire?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4120", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/William_Henry_Harrison_Tomb_State_Memorial> . ?uri <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual local de descanso do titular do cargo \u00e9 William Henry Harrison Tomb State Memorial e o governador chamado Charles Willing Byrd?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3235", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Khiladi_786> <http://dbpedia.org/property/nextAlbum> ?x . ?x <http://dbpedia.org/property/recorded> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Onde estava o filme depois que Khiladi 786 foi gravado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1029", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Dolley_Madison>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual estadista \u00e9 casado com Dolley Madison?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "4392", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Julian_Gingell>  . }", "question": "Quantas m\u00fasicas tem\u00e1ticas foram compostas por Julian Gingell?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/L\u00fc_Buwei> <http://dbpedia.org/ontology/monarch> ?u_0", "target_var": "?u_0"}], "id": "3800", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/L\u00fc_Buwei> <http://dbpedia.org/ontology/monarch> ?uri } ", "question": "Diga o nome do monarca de L Buwei?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4310", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records> . ?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Africa_'70_(band)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Diga o nome do m\u00fasico que recebeu o selo da Celluloid Records e foi associado ao Africa&#39;70?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Wizard_rock> <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> <http://dbpedia.org/resource/Wizard_rock>", "target_var": "?u_0"}], "id": "2509", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wizard_rock> <http://dbpedia.org/ontology/stylisticOrigin> ?uri } ", "question": "Qual \u00e9 a origem estil\u00edstica do rock Wizard?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2292", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/fields> <http://dbpedia.org/resource/Sanskrit> . ?x <http://dbpedia.org/property/fields> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Liste os campos dos cientistas com o s\u00e2nscrito como um dos de interesse?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1323", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jerrell_Jackson> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Andrew_Economos> <http://dbpedia.org/ontology/formerTeam> ?uri} ", "question": "De todos os times que Andrew Economos jogou, em qual deles Jerrel Jackson jogou sua primeira partida?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4647", "query": "ASK WHERE { <http://dbpedia.org/resource/Mona_Lisa> <http://dbpedia.org/property/museum> <http://dbpedia.org/resource/Louvre> }", "question": "A Mona Lisa est\u00e1 no museu do Louvre?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "315", "query": "ASK WHERE { <http://dbpedia.org/resource/A_Foreign_Policy_of_Freedom> <http://dbpedia.org/property/coverArtist> <http://dbpedia.org/resource/John_Trumbull> }", "question": "Uma pol\u00edtica externa de liberdade foi coberta por John Trumbull?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1242", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Juelz_Santana> . ?x <http://dbpedia.org/ontology/bandMember> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Listar os demais integrantes da banda da qual Juelz Santana faz parte?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services>", "target_var": "?u_1"}], "id": "2450", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", "question": "Conte-me tudo o que \u00e9 feito pela empresa que tamb\u00e9m oferece manufatura eletr\u00f4nica."}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1578", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Hirokazu_Tanaka>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Quantos jogos foram compostos por Hirokazu Tanaka?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4625", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/UFC_140> <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem s\u00e3o os locat\u00e1rios do est\u00e1dio onde fica o UFC 140?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3116", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Fox_and_the_Cat> <http://dbpedia.org/property/species> ?uri. <http://dbpedia.org/resource/Seneca_Academy_and_Circle_School> <http://dbpedia.org/property/mascot> ?uri} ", "question": "Qual kmascot od seneca Academy tamb\u00e9m \u00e9 a esp\u00e9cie da Raposa e do Gato?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "69", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Washington,_D.C.> . ?uri <http://dbpedia.org/property/affiliations> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Diga o nome da universidade cujo local de funda\u00e7\u00e3o da afilia\u00e7\u00e3o \u00e9 Washington, DC?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "859", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gods_of_Egypt_(film)> <http://dbpedia.org/ontology/starring> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais pr\u00eamios os membros do elenco de Gods of Egypt ganharam?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2753", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Ann_Arbor,_Michigan> . ?x <http://dbpedia.org/ontology/residence> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Onde posso encontrar pessoas cuja cidade natal \u00e9 Ann Arbor em Michigan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1632", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Athens> . ?x <http://dbpedia.org/ontology/formerTeam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Qual \u00e9 a ex-equipe de jogadores de basquete nascidos em Atenas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1650", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Club_One_Air> <http://dbpedia.org/ontology/hubAirport> ?x . ?x <http://dbpedia.org/property/cityServed> ?uri  . }", "question": "Em que cidade fica o aeroporto central do Club One Air?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3860", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Gustavo_Rojas_Pinilla> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "Onde estudaram os familiares de Gustavo Rojas Pinilla?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/placeOfBirth> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/placeOfBirth> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}], "id": "3106", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }", "question": "Por quantas coisas os americanos s\u00e3o famosos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1074", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/McDonnell_Douglas> <http://dbpedia.org/property/successor> ?uri } ", "question": "Quem \u00e9 o sucessor de McDonnell Douglas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Lucifer's_Hammer> <http://dbpedia.org/ontology/publisher> ?u_0", "target_var": "?u_0"}], "id": "4001", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lucifer's_Hammer> <http://dbpedia.org/ontology/publisher> ?uri } ", "question": "Qual \u00e9 o editor do Martelo de L\u00facifer?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2605", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rishang_Keishing> <http://dbpedia.org/property/party> ?uri. <http://dbpedia.org/resource/Purnima_Banerjee> <http://dbpedia.org/ontology/party> ?uri} ", "question": "Purnima Banerjee e Rishang Keishing s\u00e3o pol\u00edticos de que partido?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3630", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/MapleMusic_Recordings> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "O selo do compositor de m\u00fasica tem\u00e1tica de qual programa \u00e9 MapleMusic Recordings?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2121", "query": "ASK WHERE { <http://dbpedia.org/resource/Neil_Armstrong> <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Apollo_11> }", "question": "A Apollo 11 foi uma miss\u00e3o de Niel Armstrong?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "811", "query": "ASK WHERE { <http://dbpedia.org/resource/Charat_District> <http://dbpedia.org/property/settlementType> <http://dbpedia.org/resource/Districts_of_Peru> }", "question": "O distrito de charat \u00e9 um distrito no Peru?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "387", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Fusajiro_Yamauchi> . ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_Network>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Que empresa fundada por Fusajiro Yamauchi presta servi\u00e7os como Nintendo Network?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2882", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/guests> <http://dbpedia.org/resource/Richard_Gant> . ?x <http://dbpedia.org/ontology/series> ?uri  . }", "question": "Richard Gant fez uma apari\u00e7\u00e3o especial em qual s\u00e9rie?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Plant> <http://dbpedia.org/ontology/kingdom> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/division> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/division> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant> .?u_1 <http://dbpedia.org/ontology/division> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant> .?u_0 <http://dbpedia.org/ontology/division> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Plant> <http://dbpedia.org/ontology/kingdom> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant> .?u_1 <http://dbpedia.org/ontology/division> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant> .?u_0 <http://dbpedia.org/ontology/division> ?u_1", "target_var": "?u_0"}], "id": "1175", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Plant> . ?uri <http://dbpedia.org/ontology/division> ?x  . }", "question": "Quantas coisas pertencem a uma divis\u00e3o do reino vegetal?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3197", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Joel_Goodman> . ?x <http://dbpedia.org/property/showName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "O que \u00e9 aquele show cujo tema foi composto por Joel Goodman?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2623", "query": "ASK WHERE { <http://dbpedia.org/resource/College_Sainte-Marie> <http://dbpedia.org/property/county> <http://dbpedia.org/resource/Mauritius> }", "question": "O College Sainte Marie fica nas Maur\u00edcias?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Karen_Grigorian> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0 .<http://dbpedia.org/resource/Karen_Grigorian> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}], "id": "1351", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?uri. <http://dbpedia.org/resource/Karen_Grigorian> <http://dbpedia.org/ontology/occupation> ?uri} ", "question": "Qual \u00e9 o campo de Jon Speelman e a ocupa\u00e7\u00e3o de Karen Grigorian?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "410", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/History_of_Trier>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Quais s\u00e3o os pa\u00edses para os quais a History of Trier dirige?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4212", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Graham_Holdings_Company> . ?uri <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Iowa>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Liste o uni. ter afilia\u00e7\u00e3o com a Graham Holding Company e um campus em Iowa?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Antonio_Giannini> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}], "id": "109", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Antonio_Giannini> <http://dbpedia.org/ontology/birthPlace> ?uri } ", "question": "Onde nasceu Antonio Giannini?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Larry_J._Franco>", "target_var": "?u_0"}], "id": "4995", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Larry_J._Franco> } ", "question": "Quais filmes foram produzidos pela produtora de Larry J. Franco?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_0 .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_0 .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}], "id": "2809", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hallopus> <http://dbpedia.org/ontology/binomialAuthority> ?x . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Qual \u00e9 o local da morte do cientista que \u00e9 a autoridade conhecida de Hallopus?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/CN_Atl\u00e8tic-Barceloneta> <http://dbpedia.org/ontology/stadium> <http://dbpedia.org/resource/Barcelona>", "target_var": "?u_-1"}], "id": "2594", "query": "ASK WHERE { <http://dbpedia.org/resource/CN_Atl\u00e8tic-Barceloneta> <http://dbpedia.org/ontology/stadium> <http://dbpedia.org/resource/Barcelona> }", "question": "O CN Atletic-Barceloneta tem um est\u00e1dio em Barcelona?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1235", "query": "ASK WHERE { <http://dbpedia.org/resource/Frank_R._Lillie_House> <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/Chicago> }", "question": "O Frank R Lillie House tem a arquitetura de Chicago?"}]