[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/CFRX> <http://dbpedia.org/ontology/broadcastArea> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/North_American_Poker_Tour> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/CFRX> <http://dbpedia.org/ontology/broadcastArea> ?u_0 .<http://dbpedia.org/resource/North_American_Poker_Tour> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}], "id": "4412", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/CFRX> <http://dbpedia.org/ontology/broadcastArea> ?uri. <http://dbpedia.org/resource/North_American_Poker_Tour> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Em qual \u00e1rea de transmiss\u00e3o do CFRX \u00e9 o pa\u00eds do North America Poker Tour?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://dbpedia.org/property/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_0 <http://dbpedia.org/property/team> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://dbpedia.org/property/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> .?u_1 <http://dbpedia.org/property/team> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_1"}], "id": "1459", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Fred_Hoiberg> . ?uri <http://dbpedia.org/property/team> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Diga o nome de alguns jogadores de basquete cuja equipe \u00e9 treinada por Fred Hoiberg?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3257", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/carries> <http://dbpedia.org/resource/Motor_vehicle> . ?x <http://dbpedia.org/ontology/maintainedBy> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "D\u00ea-me alguns administradores de pontes sobre os quais os carros podem passar?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Colonel_(United_States)>", "target_var": "?u_0"}], "id": "2803", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Colonel_(United_States)>  . }", "question": "Quem s\u00e3o alguns coron\u00e9is americanos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2706", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Meg_McGuffin> <http://dbpedia.org/ontology/education> ?uri } ", "question": "Onde Meg McGuffin se formou?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4789", "query": "ASK WHERE { <http://dbpedia.org/resource/Citizen_Kane> <http://dbpedia.org/property/cinematography> <http://dbpedia.org/resource/Gregg_Toland> }", "question": "Cidad\u00e3o Kane foi cinematografado por Gregg Toland?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1587", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", "question": "Conte as diferentes alma maters de pessoas empregadas pela CNN"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3659", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Latania_verschaffeltii> <http://dbpedia.org/property/binomialAuthority> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quais s\u00e3o os pr\u00eamios ganhos por uma autoridade da Latania verschaffeltii?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Steve_Romeo> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}], "id": "1731", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steve_Romeo> <http://dbpedia.org/ontology/deathPlace> ?uri } ", "question": "Onde Steve Romeo morreu?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>", "target_var": "?u_0"}], "id": "4764", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>  . }", "question": "Quantas universidades existem na National Collegiate Athletic Association?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4224", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/designer> <http://dbpedia.org/resource/Lars_Bak_(computer_programmer)> . ?x <http://dbpedia.org/property/developer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Language>}", "question": "Qual empresa desenvolveu a linguagem desenhada por Lars Bak?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3681", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Peter_Cosgrove> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "Qual \u00e9 o mascote da unidade do ex\u00e9rcito cujo comandante \u00e9 Peter Cosgrove?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1791", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._S._M._Hooper> <http://dbpedia.org/ontology/citizenship> ?uri. <http://dbpedia.org/resource/Robert_Valentine_(composer)> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Qual \u00e9 a cidadania comum entre JSM Hopoer e Robert Valentine?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2355", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lemberger_LD20b> <http://dbpedia.org/property/nationalOrigin> ?uri. <http://dbpedia.org/resource/Start_+_Flug_H-101> <http://dbpedia.org/property/nationalOrigin> ?uri . }", "question": "Em que pa\u00eds nasceram as aeronaves Lemberger LD20b e Start + Flug H101?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1940", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Seguidores de quais religi\u00f5es s\u00e3o membros de Janata Dal?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jojo_Chintoh> <http://dbpedia.org/ontology/stateOfOrigin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jojo_Chintoh> <http://dbpedia.org/ontology/stateOfOrigin> ?u_0 .<http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}], "id": "702", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jojo_Chintoh> <http://dbpedia.org/ontology/stateOfOrigin> ?uri. <http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?uri} ", "question": "Onde est\u00e3o localizadas as INKAS, que tamb\u00e9m \u00e9 o estado de origem de Jojo Chintoh?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2442", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Christopher_S._Stewart> <http://dbpedia.org/property/employer> ?uri } ", "question": "Qual \u00e9 o local de trabalho de Christopher S. Stewart?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4375", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Louisiana> . ?x <http://dbpedia.org/property/knownFor> ?uri  . }", "question": "Quais s\u00e3o algumas das coisas pelas quais as pessoas nascidas na Louisiana s\u00e3o famosas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2016_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/ground> ?u_0", "target_var": "?u_0"}], "id": "496", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2016_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/ground> ?uri } ", "question": "Onde aconteceu a temporada de 16 do Fort Lauderdale Strikers?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hohenau,_Paraguay> <http://dbpedia.org/ontology/founder> ?u_0", "target_var": "?u_0"}], "id": "464", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hohenau,_Paraguay> <http://dbpedia.org/ontology/founder> ?uri } ", "question": "Quem \u00e9 o fundador de Hohenau, no Paraguai?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/9_to_5_(musical)> <http://dbpedia.org/ontology/musicBy> ?u_0", "target_var": "?u_0"}], "id": "4071", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/9_to_5_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri } ", "question": "Quem deu a pontua\u00e7\u00e3o musical de 9 a 5 (musical)?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_0 .?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_0 .?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_1 .?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?u_1 .?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_0"}], "id": "4333", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wrongfully_Accused> <http://dbpedia.org/ontology/starring> ?x . ?x <http://dbpedia.org/ontology/spouse> ?uri  . }", "question": "Quem s\u00e3o as esposas dos atores de Wrongfully Accused?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "172", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Kazuo_Hirai> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", "question": "Contar tudo o que foi constru\u00eddo por uma empresa cujo l\u00edder \u00e9 Kazuo Hirai?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4943", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wizards_vs_Aliens> <http://dbpedia.org/ontology/producer> ?uri. <http://dbpedia.org/resource/Russell_T_Davies> <http://dbpedia.org/ontology/notableWork> ?uri} ", "question": "Qual produtor de Wizards and the aliens tamb\u00e9m \u00e9 o trabalho not\u00e1vel de russell T Davies?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4796", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/England_national_under-21_football_team> <http://dbpedia.org/property/coach> ?uri. <http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season> <http://dbpedia.org/property/name> ?uri} ", "question": "Qual treinador da sele\u00e7\u00e3o inglesa de futebol sub-21 tamb\u00e9m \u00e9 o treinador da temporada do Aston Villa FC?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2540", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/pastMembers> <http://dbpedia.org/resource/Dave_Hollister> } ", "question": "Para qual banda Dave Hollister se apresentou no passado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3262", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Anthrax> . ?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Royal_Society>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Diga o nome do cientista que \u00e9 conhecido por inventar o antraz e era membro da Royal Society?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4680", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/Brian_Graden> . ?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Primus_(band)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual show desenvolvido por Brain Graden tem m\u00fasica tema composta pela Primus?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2260", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/material> <http://dbpedia.org/resource/Concrete> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Qual construtor fez pontes de concreto?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rostov-Glavny> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_0"}], "id": "2112", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rostov-Glavny> <http://dbpedia.org/ontology/servingRailwayLine> ?uri } ", "question": "Qual \u00e9 a linha ferrovi\u00e1ria que serve Rostov-Glavny?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}], "id": "900", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/product> ?uri  . }", "question": "Quantos produtos diferentes existem das empresas localizadas nos EUA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1446", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/inflow> <http://dbpedia.org/resource/Shannon_Cave> . ?uri <http://dbpedia.org/ontology/source> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "O que \u00e9 aquele rio cuja nascente obt\u00e9m \u00e1gua da caverna Shannon?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3573", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/area> <http://dbpedia.org/resource/Nashville,_Tennessee> . ?x <http://dbpedia.org/property/licensee> ?uri  . }", "question": "Quantas licenciadas existem nas esta\u00e7\u00f5es de r\u00e1dio cuja \u00e1rea \u00e9 Nashville, Tennessee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "741", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Albert_Kwesi_Ocran> <http://dbpedia.org/property/allegiance> ?uri. <http://dbpedia.org/resource/Jojo_Chintoh> <http://dbpedia.org/ontology/stateOfOrigin> ?uri} ", "question": "Qual \u00e9 a lealdade do Albert Kwesi Ocran e o estado de origem do Jojo Chintoh?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2293", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2008\u201309_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/property/headcoach> ?uri } ", "question": "Quem \u00e9 o chefe da sele\u00e7\u00e3o masculina de basquete 2008-09 do Marquette Golden Eagles?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Jared_Bernstein> <http://dbpedia.org/ontology/vicePresident> ?u_0", "target_var": "?u_0"}], "id": "2452", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jared_Bernstein> <http://dbpedia.org/ontology/vicePresident> ?uri } ", "question": "Quem \u00e9 o vice-presidente da Jared Bernstein?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Bertalan_Szemere> <http://dbpedia.org/ontology/monarch> ?u_0", "target_var": "?u_0"}], "id": "4078", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bertalan_Szemere> <http://dbpedia.org/ontology/monarch> ?uri } ", "question": "Quem \u00e9 o monarca de Bertalan Szemere?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1206", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Splash_(film)> <http://dbpedia.org/property/starring> ?uri. <http://dbpedia.org/resource/Rita_Wilson> <http://dbpedia.org/property/spouse> ?uri . }", "question": "Qual ator estrelou em Splash e \u00e9 casado com Rita Wilson?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "509", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lauren_Briggs> <http://dbpedia.org/property/placeOfBirth> ?uri } ", "question": "Qual \u00e9 o local de nascimento de Lauren Briggs?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/team> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/team> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}], "id": "2802", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Hockey_League> . ?x <http://dbpedia.org/ontology/team> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Jogadores de quantas equipes participaram da National Hockey League?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3313", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/European_Americans> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", "question": "Quais s\u00e3o algumas das causas de morte de europeus americanos?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1549", "query": "ASK WHERE { <http://dbpedia.org/resource/Iceman_(comics)> <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Stan_Lee> }", "question": "Stan Lee criou os quadrinhos do Iceman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4563", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Omar_D._Conger> <http://dbpedia.org/property/order> ?uri. <http://dbpedia.org/resource/Robert_Sarvis> <http://dbpedia.org/ontology/nominee> ?uri} ", "question": "Qual \u00e9 a ordem de Omar D. Conger onde Robert Sarvis tamb\u00e9m foi o indicado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2202", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/Mike_Babcock>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HockeyTeam>}", "question": "Qual time de h\u00f3quei \u00e9 treinado por Mike Babcock?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2566", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Khalid_bin_Sultan> <http://dbpedia.org/property/battles> ?uri. <http://dbpedia.org/resource/Steve_Buyer> <http://dbpedia.org/ontology/battle> ?uri} ", "question": "Qual batalha de Khalid bin Sultan tamb\u00e9m foi o conflito de Steve Buyer?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Robert_Wise>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Robert_Wise> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "3892", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Robert_Wise>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cujo editor \u00e9 Robert Wise?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2044", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Open_House_(American_Horror_Story)> <http://dbpedia.org/property/music> ?uri } ", "question": "Liste a m\u00fasica do Open House (American Horror Story)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4872", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Championship_Snooker> <http://dbpedia.org/property/narrated> ?x . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . }", "question": "Onde morreram os narradores da sinuca do campeonato?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3738", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Nick_Williams> . ?x <http://dbpedia.org/ontology/relative> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RugbyPlayer>}", "question": "Quais s\u00e3o os parentes do jogador de r\u00fagbi, um de cujos parentes \u00e9 Nick Williams?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Bengali_in_Platforms> <http://dbpedia.org/ontology/artist> ?u_0", "target_var": "?u_0"}], "id": "421", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bengali_in_Platforms> <http://dbpedia.org/ontology/artist> ?uri } ", "question": "Quem \u00e9 o int\u00e9rprete de Bengali em Plataformas?"}]