[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/sisterNames> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/sisterNames> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/sisterNames> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_News_(TV_channel)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/sisterNames> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/sisterNames> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/sisterNames> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "1327", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/BBC_News_(TV_channel)> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos programas pertencem \u00e0s emissoras, uma de cuja esta\u00e7\u00e3o irm\u00e3 \u00e9 a BBC News?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1677", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ptolemy_XII_Auletes> . ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Ptolemy_XIV_of_Egypt>  . }", "question": "Qual das esposas de Ptolomeu XIV teve uma m\u00e3e chamada Ptolomeu XII auletes?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1999", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Galatasaray_Handball_Team> <http://dbpedia.org/property/mascot> ?uri } ", "question": "Qual \u00e9 o mascote da Sele\u00e7\u00e3o Galatasaray de Andebol?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_0 <http://dbpedia.org/ontology/nationality> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>", "target_var": "?u_1"}], "id": "1987", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Atl\u00e9tico_Petr\u00f3leos_de_Luanda_(handball)> . ?x <http://dbpedia.org/ontology/nationality> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "De que pa\u00eds s\u00e3o os jogadores do Atl\u00e9tico Petroleos de Luanda?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "344", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/GANEFO> <http://dbpedia.org/property/hostCity> ?uri } ", "question": "Onde o Ganefo estava hospedado?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Josep_Maria_Bartomeu>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/youthclubs> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Josep_Maria_Bartomeu> .?u_1 <http://dbpedia.org/property/youthclubs> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Josep_Maria_Bartomeu>", "target_var": "?u_1"}], "id": "986", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Josep_Maria_Bartomeu> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Contar todos os que estiveram em um clube juvenil comandado por Josep Maria Bartomeu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4544", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Edward_Joseph_Schwartz> <http://dbpedia.org/property/branch> ?uri. <http://dbpedia.org/resource/John_Tower> <http://dbpedia.org/ontology/militaryBranch> ?uri} ", "question": "Qual \u00e9 o ramo militar comum de Edward Joseph Schwartz e John Tower?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3807", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Christopher_Franke> . ?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/TNT_(TV_channel)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual show da TNT tem Christopher Franke como artista?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0 .<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0 .?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0 .?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0 .<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0 .?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_1 .<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0 .<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_1 .?u_0 <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_1 .?u_0 <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}], "id": "4523", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?uri. <http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?uri . }", "question": "O que seria uma fronteira comum entre a Sib\u00e9ria e o planalto de Shimsa?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4002", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Information:_A_History,_a_Theory,_a_Flood> <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Isaac_Newton> }", "question": "As informa\u00e7\u00f5es: uma hist\u00f3ria, uma teoria, um dil\u00favio \u00e9 uma obra de Isaac Newton?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3961", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Graham_Holdings_Company> . ?uri <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Indiana>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Nomeie a universidade com afilia\u00e7\u00f5es como Graham Holdings Company e campus em Indiana?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>", "target_var": "?u_1"}], "id": "2358", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/C.D._Primeiro_de_Agosto_(basketball)> <http://dbpedia.org/ontology/league> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>}", "question": "Em que pa\u00eds se realiza o campeonato onde o CD Primeiro de Agosto joga?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1198", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nebraska> <http://dbpedia.org/ontology/language> ?x . ?x <http://dbpedia.org/property/region> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EthnicGroup>}", "question": "Onde est\u00e3o localizados os grupos \u00e9tnicos que falam Nebraskan?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_0 .<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_0 .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_0 .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_0 .<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_0 .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_1 .<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_1 .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?u_0 .<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?u_1 .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}], "id": "85", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/ontology/battle> ?uri. <http://dbpedia.org/resource/Lee_Leffingwell> <http://dbpedia.org/ontology/battle> ?uri . }", "question": "Em qual guerra Roh Tae Woo e Lee Leffingwell lutaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1518", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Edinburgh> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", "question": "Por quais motivos os que nasceram em Edimburgo morreram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "516", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mac_OS_9> <http://dbpedia.org/ontology/developer> ?uri. <http://dbpedia.org/resource/Tiny_Tower> <http://dbpedia.org/property/distributor> ?uri . }", "question": "Qual empresa desenvolveu o Mac OS 9 e tamb\u00e9m trouxe o Tiny Tower para o mercado?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_0 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_1 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?u_1 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}], "id": "1381", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Plymouth_Savoy> <http://dbpedia.org/ontology/assembly> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }", "question": "Qual \u00e9 a maior cidade do pa\u00eds que possui uma assembleia de Plymouth Savoy?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2716", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Clara_Ng> <http://dbpedia.org/ontology/ethnicity> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EthnicGroup>}", "question": "Qual \u00e9 a religi\u00e3o da etnia a que pertence Clara Ng?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3084", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vanderbilt_University_Medical_Center> <http://dbpedia.org/property/affiliation> ?uri } ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o do Vanderbilt University Medical Center?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University>", "target_var": "?u_-1"}], "id": "128", "query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }", "question": "Steve Sampson administrou um clube da Universidade de Santa Clara"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3623", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/capital> <http://dbpedia.org/resource/Boston> . ?uri <http://dbpedia.org/ontology/location> ?x  . }", "question": "O que foi feito no estado cuja capital \u00e9 Boston?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell> .?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell> .?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "4970", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell> . ?uri <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Qual o nome do conflito militar cujo comandante foi Colin Powell e ocorreu em Israel?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "891", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Judge_Advocate_General's_Corps> . ?x <http://dbpedia.org/property/residence> ?uri  . }", "question": "Onde mora o corpo geral do advogado de advogados?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2793", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/NCAA_Division_I_Football_Bowl_Subdivision>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Listar as universidades com subdivis\u00e3o do futebol da NCAA Division I Football Bowl?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4238", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Costa_Rica_women's_national_football_team> <http://dbpedia.org/ontology/stadium> ?x . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem \u00e9 o construtor do est\u00e1dio da sele\u00e7\u00e3o costarriquenha de futebol feminino?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Cheryl_Tiegs> <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_0"}], "id": "307", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cheryl_Tiegs> <http://dbpedia.org/ontology/residence> ?uri } ", "question": "Qual cidade \u00e9 a resid\u00eancia de Cheryl Teigs?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1661", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/coach> <http://dbpedia.org/resource/Kurt_Rambis> } ", "question": "O t\u00e9cnico de qual time de basquete \u00e9 Kurt Rambis?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2431", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Quest_Software> <http://dbpedia.org/property/successor> ?uri } ", "question": "Quem \u00e9 o sucessor do Quest Software?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Caterpillar_797> <http://dbpedia.org/ontology/assembly> ?u_0", "target_var": "?u_0"}], "id": "1317", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Caterpillar_797> <http://dbpedia.org/ontology/assembly> ?uri } ", "question": "Onde est\u00e1 a montagem do Caterpillar 797?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4303", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Everett_Dirksen> <http://dbpedia.org/property/deputy> ?x . ?x <http://dbpedia.org/ontology/residence> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Senator>}", "question": "Qual \u00e9 a resid\u00eancia oficial do senador que \u00e9 deputado de Everett Dirksen?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2542", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/April_Stewart> . ?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Primus_(band)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o cuja voz \u00e9 dada por April Stewart e o compositor da m\u00fasica tema \u00e9 Primus (banda)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1246", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jonas_Gahr_St\u00f8re> <http://dbpedia.org/property/constituency> ?uri } ", "question": "Qual \u00e9 o eleitorado de Jonas Gahr Stre?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Los_Angeles_Angels_of_Anaheim>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Los_Angeles_Angels_of_Anaheim> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_0"}], "id": "1208", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Los_Angeles_Angels_of_Anaheim>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}", "question": "Quais jogadores representaram o Los Angeles Angels of Anaheim?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "216", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goran_\u010cengi\u0107> <http://dbpedia.org/property/deathPlace> ?uri } ", "question": "Onde Goran Cengic morreu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3062", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harry_Parker_(baseball)> <http://dbpedia.org/ontology/formerTeam> ?uri. <http://dbpedia.org/resource/Carl_Sitton> <http://dbpedia.org/property/debutteam> ?uri} ", "question": "Qual ex-time do Harry Parker (beisebol) \u00e9 o time de estreia do Carl Sitton?"}]