[{"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Henri,_Duke_of_Rohan> <http://dbpedia.org/ontology/placeOfBurial> ?u_0", "target_var": "?u_0"}], "id": "3012", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Henri,_Duke_of_Rohan> <http://dbpedia.org/ontology/placeOfBurial> ?uri } ", "question": "Onde estava Henri, duque de Rohan, sepultado?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "413", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cujo diretor de fotografia \u00e9 Gregg Toland?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/highschool> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_1 <http://dbpedia.org/property/highschool> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/highschool> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_1 <http://dbpedia.org/property/highschool> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/highschool> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_0 <http://dbpedia.org/property/highschool> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/highschool> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> .?u_0 <http://dbpedia.org/property/highschool> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>", "target_var": "?u_1"}], "id": "4284", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Penn_State_Nittany_Lions_football> . ?x <http://dbpedia.org/property/highschool> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>}", "question": "Em quantas escolas diferentes as pessoas que estudaram futebol americano no Penn State Nittany Lions estudaram?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Balanidae> <http://dbpedia.org/ontology/family> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/binomialAuthority> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Balanidae>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Balanidae> .?u_0 <http://dbpedia.org/ontology/binomialAuthority> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Balanidae> <http://dbpedia.org/ontology/family> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Balanidae>", "target_var": "?u_1"}], "id": "1658", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Balanidae> . ?x <http://dbpedia.org/ontology/binomialAuthority> ?uri  . }", "question": "Quantas pessoas diferentes t\u00eam autoridade sobre os membros da fam\u00edlia Balanidae?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "801", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/allegiance> <http://dbpedia.org/resource/Union_(American_Civil_War)> . ?x <http://dbpedia.org/property/office> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quais cargos foram ocupados pelos pol\u00edticos que mantiveram sua fidelidade \u00e0 uni\u00e3o da guerra civil americana?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/highschool> <http://dbpedia.org/resource/Ringgold_High_School_(Pennsylvania)>", "target_var": "?u_0"}], "id": "1288", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/highschool> <http://dbpedia.org/resource/Ringgold_High_School_(Pennsylvania)> } ", "question": "Quem \u00e9 o jogador de futebol americano cujo col\u00e9gio \u00e9 Ringgold High School (Pensilv\u00e2nia)?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Afghanistan>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Afghanistan> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1 .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Afghanistan>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Afghanistan> .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_0"}], "id": "2182", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Afghanistan> . ?x <http://dbpedia.org/ontology/battle> ?uri }", "question": "Contar o n\u00famero total de pessoas em conflito que fizeram parte do conflito no afeganist\u00e3o?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "2588", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Kendall_Jenner> <http://dbpedia.org/property/relatives> ?uri  . }", "question": "Kendall Jenner tem quantos parentes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2615", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ren\u00e9_Romano> <http://dbpedia.org/property/citizenship> ?uri. <http://dbpedia.org/resource/Tahual> <http://dbpedia.org/property/location> ?uri} ", "question": "Onde fica Tahual, que tamb\u00e9m \u00e9 o pa\u00eds de Ren Romano?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2318", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_McGuinness_(motorcycle_racer)> <http://dbpedia.org/property/currentTeam> ?uri } ", "question": "Qual \u00e9 a atual equipe de John McGuinness (motociclista)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "256", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", "question": "De onde normalmente os funcion\u00e1rios da CNN se formam?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}], "id": "4541", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?uri. <http://dbpedia.org/resource/Ujjain_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?uri . }", "question": "Diga o nome da linha de servi\u00e7o comum da esta\u00e7\u00e3o ferrovi\u00e1ria Daund Junction e da esta\u00e7\u00e3o ferrovi\u00e1ria Ujjain Junction?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1151", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/First_Church_of_Christ,_Scientist_(Pittsburgh)> <http://dbpedia.org/property/locationTown> ?uri } ", "question": "Qual \u00e9 a localiza\u00e7\u00e3o da cidade da Primeira Igreja de Cristo, Cientista (Pittsburgh)?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Platte_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Colorado>", "target_var": "?u_-1"}], "id": "4144", "query": "ASK WHERE { <http://dbpedia.org/resource/Platte_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Colorado> }", "question": "O rio platte tem origem no Colorado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2908", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Henry_Bourchier,_1st_Earl_of_Essex> . ?x <http://dbpedia.org/property/placeOfBurial> ?uri  . }", "question": "Onde est\u00e1 o c\u00f4njuge de Henry Bourchier of Essex?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1702", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/USS_Camp_(DE-251)> <http://dbpedia.org/property/shipBuilder> ?uri. <http://dbpedia.org/resource/USS_Sturtevant_(DE-239)> <http://dbpedia.org/property/shipBuilder> ?uri . }", "question": "Qual construtor de navios construiu o USS Camp and Sturtevant?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/network> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/property/network> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/network> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/property/network> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/network> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/property/network> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/network> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/property/network> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/network> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/property/network> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/property/network> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/network> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "1881", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Que programas est\u00e3o nas redes que s\u00e3o dos Estados Unidos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1315", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Northanger_Abbey> <http://dbpedia.org/property/author> ?uri. <http://dbpedia.org/resource/Susanna_Clarke> <http://dbpedia.org/property/influences> ?uri . }", "question": "Qual autor inspirou Susanna Clarke e escreveu a Abadia de Northanger?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2269", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd> . ?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/North_Bend,_Ohio>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Nomeie o titular do cargo cujo governador \u00e9 Charles Willing Byrd e tem local de descanso como North Bend, Ohio?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2465", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_\u2013_Bataan> <http://dbpedia.org/ontology/sport> ?uri. <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?uri . }", "question": "Quais esportes s\u00e3o praticados na Polytech uni de Bataan e Taguig?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3855", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Cinema_International_Corporation> . ?uri <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Julian_Doyle_(filmmaker)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Diga o nome dos filmes distribu\u00eddos pela Cinema International Corporation e editados por Hulian Doyle?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1350", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Raymond_Conner> . ?uri <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Dennis_Muilenburg> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a empresa que tem Raymond Conner e Dennis Muilenburg como pessoas-chave?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3296", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Harry_Nilsson> . ?x <http://dbpedia.org/property/narrated> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Quem narrou os \u00e1lbuns em que Harry Nilsson se apresentou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "112", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rouen_Business_School> <http://dbpedia.org/property/province> ?uri } ", "question": "Qual \u00e9 a prov\u00edncia de Rouen Business School?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> .?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>", "target_var": "?u_1"}], "id": "3133", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Miami> . ?x <http://dbpedia.org/property/writer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>}", "question": "Liste alguns compositores cujo trabalho foi gravado em Miami?"}, {"answer": "-incorrect", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/KOMC-FM> <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/KOMC_(AM)>", "target_var": "?u_-1"}], "id": "263", "query": "ASK WHERE { <http://dbpedia.org/resource/KOMC_(AM)> <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/KOMC-FM> }", "question": "KOMC-FM \u00e9 a esta\u00e7\u00e3o irm\u00e3 de KOMC (AM)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1393", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/S._H._Kapadia> <http://dbpedia.org/property/religion> ?uri } ", "question": "Qual \u00e9 a denomina\u00e7\u00e3o de SH Kapadia?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/managerclubs> <http://dbpedia.org/resource/England_national_under-20_football_team>", "target_var": "?u_0"}], "id": "1878", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/managerclubs> <http://dbpedia.org/resource/England_national_under-20_football_team> } ", "question": "quem s\u00e3o os dirigentes da sele\u00e7\u00e3o nacional de futebol com menos de 20 anos?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Bangkok>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Bangkok> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Bangkok>", "target_var": "?u_1"}], "id": "1186", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Bangkok> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual \u00e9 o n\u00famero total de religi\u00f5es seguidas por pessoas nascidas em Bangkok?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3071", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Shelby_County,_Tennessee> . ?uri <http://dbpedia.org/property/starring> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais filmes t\u00eam algu\u00e9m no elenco de Shelby County, no Tennessee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "56", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richard_Winn> <http://dbpedia.org/ontology/governor> ?x . ?x <http://dbpedia.org/property/appointer> ?uri  . }", "question": "Quem nomeou o governador sob o qual Richard Winn serviu?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1309", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mayor> <http://dbpedia.org/resource/Anne_Hidalgo>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>}", "question": "Qual \u00e9 a cidade cuja prefeita \u00e9 Anne Hidalgo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "695", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/Joel_Quenneville> . ?uri <http://dbpedia.org/property/champion> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/IceHockeyLeague>}", "question": "Em que liga de h\u00f3quei no gelo venceu a equipe treinada por Joel Quenneville?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2952", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Allen_(musician)> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Qual artista musical colaborou com Tony Allen (m\u00fasico) e o selo Victor Entertainment?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1726", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentteam> <http://dbpedia.org/resource/Michigan_Wolverines>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}", "question": "Quais jogadores de futebol americano jogam atualmente pelo Michigan Wolverines?"}]