[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/fields> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> .?u_0 <http://dbpedia.org/property/fields> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris>", "target_var": "?u_1"}], "id": "4038", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }", "question": "Para todos os que morreram em paris, conte seus diferentes campos de trabalho."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4846", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/knownFor> <http://dbpedia.org/resource/Cubic_Hermite_spline> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Qual \u00e9 o pr\u00eamio ganho dos cientistas conhecidos por Cubic Hermite spline?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4479", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heydar> <http://dbpedia.org/property/meaning> ?uri } ", "question": "Qual \u00e9 o significado de Heydar?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Moondog_Matinee>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?u_0 .<http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}], "id": "1746", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri. <http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?uri} ", "question": "Qual compositor trabalhou posteriormente para Moondog Matinee e tamb\u00e9m comp\u00f4s The TImes They are A changin?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Ronaldo>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ground> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Ronaldo> .?u_0 <http://dbpedia.org/ontology/ground> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Ronaldo>", "target_var": "?u_1"}], "id": "19", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Ronaldo> . ?x <http://dbpedia.org/ontology/ground> ?uri  . }", "question": "Por quantos motivos diferentes foram disputadas as temporadas presididas por Ronaldo?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1322", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sentinel_High_School> <http://dbpedia.org/property/teamName> ?uri } ", "question": "A equipe Sentinel High School \u00e9 conhecida como?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3567", "query": "ASK WHERE { <http://dbpedia.org/resource/Sampson_Cudjoe> <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Ghana> }", "question": "Sampson Cudjoe joga pela sele\u00e7\u00e3o nacional de Gana?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2521", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kathimerini> <http://dbpedia.org/ontology/publisher> ?x . ?x <http://dbpedia.org/property/residence> ?uri  . }", "question": "Onde mora o editor do Kathimerini?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "218", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/coach> <http://dbpedia.org/resource/Louis_Dunbar> . ?uri <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Jeff_Munn>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballTeam>}", "question": "Qual \u00e9 o time de basquete que \u00e9 treinado por Louis Dunbar e tem o presidente como Jeff Munn?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1487", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/John_Tortorella> . ?uri <http://dbpedia.org/ontology/team> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/IceHockeyPlayer>}", "question": "D\u00ea-me uma contagem de todos os jogadores de h\u00f3quei no gelo cujas equipes s\u00e3o comandadas por John Tortorella?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "438", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mikhail_Pashnin> <http://dbpedia.org/property/prospectTeam> ?uri. <http://dbpedia.org/resource/Bob_MacMillan> <http://dbpedia.org/property/draftTeam> ?uri} ", "question": "Que equipe de recrutamento de bob Macmillan tamb\u00e9m \u00e9 a equipe potencial de Mikhail Pashnin?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "4174", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/O.co_Coliseum> <http://dbpedia.org/ontology/tenant> ?uri  . }", "question": "Quantas ligas usaram o O.co Coliseum?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2750", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?uri. <http://dbpedia.org/resource/Philip_W._Pillsbury> <http://dbpedia.org/property/education> ?uri} ", "question": "Qual \u00e9 o lugar comum de estudo para jack McGregor e Philip W. Pillsbury?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0 .<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0 .?u_1 <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_0 .?u_1 <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0 .<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_0 .?u_1 <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_1 .<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_1 .?u_0 <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0 .<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?u_1 .?u_0 <http://dbpedia.org/ontology/president> ?u_1", "target_var": "?u_1"}], "id": "3288", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?uri. <http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?uri . }", "question": "Sob qual presidente Loretta Ucelli e Ann Lewis ocuparam um cargo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3433", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Fleisher_Yarn> . ?x <http://dbpedia.org/property/debutteam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Com que time os jogadores come\u00e7aram suas carreiras, que agora jogam no Fleisher Yarn?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> .?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "4650", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Young_Life> . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Onde morreram as pessoas que eram conhecidas por Young Life?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3688", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Plymouth_University> . ?x <http://dbpedia.org/property/chancellor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Quem s\u00e3o os reitores das universidades afiliadas \u00e0 Plymouth University?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2763", "query": "ASK WHERE { <http://dbpedia.org/resource/Lionel_Messi> <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Argentina_national_football_team> }", "question": "Lionel Messi joga na Sele\u00e7\u00e3o Argentina de Futebol?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "802", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oscar_and_Lucinda_(film)> <http://dbpedia.org/ontology/narrator> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais pr\u00eamios a narradora de Oscar e Lucinda ganhou?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/basedOn> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/basedOn> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_1 <http://dbpedia.org/ontology/basedOn> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/basedOn> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_1 <http://dbpedia.org/ontology/basedOn> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> .?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/basedOn> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>", "target_var": "?u_1"}], "id": "2997", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Jos\u00e9_Luis_Narom> . ?x <http://dbpedia.org/ontology/basedOn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>}", "question": "Em que se baseia o musical cuja m\u00fasica \u00e9 de Jose Luis Narom?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2228", "query": "ASK WHERE { <http://dbpedia.org/resource/Providence_Chapel,_Charlwood> <http://dbpedia.org/property/style> <http://dbpedia.org/resource/New_England> }", "question": "A Capela da Provid\u00eancia, em Charlwood, \u00e9 feita no novo estilo ingl\u00eas de arquitetura?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4785", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_M._Sears> <http://dbpedia.org/ontology/employer> ?uri. <http://dbpedia.org/resource/Burro_Flats_Painted_Cave> <http://dbpedia.org/ontology/governingBody> ?uri} ", "question": "Qual local de trabalho do Michael M. Sears tamb\u00e9m \u00e9 o \u00f3rg\u00e3o governante da Caverna Pintada de Burro Flats?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society> .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}], "id": "2077", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> . ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Royal_Society> . }", "question": "Quem estava nos conselhos da Freedom of the City e da Royal Society?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "582", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/ITV_(TV_network)>  . }", "question": "Quem s\u00e3o as pessoas que a ITV (rede de TV) empregou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "203", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WBCQ_(SW)> <http://dbpedia.org/property/area> ?uri } ", "question": "Qual \u00e9 a \u00e1rea de transmiss\u00e3o do WBCQ (SW)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4346", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kang_Young-hoon> <http://dbpedia.org/property/president> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Que religi\u00e3o o presidente seguia servida por Kang Young-hoon?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3478", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCountry> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/ontology/type> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Que tipo de edif\u00edcios s\u00e3o encontrados na Inglaterra?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/John_Roeslein> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/state> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/John_Roeslein> <http://dbpedia.org/ontology/team> ?u_0 .?u_0 <http://dbpedia.org/property/state> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/John_Roeslein> <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}], "id": "2929", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Roeslein> <http://dbpedia.org/ontology/team> ?x . ?x <http://dbpedia.org/property/state> ?uri  . }", "question": "Em que estado est\u00e1 a equipe, que tem John Roeslein?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3085", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michel_Hazanavicius> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Geoffrey_Rush> <http://dbpedia.org/property/awards> ?uri . }", "question": "Quais pr\u00eamios foram dados a michel hazanavicius e geoffrey rush?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/firstAscentPerson> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_1 <http://dbpedia.org/ontology/firstAscentPerson> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/firstAscentPerson> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_1 <http://dbpedia.org/ontology/firstAscentPerson> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/firstAscentPerson> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}], "id": "1018", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> . ?x <http://dbpedia.org/ontology/firstAscentPerson> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "D\u00ea-me a contagem de todas as pessoas que escalaram um pico na Calif\u00f3rnia?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base> .?u_0 <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> ?u_1 .?u_1 <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base> .?u_1 <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}], "id": "1583", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Grand_Forks_Air_Force_Base> . ?x <http://dbpedia.org/ontology/region> ?uri }", "question": "Liste o n\u00famero total de regi\u00f5es do edif\u00edcio que est\u00e3o localizadas na \\ Base da For\u00e7a A\u00e9rea de Grand Forks?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Stanislav_Morozov> <http://dbpedia.org/ontology/formerCoach> <http://dbpedia.org/resource/Halyna_Kukhar>", "target_var": "?u_-1"}], "id": "1032", "query": "ASK WHERE { <http://dbpedia.org/resource/Stanislav_Morozov> <http://dbpedia.org/ontology/formerCoach> <http://dbpedia.org/resource/Halyna_Kukhar> }", "question": "Halyna Kukhar \u00e9 a ex-treinadora de Stanislav Morozov?"}]