[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1589", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Naval_Air_Facility_Adak> <http://dbpedia.org/property/governingBody> ?uri. <http://dbpedia.org/resource/Oahu_Railway_and_Land_Company> <http://dbpedia.org/property/governingBody> ?uri . }", "question": "Qual \u00e9 o \u00f3rg\u00e3o regulador comum da Naval Air Facility Adak e da Oahu Railway and Land Company?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>", "target_var": "?u_0"}], "id": "2223", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}", "question": "Conte as bebidas originadas na Inglaterra."}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Racism>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Racism> .?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Racism>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Racism> .?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}], "id": "2217", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Racism> . ?x <http://dbpedia.org/ontology/nonFictionSubject> ?uri }", "question": "Qual \u00e9 o n\u00famero total de outros assuntos de n\u00e3o fic\u00e7\u00e3o dos livros cujo um dos assuntos \u00e9 Racismo?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4483", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/U.S._Route_59> <http://dbpedia.org/property/junction> ?uri } ", "question": "Nomeie todos os cruzamentos da US Route 59?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}], "id": "1739", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "D\u00ea-me alguns softwares que funcionam no Mac OS"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2480", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/LATV> . ?x <http://dbpedia.org/property/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionStation>}", "question": "Qual \u00e9 a cidade da emissora de televis\u00e3o afiliada ao LATV?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2893", "query": "ASK WHERE { <http://dbpedia.org/resource/Duane_Allman> <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_SG> }", "question": "Duanne Allman foi famosa por interpretar a Gibson SG?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Bob_Hawke>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bob_Hawke> <http://dbpedia.org/ontology/primeMinister> ?u_0", "target_var": "?u_0"}], "id": "149", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Bob_Hawke> } ", "question": "Quem eram todas as pessoas no cargo quando Bob Hawke era o PM?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "676", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bob_Adams_(American_football)> <http://dbpedia.org/property/knownFor> ?uri } ", "question": "Pelo que Bob Adams (futebol americano) \u00e9 conhecido?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Guatemala> <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Unitary_state>", "target_var": "?u_-1"}], "id": "1261", "query": "ASK WHERE { <http://dbpedia.org/resource/Guatemala> <http://dbpedia.org/ontology/governmentType> <http://dbpedia.org/resource/Unitary_state> }", "question": "A Guatemala \u00e9 um estado unit\u00e1rio?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Chelsea_F.C.>", "target_var": "?u_0"}], "id": "4917", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Chelsea_F.C.>  . }", "question": "Quem \u00e9 o dono do Chelsea FC?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "12", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> <http://dbpedia.org/property/affiliation> ?uri. <http://dbpedia.org/resource/Duncan_U._Fletcher> <http://dbpedia.org/ontology/almaMater> ?uri} ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o comum do Hospital Infantil Monroe Carell Jr. em Vanderbilt e alma mater de Duncan U. Fletcher?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1833", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/doctoralStudents> <http://dbpedia.org/resource/Charles_Drummond_Ellis> . ?uri <http://dbpedia.org/property/knownFor> <http://dbpedia.org/resource/Manhattan_Project>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Entre o cientista conhecido pelo Projeto Manhattan que tinha um aluno de doutorado chamado Charles Ellis?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3248", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/UEM_Group> . ?x <http://dbpedia.org/property/crosses> ?uri  . }", "question": "O grupo UEM fez pontes cruzando sobre o qu\u00ea?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1491", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/Germany> . ?x <http://dbpedia.org/ontology/relation> ?uri  . }", "question": "Quantos parentes existem das pessoas que morreram na Alemanha?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_0 <http://dbpedia.org/ontology/residence> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts>", "target_var": "?u_1"}], "id": "2727", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> . ?x <http://dbpedia.org/ontology/residence> ?uri  . }", "question": "Onde mora o bacharel em artes?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3686", "query": "ASK WHERE { <http://dbpedia.org/resource/Callisto_(moon)> <http://dbpedia.org/property/discoverer> <http://dbpedia.org/resource/Galileo_Galilei> }", "question": "Castillo foi descoberto por Galileo?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/A_Foreign_Policy_of_Freedom> <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Politics>", "target_var": "?u_-1"}], "id": "1424", "query": "ASK WHERE { <http://dbpedia.org/resource/A_Foreign_Policy_of_Freedom> <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Politics> }", "question": "Uma pol\u00edtica externa de liberdade pertence ao g\u00eanero Pol\u00edtica?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_0"}], "id": "4605", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}", "question": "Quantas montanhas existem na cordilheira de Sierra Nevada?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4595", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/characters> <http://dbpedia.org/resource/Robin_(comics)> . ?x <http://dbpedia.org/property/characters> ?uri }", "question": "Qual \u00e9 o n\u00famero total de outros personagens das pe\u00e7as cujos personagens \u00e9 Robin (quadrinhos)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "731", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liv_Ullmann> <http://dbpedia.org/ontology/partner> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pela esposa de Liv Ullmann?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1231", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kaptaan> <http://dbpedia.org/property/recorded> ?uri. <http://dbpedia.org/resource/Orient_News> <http://dbpedia.org/property/headquarters> ?uri} ", "question": "O que \u00e9 o Recorded of the Kaptaan \u00e9 tamb\u00e9m a sede do Orient News?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nearestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nearestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda> .?u_0 <http://dbpedia.org/ontology/nearestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda> .?u_1 <http://dbpedia.org/ontology/nearestCity> ?u_0", "target_var": "?u_0"}], "id": "1634", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Uganda> . ?x <http://dbpedia.org/ontology/nearestCity> ?uri }", "question": "Qual \u00e9 o n\u00famero total de outros pa\u00edses mais pr\u00f3ximos dos lagos cujo pa\u00eds mais pr\u00f3ximo \u00e9 Uganda?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform> .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform> .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform> .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform> .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}], "id": "3936", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/operatingSystem> <http://dbpedia.org/resource/Cross-platform> . ?x <http://dbpedia.org/ontology/developer> ?uri  . }", "question": "Quantas empresas desenvolveram softwares de plataforma cruzada?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3268", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/battles> <http://dbpedia.org/resource/Operation_Dragoon> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quantos t\u00edtulos foram dados \u00e0s pessoas que se engajaram na Opera\u00e7\u00e3o Drag\u00e3o?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1934", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Penobscot_Island_Air> <http://dbpedia.org/property/founded> ?uri. <http://dbpedia.org/resource/Ellei_Johndro> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Qual local fundado pela Penobscot Island Air \u00e9 tamb\u00e9m o local do Ellei Johndro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "491", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/firstTeam> <http://dbpedia.org/resource/Williams_Grand_Prix_Engineering> . ?x <http://dbpedia.org/ontology/poleDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}", "question": "Liste os pilotos da pole nos grandes pr\u00eamios em que a Williams Grand Prix Engineering foi a primeira equipe?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2962", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Joseph_Clay_(Georgia)> <http://dbpedia.org/ontology/appointer> ?uri. <http://dbpedia.org/resource/William_Carmichael_(diplomat)> <http://dbpedia.org/property/president> ?uri} ", "question": "Quem nomeia o Joseph Clay (Ge\u00f3rgia) \u00e9 tamb\u00e9m o presidente do William Carmichael (diplomata)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2329", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_M._Sears> <http://dbpedia.org/property/employer> ?uri } ", "question": "Quem \u00e9 o empregador de Michael M. Sears?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Autoconf> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}], "id": "2195", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Autoconf> <http://dbpedia.org/ontology/developer> ?uri } ", "question": "Listar coisas desenvolvidas pela Autoconf?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3064", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/McClain_(band)> . ?x <http://dbpedia.org/property/artist> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Liste todos os artistas dos programas de TV que tenham McClain como um dos artistas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "657", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Tony_Bennett> . ?uri <http://dbpedia.org/ontology/child> ?x  . }", "question": "Quem \u00e9 a pessoa cujo filho atuou com Tony Bennett?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/North_Carolina_Highway_280> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Arden,_North_Carolina>", "target_var": "?u_-1"}], "id": "2374", "query": "ASK WHERE { <http://dbpedia.org/resource/North_Carolina_Highway_280> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Arden,_North_Carolina> }", "question": "A rodovia Carolina do Norte 280 termina em Arden?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Angola> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Angola_Avante>", "target_var": "?u_-1"}], "id": "2225", "query": "ASK WHERE { <http://dbpedia.org/resource/Angola> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Angola_Avante> }", "question": "Angola Avante \u00e9 o hino de Angola?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4264", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Thames_Estuary> . ?uri <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Reading,_Berkshire>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Nomeie o rio com foz como Estu\u00e1rio do T\u00e2misa e passa por Reading Berkshire?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Ivory_Coast_national_football_team>", "target_var": "?u_0"}], "id": "1170", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Ivory_Coast_national_football_team> } ", "question": "Quem joga no time de futebol da Costa do Marfim?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_0 <http://dbpedia.org/ontology/layout> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_0 <http://dbpedia.org/ontology/layout> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_1 <http://dbpedia.org/ontology/layout> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_1 <http://dbpedia.org/ontology/layout> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}], "id": "132", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/layout> <http://dbpedia.org/resource/Front-engine,_four-wheel-drive_layout> . ?x <http://dbpedia.org/ontology/layout> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Liste todos os layouts do autom\u00f3vel cujo layout \u00e9 um layout com tra\u00e7\u00e3o nas quatro rodas?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Gatwick_Airport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Gatwick_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Gatwick_Airport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Gatwick_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Gatwick_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "471", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Gatwick_Airport> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Para quantos lugares voam as companhias a\u00e9reas, cuja sede est\u00e1 localizada no Aeroporto de Gatwick?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3225", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Warner_Bros._International_Television> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cujo distribuidor \u00e9 uma divis\u00e3o da Warner Bros. International TV?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1405", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WPC_Dynamo_Moscow> <http://dbpedia.org/property/arena> ?uri } ", "question": "Onde fica a arena do WPC Dynamo Moscow?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2876", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Drayton> <http://dbpedia.org/property/appointer> ?uri. <http://dbpedia.org/resource/George_Madison> <http://dbpedia.org/ontology/relation> ?uri} ", "question": "Qual parente de George Madison \u00e9 o apontador de John Drayton?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mississippi_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Clearwater_County,_Minnesota>", "target_var": "?u_-1"}], "id": "4504", "query": "ASK WHERE { <http://dbpedia.org/resource/Mississippi_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Clearwater_County,_Minnesota> }", "question": "O mississippi est\u00e1 localizado no condado de Clearwater, minnesota?"}]