[{"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3334", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/allegiance> <http://dbpedia.org/resource/Union_(American_Civil_War)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>}", "question": "Quais militares serviram \u00e0 sua lealdade \u00e0 Uni\u00e3o (Guerra Civil Americana)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4546", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Korean_Peninsula> <http://dbpedia.org/ontology/border> ?uri. <http://dbpedia.org/resource/Krusty_(music_group)> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Que pa\u00eds fronteiri\u00e7o da Pen\u00ednsula Coreana \u00e9 tamb\u00e9m o pa\u00eds de Krusty, um grupo musical?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>", "target_var": "?u_0"}], "id": "4223", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . }", "question": "O Mac OS \u00e9 o sistema operacional de quantas coisas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2387", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Stewart_Copeland>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cujo compositor \u00e9 Stewart Copeland?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4243", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/border> <http://dbpedia.org/resource/North_Korea> . ?x <http://dbpedia.org/ontology/border> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>}", "question": "Liste a fronteira da regi\u00e3o administrativa que faz fronteira com a Coreia do Norte?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3995", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Antoine_Bibeau> <http://dbpedia.org/property/draftTeam> ?uri. <http://dbpedia.org/resource/Nathan_Dempsey> <http://dbpedia.org/property/playedFor> ?uri} ", "question": "Qual \u00e9 o draft da equipe do Antoine Bibeau e tamb\u00e9m tem o jogador chamado Nathan Dempsey?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "640", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/broadcastArea> <http://dbpedia.org/resource/Agal\u00e9ga> . ?x <http://dbpedia.org/property/broadcastArea> ?uri  . }", "question": "Liste a \u00e1rea de transmiss\u00e3o das esta\u00e7\u00f5es de TV que tamb\u00e9m atuam em Agalga?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_Defense>", "target_var": "?u_0"}], "id": "3902", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_Defense> } ", "question": "Em quais organiza\u00e7\u00f5es militares o Departamento de Defesa dos Estados Unidos est\u00e1 dividido?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "637", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/deputy> <http://dbpedia.org/resource/Neil_Brown_(Australian_politician)>  . }", "question": "De quem \u00e9 o deputado Neil Brown?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/KFFG>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/broadcastNetwork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/KFFG> .?u_0 <http://dbpedia.org/ontology/broadcastNetwork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/KFFG> <http://dbpedia.org/ontology/sisterStation> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/KFFG> <http://dbpedia.org/ontology/sisterStation> ?u_0 .?u_0 <http://dbpedia.org/ontology/broadcastNetwork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sisterStation> <http://dbpedia.org/resource/KFFG>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/KFFG> <http://dbpedia.org/ontology/sisterStation> ?u_1", "target_var": "?u_1"}], "id": "4262", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/KFFG> <http://dbpedia.org/ontology/sisterStation> ?x . ?x <http://dbpedia.org/ontology/broadcastNetwork> ?uri  . }", "question": "Em que \u00e1rea de transmiss\u00e3o a esta\u00e7\u00e3o irm\u00e3 da KFFG vai ao ar?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3910", "query": "ASK WHERE { <http://dbpedia.org/resource/Neil_Armstrong> <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Gemini_8> }", "question": "Neil Armstrong estava na miss\u00e3o Gemini 8?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2986", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Apollo_11> } ", "question": "qual miss\u00e3o do astronauta era a Apollo 11?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/debutteam> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles> .?u_0 <http://dbpedia.org/property/debutteam> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/debutteam> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles> .?u_0 <http://dbpedia.org/property/debutteam> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>", "target_var": "?u_1"}], "id": "2096", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Los_Angeles> . ?x <http://dbpedia.org/property/debutteam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}", "question": "Qual \u00e9 o time de estreia dos jogadores de beisebol que morreram em Los Angeles?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Instagram>", "target_var": "?u_0"}], "id": "4611", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Instagram> } ", "question": "Qual empresa possui instagram?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_0 <http://dbpedia.org/ontology/operator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> ?u_1 .?u_1 <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_0 <http://dbpedia.org/ontology/operator> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_1 <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_1 <http://dbpedia.org/ontology/operator> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>", "target_var": "?u_1"}], "id": "3674", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Budapest> . ?x <http://dbpedia.org/ontology/operator> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Train>}", "question": "Liste todos os operadores do trem que operam em Budapeste?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Puss_in_Boots_(1922_film)> <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Puss_in_Boots_(1922_film)> <http://dbpedia.org/ontology/producer> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Puss_in_Boots_(1922_film)> <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}], "id": "2841", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Puss_in_Boots_(1922_film)> <http://dbpedia.org/ontology/producer> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pelo produtor de Gato de Botas (filme)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "921", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Bill_Clinton> . ?uri <http://dbpedia.org/ontology/lieutenant> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}", "question": "Qual presidente teve tenentes cujo governador foi Bill Clinton?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Liger> <http://dbpedia.org/ontology/species> ?u_0", "target_var": "?u_0"}], "id": "546", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liger> <http://dbpedia.org/ontology/species> ?uri } ", "question": "Nomeie a esp\u00e9cie de Liger?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3666", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jan_Paulsen> <http://dbpedia.org/ontology/almaMater> ?x . ?x <http://dbpedia.org/property/state> ?uri  . }", "question": "Em que estado est\u00e1 localizada a alma mater de Jan Paulsen?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "1900", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Militia>  . }", "question": "Quantos pol\u00edticos est\u00e3o na mil\u00edcia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2028", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Minister_of_Defense_(Saudi_Arabia)> . ?x <http://dbpedia.org/property/battles> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Em que guerras estiveram pessoas do minist\u00e9rio da defesa da Ar\u00e1bia Saudita envolvido?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2301", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/firstTeam> <http://dbpedia.org/resource/Scuderia_Ferrari> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}", "question": "Quem foram os primeiros pilotos em Grand Prixes onde a primeira equipe foi a Scuderia Ferrari?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1885", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/UEM_Group> . ?x <http://dbpedia.org/property/crosses> ?uri  . }", "question": "Quantas coisas as pontes projetadas pelo grupo UEM passam?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1642", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/opponent> <http://dbpedia.org/resource/John_G._Schmitz> . ?x <http://dbpedia.org/ontology/incumbent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}", "question": "Sob qual presidente dos EUA foi um pol\u00edtico em oposi\u00e7\u00e3o a John G Schmitz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3509", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Les_Claypool> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . }", "question": "Cuja m\u00fasica tema \u00e9 composta pela banda e um de seus membros \u00e9 Les Claypool?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_1 <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_1 <http://dbpedia.org/ontology/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_0 <http://dbpedia.org/ontology/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> .?u_0 <http://dbpedia.org/ontology/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}], "id": "4809", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/London> . ?x <http://dbpedia.org/ontology/writer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>}", "question": "Quem gravou seus singles em Londres?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Dallas_Cowboys>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Dallas_Cowboys> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>", "target_var": "?u_0"}], "id": "4357", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Dallas_Cowboys>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}", "question": "Quem foram os jogadores de futebol americano que jogaram pelo Dallas Cowboys?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Bangalore>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Bangalore> .?u_0 <http://dbpedia.org/ontology/party> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Bangalore>", "target_var": "?u_1"}], "id": "3788", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Bangalore> . ?x <http://dbpedia.org/ontology/party> ?uri  . }", "question": "Os pol\u00edticos nascidos em Bangalore est\u00e3o agora em que partidos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4494", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Williamsburg,_Kansas> . ?x <http://dbpedia.org/property/debutteam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}", "question": "Qual \u00e9 o time de estreia do jogador de beisebol que nasceu em Williamsburg, Kansas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4967", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Motorpsycho_Nitemare> <http://dbpedia.org/property/composer> ?uri } ", "question": "Diga o nome do compositor do motorpsycho Nitemare?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Metallica> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/James_Hetfield>", "target_var": "?u_-1"}], "id": "836", "query": "ASK WHERE { <http://dbpedia.org/resource/Metallica> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/James_Hetfield>  . }", "question": "James Hetfield \u00e9 um membro da banda Metallica?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mathura\u2013Vadodara_Section> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Vadodara_Junction_railway_station>", "target_var": "?u_-1"}], "id": "601", "query": "ASK WHERE { <http://dbpedia.org/resource/Mathura\u2013Vadodara_Section> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Vadodara_Junction_railway_station> }", "question": "A esta\u00e7\u00e3o ferrovi\u00e1ria de Vadodara fica no final da rota Mathura Vadodara?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2184", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Stan_Van_Gundy> } ", "question": "Stan Van Gundy atua como t\u00e9cnico e presidente de qual time de basquete?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4266", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_eShop> . ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_Network> . }", "question": "O que fornece os servi\u00e7os da Nintendo eShop e da Nintendo Network?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2725", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Harvard-Westlake_School> . ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screen_Actors_Guild_Life_Achievement_Award>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual \u00e9 o nome da pessoa que foi educada em Harvard-Westlake e ganhou o Screen Actor Guild Life Achievement Award?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_0 .<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_0 .?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_0 .?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_0 .<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_0 .?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_1 .<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_0 .<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}], "id": "1070", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Louisa_Hill> <http://dbpedia.org/ontology/country> ?uri. <http://dbpedia.org/resource/American_Football_Wellington> <http://dbpedia.org/ontology/country> ?uri . }", "question": "Qual \u00e9 a na\u00e7\u00e3o comum de Louisa Hill e American Football Wellington?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1775", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Springer> <http://dbpedia.org/property/team> ?uri. <http://dbpedia.org/resource/Syracuse_University_Press> <http://dbpedia.org/property/parent> ?uri} ", "question": "Qual clube de Michael Springer tamb\u00e9m \u00e9 a organiza\u00e7\u00e3o-m\u00e3e da imprensa da Syracuse University?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4808", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Microsoft_BASIC> <http://dbpedia.org/ontology/designer> ?uri. <http://dbpedia.org/resource/Language_Integrated_Query> <http://dbpedia.org/ontology/designer> ?uri . }", "question": "Qual empresa criou o BASIC e o Language Integrated Query?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1283", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/editor> <http://dbpedia.org/resource/Hugh_Hefner>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Magazine>}", "question": "Hugh Hefner \u00e9 editor de qual revista?"}]