[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>", "target_var": "?u_1"}], "id": "1497", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Cathedral_Range> . ?x <http://dbpedia.org/ontology/firstAscentPerson> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}", "question": "Lista das pessoas que foram as primeiras a subir uma montanha na cordilheira da Catedral?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3459", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Stewart_Bovell> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "D\u00ea-me o mascote da unidade militar em que Stewart Bovell serviu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3755", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/GetTV> <http://dbpedia.org/property/parent> ?uri. <http://dbpedia.org/resource/Hypnotize_Minds> <http://dbpedia.org/property/parent> ?uri . }", "question": "Qual empresa possui as mentes GetTV e Hypnotize?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "2591", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Indochina> . ?uri <http://dbpedia.org/ontology/commander> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Em que guerras lutaram os comandantes nascidos na Indochina?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mary_Poppins_(musical)> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_0"}], "id": "783", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mary_Poppins_(musical)> <http://dbpedia.org/ontology/author> ?uri } ", "question": "Quem escreveu o musical de Mary Poppins?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3493", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Oslo> . ?uri <http://dbpedia.org/property/owners> ?x  . }", "question": "Qual jornal \u00e9 propriedade de pessoas que vivem em Oslo?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "229", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/ontology/draftTeam> ?uri  . }", "question": "Para quantas equipes diferentes os Ontarianos foram convocados?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "857", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alexandre_Tichonov> <http://dbpedia.org/property/university> ?uri } ", "question": "Nomeie a universidade de Alexandre Tichonov?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "4274", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Bellator_MMA:_Season_Eleven> <http://dbpedia.org/property/city> ?uri  . }", "question": "Em quantas cidades aconteceu o Bellaton MMA, 11\u00aa temporada?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "408", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/workInstitutions> <http://dbpedia.org/resource/St_George's_Hospital> . ?uri <http://dbpedia.org/ontology/academicAdvisor> ?x  . }", "question": "De quem \u00e9 o conselheiro acad\u00eamico que trabalha no Hospital St George?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_1 <http://dbpedia.org/property/education> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_0 <http://dbpedia.org/property/education> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_0 <http://dbpedia.org/property/education> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}], "id": "170", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?uri <http://dbpedia.org/property/education> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Conte o n\u00famero de pessoas que se formaram em universidades afiliadas \u00e0 NCAA."}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "540", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> . ?uri <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd>  . }", "question": "Qual governador de Charles Willing Byrd lutou na batalha de Siege of Fort Recovery?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Paul_Dini>", "target_var": "?u_0"}], "id": "2210", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Paul_Dini>  . }", "question": "Quantos personagens foram feitos por Paul Dini?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2304", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Eric_Harris_and_Dylan_Klebold>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quais s\u00e3o os nomes das v\u00edtimas afetadas pelos tiroteios de Eric Harris e Dylan Klebold?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "613", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}", "question": "Liste os jornais com sede em Estocolmo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2101", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/\u014ctani_University> <http://dbpedia.org/property/affiliation> ?uri. <http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?uri} ", "question": "Liste a regi\u00e3o da Universidade de Tani, que tamb\u00e9m \u00e9 a postura de vida de udit Raj?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Pink_Floyd> <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/David_Gilmour>", "target_var": "?u_-1"}], "id": "1808", "query": "ASK WHERE { <http://dbpedia.org/resource/Pink_Floyd> <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/David_Gilmour> }", "question": "David Gilmour era um ex-membro do Pink Floyd?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/England_national_football_team>", "target_var": "?u_0"}], "id": "3438", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/England_national_football_team> } ", "question": "quais s\u00e3o alguns jogadores da sele\u00e7\u00e3o inglesa de futebol?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1161", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Many_Hands> <http://dbpedia.org/property/author> ?x . ?x <http://dbpedia.org/ontology/genre> ?uri  . }", "question": "Que g\u00eanero de livro o escritor de The Many Hands escreve?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4225", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Aghasalim_Childagh> <http://dbpedia.org/property/deathDate> ?uri } ", "question": "Onde Aghasalim Childagh morreu?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Josh_Bell_(gridiron_football)> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Josh_Bell_(gridiron_football)> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Josh_Bell_(gridiron_football)> <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}], "id": "3652", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Josh_Bell_(gridiron_football)> <http://dbpedia.org/ontology/debutTeam> ?x . ?x <http://dbpedia.org/ontology/locationCity> ?uri  . }", "question": "Onde est\u00e1 localizado o time de futebol no qual Josh Bell fez sua estreia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1610", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/John_B._Waldo> . ?x <http://dbpedia.org/property/state> ?uri  . }", "question": "De onde \u00e9 o sucessor de john waldo?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screenwriter> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screenwriter> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}], "id": "1932", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Screenwriter> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quantos pr\u00eamios os roteiristas ganharam?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama>", "target_var": "?u_1"}], "id": "564", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> . ?x <http://dbpedia.org/ontology/owner> ?uri  . }", "question": "Quantos propriet\u00e1rios existem de coisas localizadas no Alabama?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Literary_Nightmare> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?u_0 .<http://dbpedia.org/resource/A_Literary_Nightmare> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_0"}], "id": "3571", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Apple_Tree> <http://dbpedia.org/ontology/basedOn> ?uri. <http://dbpedia.org/resource/A_Literary_Nightmare> <http://dbpedia.org/ontology/author> ?uri} ", "question": "Qual escritor de Um pesadelo liter\u00e1rio tamb\u00e9m estendeu a obra de A macieira?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4247", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Johnny_Cash> . ?uri <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Kris_Kristofferson> . }", "question": "Quem colaborou com Johnny Cash e Kris Kristofferson?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2388", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o cujo tema de abertura \u00e9 Where Everybody Knows Your Name?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}], "id": "1471", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> . ?uri <http://dbpedia.org/ontology/foundationPlace> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quantas empresas foram fundadas em Denton, Texas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2630", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Viveka_Babajee> <http://dbpedia.org/property/citizenship> ?uri } ", "question": "De quais pa\u00edses Viveka Babajee tem cidadania?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1835", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kady_O'Malley> <http://dbpedia.org/property/homeTown> ?uri. <http://dbpedia.org/resource/Perianne_Jones> <http://dbpedia.org/property/club> ?uri} ", "question": "Qual clube do perianne Lones \u00e9 tamb\u00e9m a cidade natal do Kady O&#39;Malley?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4928", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/beatifiedBy> <http://dbpedia.org/resource/Pope_Pius_XI> . ?x <http://dbpedia.org/ontology/majorShrine> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Onde est\u00e3o os santu\u00e1rios dos santos beatificados pelo Papa Pio XI?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ted_Failon> <http://dbpedia.org/ontology/ethnicity> ?u_0", "target_var": "?u_0"}], "id": "3475", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ted_Failon> <http://dbpedia.org/ontology/ethnicity> ?uri } ", "question": "Qual \u00e9 a \u00e9tica de Ted Falon?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Balangir_district> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}], "id": "1533", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Balangir_district> <http://dbpedia.org/ontology/leaderName> ?uri } ", "question": "Por que pessoa de qual partido pol\u00edtico o distrito de Balangir \u00e9 liderado?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Colonial_troops>", "target_var": "?u_0"}], "id": "4327", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Colonial_troops> } ", "question": "Quem \u00e9 a figura pol\u00edtica cujo ramo militar s\u00e3o as tropas coloniais?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Foxy_Brown_(rapper)>", "target_var": "?u_0"}], "id": "2484", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Foxy_Brown_(rapper)> } ", "question": "Foxy Brown estava associada a qual banda?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4207", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day> . ?uri <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Josh_Friedman>  . }", "question": "Qual cria\u00e7\u00e3o de Josh Friedman foi retratada em Terminator 2?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1172", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/PATTS_College_of_Aeronautics> <http://dbpedia.org/property/athletics> ?uri. <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/property/athletics> ?uri . }", "question": "Quais s\u00e3o alguns jogos comuns jogados na faculdade de aeron\u00e1utica PATTS e Jamiatu mu\u00e7ulmano mindanao?"}]