[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/language> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_1 <http://dbpedia.org/property/language> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/language> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_1 <http://dbpedia.org/property/language> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/language> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/language> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_0 <http://dbpedia.org/property/language> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> .?u_0 <http://dbpedia.org/property/language> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Germanic_languages> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/languageFamily> ?u_0", "target_var": "?u_1"}], "id": "295", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> . ?uri <http://dbpedia.org/property/language> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quantos escritores falam uma l\u00edngua pertencente ao tipo de l\u00ednguas germ\u00e2nicas?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2361", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/assembly> <http://dbpedia.org/resource/Toluca> . ?x <http://dbpedia.org/property/related> ?uri  . }", "question": "Enumere os carros relacionados aos montados em Toluca?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "386", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ivan_III_of_Russia> <http://dbpedia.org/property/placeOfBurial> ?uri } ", "question": "Onde est\u00e1 o t\u00famulo de Ivan III da R\u00fassia?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Barony_of_Caux> <http://dbpedia.org/ontology/capital> ?u_0", "target_var": "?u_0"}], "id": "3308", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Barony_of_Caux> <http://dbpedia.org/ontology/capital> ?uri } ", "question": "Nomeie a capital do Baronato de Caux?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4013", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Los_Angeles_Clippers>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Diga o nome dos jogadores de basquete escolhidos pelo Los Angeles Clippers?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/firstAscentPerson> <http://dbpedia.org/resource/Tenzing_Norgay>", "target_var": "?u_-1"}], "id": "2231", "query": "ASK WHERE { <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/firstAscentPerson> <http://dbpedia.org/resource/Tenzing_Norgay> }", "question": "Tenzing Norgay \u00e9 a primeira pessoa a escalar o Monte Everest?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management> .?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management> .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0 .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management> .?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management> .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}], "id": "2554", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Wealth_management> . ?x <http://dbpedia.org/ontology/product> ?uri }", "question": "Contar o n\u00famero de outro produto dos bancos cujo um dos produtos \u00e9 Gerenciamento de patrim\u00f4nio?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4335", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/knownFor> <http://dbpedia.org/resource/Philosophi\u00e6_Naturalis_Principia_Mathematica> } ", "question": "Qual cientista \u00e9 conhecido por escrever Philosophi Naturalis Principia Mathematica?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3515", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discoverer> <http://dbpedia.org/resource/Johann_Gottfried_Galle>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Planet>}", "question": "Qual planeta foi descoberto pela primeira vez por Johann Gottfried Galle?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1839", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Auckland> . ?x <http://dbpedia.org/property/purpose> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}", "question": "O que algumas organiza\u00e7\u00f5es em Auckland foram criadas para fazer?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4384", "query": "ASK WHERE { <http://dbpedia.org/resource/Pulau_Ubin> <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Singapore> }", "question": "Pulau Ubin \u00e9 a maior cidade de Cingapura?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1563", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/lieutenant> <http://dbpedia.org/resource/Timothy_L._Woodruff> } ", "question": "Sob o qual o presidente foi timothy l. Woodruff \u00e9 um tenente?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_0 <http://dbpedia.org/ontology/veneratedIn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism> .?u_0 <http://dbpedia.org/ontology/veneratedIn> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism> .?u_0 <http://dbpedia.org/ontology/veneratedIn> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_1 <http://dbpedia.org/ontology/veneratedIn> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism> .?u_1 <http://dbpedia.org/ontology/veneratedIn> ?u_0", "target_var": "?u_1"}], "id": "2015", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?uri <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> . ?uri <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>} ", "question": "Quantos foram venerados no Isl\u00e3 e no Juda\u00edsmo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1400", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Anthony_(artist)> <http://dbpedia.org/property/training> ?uri. <http://dbpedia.org/resource/Philip_W._Pillsbury> <http://dbpedia.org/property/education> ?uri} ", "question": "Qual centro de treinamento de William Anthony tamb\u00e9m tem ex-alunos chamado Philip W Pillsbury?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "712", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/65th_(2nd_Yorkshire,_North_Riding)_Regiment_of_Foot> <http://dbpedia.org/property/battleHonours> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }", "question": "Qual \u00e9 a maior cidade do pa\u00eds a quem foram concedidas as honras de batalha do 65\u00ba Regimento de P\u00e9?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2420", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/education> <http://dbpedia.org/resource/Everton_Park_State_High_School> . ?x <http://dbpedia.org/property/awards> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Que pr\u00eamios foram dados \u00e0s pessoas que estudaram no Everton Park State High?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "209", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/Discovery_Communications> . ?x <http://dbpedia.org/property/founder> ?uri  . }", "question": "Quem fundou as esta\u00e7\u00f5es irm\u00e3s da Discovery Communications?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "449", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Jim_Dooley> . ?x <http://dbpedia.org/property/starring> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmusementParkAttraction>}", "question": "Quem estrelou as atra\u00e7\u00f5es do parque de divers\u00f5es onde Jim Dooley estava se apresentando?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4091", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Plymouth,_Vermont> . ?uri <http://dbpedia.org/property/office> <http://dbpedia.org/resource/Massachusetts_House_of_Representatives>  . }", "question": "Quem tem seu lugar de descanso em Plymouth, Vermont e escrit\u00f3rio na C\u00e2mara dos Representantes de Massachusetts?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Pattie_Mallette>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Pattie_Mallette> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "2569", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Pattie_Mallette>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Diga o nome da pessoa cujo pai \u00e9 Pattie Mallette?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1820", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paul_Demi\u00e9ville> <http://dbpedia.org/property/fields> ?uri. <http://dbpedia.org/resource/Buddhist_Tai_Hung_College> <http://dbpedia.org/property/religion> ?uri} ", "question": "Que f\u00e9 do Buddhist Tai Hung College \u00e9 tamb\u00e9m o interesse acad\u00eamico de Paul Demiville?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "958", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/allegiance> <http://dbpedia.org/resource/Union_(American_Civil_War)> . ?x <http://dbpedia.org/property/office> ?uri  . }", "question": "Contar o n\u00famero de cargos ocupados por pessoas que s\u00e3o leais \u00e0 uni\u00e3o americana da guerra civil?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4786", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Continental_Army> . ?x <http://dbpedia.org/property/president> ?uri  . }", "question": "Para quantos presidentes diferentes as pessoas do Ex\u00e9rcito Continental serviram?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "654", "query": "ASK WHERE { <http://dbpedia.org/resource/Pixar> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar_Canada> }", "question": "A Pixar Canad\u00e1 \u00e9 uma subsidi\u00e1ria da Pixar?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2407", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes foram cinematografados por Jordan Cronenweth?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Skai_Group> <http://dbpedia.org/ontology/keyPerson> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stateOfOrigin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Skai_Group> <http://dbpedia.org/ontology/keyPerson> ?u_0 .?u_0 <http://dbpedia.org/ontology/stateOfOrigin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Skai_Group> <http://dbpedia.org/ontology/keyPerson> ?u_1", "target_var": "?u_1"}], "id": "3852", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Skai_Group> <http://dbpedia.org/ontology/keyPerson> ?x . ?x <http://dbpedia.org/ontology/stateOfOrigin> ?uri  . }", "question": "Qual \u00e9 o pa\u00eds de origem do presidente do grupo Skai?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1995", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Daewoo_Tico> . ?x <http://dbpedia.org/property/parentCompany> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Qual empresa produziu o carro que era uma nova vers\u00e3o do Tico da Daewoo?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/A_Grand_Day_Out> <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Grand_Day_Out> <http://dbpedia.org/ontology/writer> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Grand_Day_Out> <http://dbpedia.org/ontology/writer> ?u_1", "target_var": "?u_1"}], "id": "1760", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_Grand_Day_Out> <http://dbpedia.org/ontology/writer> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais s\u00e3o todos os pr\u00eamios ganhos pelo escritor de A Grand Day Out?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2354", "query": "ASK WHERE { <http://dbpedia.org/resource/Lyndon_Bridge> <http://dbpedia.org/property/design> <http://dbpedia.org/resource/Truss_bridge> }", "question": "A ponte Lyndon \u00e9 uma esp\u00e9cie de ponte Truss?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2741", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/developer> <http://dbpedia.org/resource/Brian_Graden>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual programa de TV \u00e9 criado por Brian Graden?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/The_Spirit_of_Christmas_(short_film)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/The_Spirit_of_Christmas_(short_film)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2617", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/The_Spirit_of_Christmas_(short_film)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o cujo trabalho anterior \u00e9 The Spirit of Christmas (curta-metragem)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "411", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/river> <http://dbpedia.org/resource/Awash_River> . ?x <http://dbpedia.org/property/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Dam>}", "question": "Em que pa\u00eds existe uma barragem no rio Awash?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/England> <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/residence> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/residence> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> .?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/England> <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> .?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}], "id": "1774", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }", "question": "Conte o total de religi\u00f5es seguidas pelas que vivem na Inglaterra."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3978", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/characters> <http://dbpedia.org/resource/Stella_Kowalski> . ?x <http://dbpedia.org/property/writer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Play>}", "question": "Quem escreveu a pe\u00e7a em que existe uma personagem chamada Stella Kowalski?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2186", "query": "ASK WHERE { <http://dbpedia.org/resource/Liliya_Lobanova> <http://dbpedia.org/property/birthplace> <http://dbpedia.org/resource/Ukraine> }", "question": "Liliya Lobanova nasceu na Ucr\u00e2nia?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2379", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/ITV_(Thailand)> <http://dbpedia.org/property/broadcastArea> ?uri } ", "question": "Nomeie a \u00e1rea de transmiss\u00e3o de ITV (Tail\u00e2ndia)?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hyundai_Lavita> <http://dbpedia.org/ontology/relatedMeanOfTransportation> <http://dbpedia.org/resource/Hyundai_Elantra>", "target_var": "?u_-1"}], "id": "3963", "query": "ASK WHERE { <http://dbpedia.org/resource/Hyundai_Lavita> <http://dbpedia.org/ontology/relatedMeanOfTransportation> <http://dbpedia.org/resource/Hyundai_Elantra> }", "question": "O hyundai elantra est\u00e1 relacionado ao hyundai lavita?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4311", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)> <http://dbpedia.org/property/firstAired> ?uri. <http://dbpedia.org/resource/Sergei_Ovchinnikov_(volleyball)> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Qual \u00e9 o pa\u00eds onde Sergei Ovchinnikov, o jogador de v\u00f4lei, morreu e Gumus foi ao ar pela primeira vez?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica>", "target_var": "?u_-1"}], "id": "4774", "query": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }", "question": "O s\u00e9rvio Titieca \u00e9 aluno de doutorado de Werner Heisenberghttp: //dbpedia.org/resource/Werner_Heisenberg"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3702", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kim_Sawchuk> <http://dbpedia.org/property/region> ?uri } ", "question": "Qual \u00e9 a regi\u00e3o de Kim Sawchuk?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3972", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liliya_Lobanova> <http://dbpedia.org/property/birthplace> ?uri } ", "question": "Onde Liliya Lobanova nasceu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4765", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/engine> <http://dbpedia.org/resource/V8_engine> . ?x <http://dbpedia.org/property/related> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Quais s\u00e3o alguns carros relacionados \u00e0queles com um V8?"}]