[{"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/employer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_0 <http://dbpedia.org/ontology/employer> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post> .?u_0 <http://dbpedia.org/ontology/employer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post> .?u_0 <http://dbpedia.org/ontology/employer> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/employer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_1 <http://dbpedia.org/ontology/employer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post> .?u_1 <http://dbpedia.org/ontology/employer> ?u_0", "target_var": "?u_1"}], "id": "3050", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> . ?uri <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/New_York_Post> . }", "question": "Quem trabalha na American Magazine e no New York Post?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4753", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?uri. <http://dbpedia.org/resource/McDonnell_Douglas> <http://dbpedia.org/property/successor> ?uri} ", "question": "Qual sucessor de McDonnell Douglas foi constru\u00eddo pelo Delta 3?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1836", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Native_Indonesians> <http://dbpedia.org/property/region> ?uri } ", "question": "Quais pa\u00edses compartilham uma heran\u00e7a sociocultural e \u00e9tnica semelhante \u00e0 dos indon\u00e9sios nativos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4242", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Men_Will_Be_Men> <http://dbpedia.org/ontology/starring> ?x . ?x <http://dbpedia.org/property/residence> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual \u00e9 a resid\u00eancia da pessoa que estrelou em Men Will Be Men?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Johnny_Cash>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Johnny_Cash> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "1019", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Johnny_Cash>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Que pessoas trabalham para Johnny Cash?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Goose_Lake_Valley> <http://dbpedia.org/ontology/state> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Lava_River_Cave> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Goose_Lake_Valley> <http://dbpedia.org/ontology/state> ?u_0 .<http://dbpedia.org/resource/Lava_River_Cave> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}], "id": "4133", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goose_Lake_Valley> <http://dbpedia.org/ontology/state> ?uri. <http://dbpedia.org/resource/Lava_River_Cave> <http://dbpedia.org/ontology/location> ?uri} ", "question": "Em que estado fica o Vale do Lago Ganso, que tamb\u00e9m faz parte da Caverna do Rio Lava?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_0 <http://dbpedia.org/ontology/location> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>", "target_var": "?u_1"}], "id": "1326", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Columbus_Crew_SC> . ?x <http://dbpedia.org/ontology/location> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FootballMatch>}", "question": "Onde aconteceram algumas partidas onde o Columbus Crew SC jogou?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Italy>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Italy> .?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Italy>", "target_var": "?u_1"}], "id": "475", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Italy> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quantos pr\u00eamios foram dados aos italianos?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4271", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/American_Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}", "question": "Contar o n\u00famero de cidades ao redor do Mar Mediterr\u00e2neo americano?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}], "id": "3998", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes sua m\u00fasica est\u00e1 inscrita na Sony Music Entertainment."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4467", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/David_King-Wood> <http://dbpedia.org/property/nationality> ?uri. <http://dbpedia.org/resource/John_Steed> <http://dbpedia.org/property/nationality> ?uri . }", "question": "Qual \u00e9 a nacionalidade de David King-Wood e John Steed?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2610", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cuja rede \u00e9 BBC HD?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2476", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Nandurbar> . ?x <http://dbpedia.org/ontology/party> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}", "question": "A que partido pertence o pol\u00edtico, que nasceu em Nandurbar?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2583", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Diga o nome das pessoas que estavam em um clube juvenil administrado por Luis Enrique?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Liverpool_Institute_High_School_for_Boys> <http://dbpedia.org/ontology/localAuthority> ?u_0", "target_var": "?u_0"}], "id": "1373", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_Institute_High_School_for_Boys> <http://dbpedia.org/ontology/localAuthority> ?uri } ", "question": "Qual \u00e9 a autoridade local do Liverpool Institute High School for Boys?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "739", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Manchester> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>}", "question": "Quais s\u00e3o os destinos da companhia a\u00e9rea com sede em Manchester?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3618", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Crystal_Harris>  . }", "question": "quem se casou com Crystal Harris?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "867", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Clamp_(manga_artists)> . ?x <http://dbpedia.org/ontology/voice> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Quem deu voz aos personagens esculpidos por Clamp?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1140", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/placeOfBurial> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Onde est\u00e3o os t\u00famulos de reis e rainhas que morreram na Inglaterra?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Temptress> <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Lloyd_Nosler>", "target_var": "?u_-1"}], "id": "997", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Temptress> <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Lloyd_Nosler> }", "question": "Lloyd Nosler \u00e9 o editor de The Temptress?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> .?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association>", "target_var": "?u_1"}], "id": "1337", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?uri <http://dbpedia.org/property/education> ?x  . }", "question": "Quem s\u00e3o as pessoas cujo ex-aluno faz parte da National Collegiate Athletic Association?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "541", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WTJC-LP> <http://dbpedia.org/property/format> ?uri } ", "question": "Sobre que assunto o WTJC-LP vai ao ar?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1099", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/April_Stewart> . ?uri <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Broadcast_syndication>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de televis\u00e3o cuja voz \u00e9 dada por April Stewart e seu distribuidor \u00e9 Broadcast syndication?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1132", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Martin_AN/FSG-1_Antiaircraft_Defense_System> . ?x <http://dbpedia.org/property/district> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Em que cidade fica o pr\u00e9dio, de quem faz parte o sistema antia\u00e9reo Martin AN / FSG1?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4064", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_House_Not_Meant_to_Stand> <http://dbpedia.org/property/writer> ?uri. <http://dbpedia.org/resource/Akale> <http://dbpedia.org/ontology/writer> ?uri} ", "question": "Quem escreveu Uma casa que n\u00e3o foi feita para ficar e Akale?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2715", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/managerclubs> <http://dbpedia.org/resource/England_national_under-20_football_team> . ?uri <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Middlesbrough_F.C.>  . }", "question": "Quem dirigiu a sele\u00e7\u00e3o inglesa de futebol sub-20 e o Middlesbrough FC?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2258", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Magic_Trackpad> <http://dbpedia.org/ontology/operatingSystem> ?x . ?x <http://dbpedia.org/property/developer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quem desenvolveu o software que \u00e9 usado como sistema operacional do Magic Trackpad?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4750", "query": "ASK WHERE { <http://dbpedia.org/resource/USS_Tillamook_(AT-16)> <http://dbpedia.org/property/shipBuilder> <http://dbpedia.org/resource/Seattle> }", "question": "O USS Tillamook foi constru\u00eddo em Seattle?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "59", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/company> <http://dbpedia.org/resource/FremantleMedia> . ?x <http://dbpedia.org/ontology/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quem produziu os programas de TV para a Fremantle Media?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1938", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dorchester_Bay_(Boston_Harbor)> <http://dbpedia.org/property/state> ?uri } ", "question": "Em que estado fica Dorchester Bay (Boston Harbor)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4936", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mickey's_Mellerdrammer> <http://dbpedia.org/property/cinematography> ?uri. <http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/property/animator> ?uri} ", "question": "Quem foi o diretor de fotografia de Mickey&#39;s Mellerdrammer e o animador de Tommy Tucker&#39;s Tooth?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1078", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Estadio_Nacional_de_Costa_Rica_(2011)> <http://dbpedia.org/ontology/builder> ?uri. <http://dbpedia.org/resource/Xianren_Cave> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Quem \u00e9 o construtor do Est\u00e1dio Nacional de Costa Rica e tamb\u00e9m a localiza\u00e7\u00e3o da Caverna Xianren?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3249", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Glover_(video_game)> <http://dbpedia.org/ontology/distributor> ?uri. <http://dbpedia.org/resource/Super_Mario_Adventures> <http://dbpedia.org/property/publisher> ?uri} ", "question": "Qual distribuidor do Glover (videogame) tamb\u00e9m \u00e9 o editor do Super Mario Adventures?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3127", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes Michael Deeley produziu?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2488", "query": "ASK WHERE { <http://dbpedia.org/resource/Vancouver_Whitecaps_FC> <http://dbpedia.org/property/chairman> <http://dbpedia.org/resource/Steve_Nash> }", "question": "Steve Nash \u00e9 o presidente do Vancouver Whitecaps FC?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "940", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Aarnoud_van_Heemstra>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quem \u00e9 um parente famoso de Aaround Van Heemstra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1080", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/race> <http://dbpedia.org/resource/Lawrence_Realization_Stakes> . ?x <http://dbpedia.org/ontology/honours> ?uri  . }", "question": "Que pr\u00eamios foram dados a quem correu nas Estacas de Realiza\u00e7\u00e3o de Lawrence?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "187", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/1st_Free_French_Division> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/property/battles> ?uri  . }", "question": "Quantas batalhas envolveram comandantes da 1\u00aa Divis\u00e3o Francesa Livre?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_0"}], "id": "2634", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>  . }", "question": "Quantas \u00e1reas s\u00e3o lideradas por Willem Alexander?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2085", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Vangelis> . ?uri <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Diga o nome do filme em que Vangelis deu a m\u00fasica e Jordan era o diretor de fotografia?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Canada>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Canada>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada> .?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Canada>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada> .?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}], "id": "2249", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Canada> . ?x <http://dbpedia.org/property/locations> ?uri  . }", "question": "Em quantos lugares est\u00e3o operando as empresas fundadas no Canad\u00e1?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/editing> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/editing> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "4890", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom> . ?uri <http://dbpedia.org/property/editing> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Contar o n\u00famero de filmes cujos editores nasceram no Reino Unido?"}]