[{"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Kenya>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProtectedArea>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Kenya> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProtectedArea>", "target_var": "?u_0"}], "id": "2886", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Kenya>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProtectedArea>}", "question": "Qual \u00e9 a \u00e1rea protegida cuja cidade mais pr\u00f3xima \u00e9 o Qu\u00eania?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1941", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/nearestCity> <http://dbpedia.org/resource/Wisconsin> . ?x <http://dbpedia.org/property/nearestCity> ?uri }", "question": "Contar a cidade mais pr\u00f3xima do pal\u00e1cio hist\u00f3rico, sendo uma das cidades mais pr\u00f3ximas de Wisconsin?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/commander> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> .?u_0 <http://dbpedia.org/property/commander> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)>", "target_var": "?u_0"}], "id": "100", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }", "question": "D\u00ea-me o n\u00famero total de comandantes dos conflitos militares cujo comandante \u00e9 Roundhead (Wyandot)."}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Elizabeth_II>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "2804", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Elizabeth_II>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Quantos lugares foram governados por Elizabeth II?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3570", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/fields> <http://dbpedia.org/resource/Chinese_poetry> . ?x <http://dbpedia.org/property/fields> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Liste o interesse dos cientistas cujo um dos campos \u00e9 a poesia chinesa?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3684", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/composer> <http://dbpedia.org/resource/John_Douglas_(conductor)> . ?x <http://dbpedia.org/property/narrated> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quem foi o narrador do show cuja m\u00fasica \u00e9 composta por John Douglas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3661", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hypnotize_Minds> <http://dbpedia.org/property/parent> ?uri. <http://dbpedia.org/resource/The_Producers_(2005_film)> <http://dbpedia.org/property/label> ?uri} ", "question": "Qual empresa de pais de hipnotizar Minds \u00e9 o r\u00f3tulo dos Producers, um filme de 2005?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}], "id": "1886", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Quem \u00e9 o personagem fict\u00edcio retratado em Terminator 2: Judgment Day?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "681", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Estes> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Dan_Shamash> <http://dbpedia.org/ontology/team> ?uri} ", "question": "Qual time de Dan Shamash tamb\u00e9m \u00e9 o time estreante de John Estes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3794", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/Detroit_Red_Wings> . ?x <http://dbpedia.org/ontology/residence> ?uri  . }", "question": "Onde moram os funcion\u00e1rios da Deroit Red Wings?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3944", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Klang_Valley> . ?x <http://dbpedia.org/property/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quais s\u00e3o alguns pa\u00edses onde operam as empresas sediadas no Vale do Klang?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chant\u00e9_mas> <http://dbpedia.org/ontology/stylisticOrigin> <http://dbpedia.org/resource/West_Africa>", "target_var": "?u_-1"}], "id": "4666", "query": "ASK WHERE { <http://dbpedia.org/resource/Chant\u00e9_mas> <http://dbpedia.org/ontology/stylisticOrigin> <http://dbpedia.org/resource/West_Africa> }", "question": "Chant Mas se originou na \u00c1frica Ocidental?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/class> <http://dbpedia.org/resource/Bacilli>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bacteria>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/class> <http://dbpedia.org/resource/Bacilli> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bacteria>", "target_var": "?u_0"}], "id": "1096", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/class> <http://dbpedia.org/resource/Bacilli>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bacteria>}", "question": "D\u00ea-me uma contagem de bact\u00e9rias que pertencem \u00e0 classe Bacilli?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "829", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/company> <http://dbpedia.org/resource/FremantleMedia> . ?x <http://dbpedia.org/ontology/producer> ?uri  . }", "question": "Quantos produtores trabalharam para as produ\u00e7\u00f5es da FremantleMedia?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2805", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Kate_Spade_&_Company>  . }", "question": "Quem est\u00e1 no conselho de administra\u00e7\u00e3o de Kate Spade e empresa?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3829", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/property/animator> ?uri. <http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?uri} ", "question": "Qual animador de Tooth de Tommy Ticker&#39;s tamb\u00e9m \u00e9 o diretor de The Haunted house?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4381", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?uri <http://dbpedia.org/property/chancellor> <http://dbpedia.org/resource/Nicholas_S._Zeppos>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Qual \u00e9 o nome da universidade cujo departamento atl\u00e9tico se chama National Collegiate Athletic Association e tem um chanceler chamado Nicholas S. Zeppos?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_0 .<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_0 .?u_1 <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_0 .?u_1 <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_0 .<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_0 .?u_1 <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_1 .<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_1 .?u_0 <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?u_0 .<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?u_1 .?u_0 <http://dbpedia.org/ontology/managerClub> ?u_1", "target_var": "?u_1"}], "id": "3891", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ivan_Toplak> <http://dbpedia.org/ontology/managerClub> ?uri. <http://dbpedia.org/resource/Bret_Simon> <http://dbpedia.org/ontology/managerClub> ?uri . }", "question": "Nomeie o clube de gest\u00e3o comum de Ivan Toplak e Bret Simon?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "764", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos shows s\u00e3o feitos por Larry David?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2767", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Martin_AN/GSG-5_Battery_Integration_and_Radar_Display_Equipment> . ?x <http://dbpedia.org/property/district> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Martin AN / GSG-5 faz parte do pr\u00e9dio em que cidade?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4328", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/Oakland_Athletics> . ?x <http://dbpedia.org/property/architect> ?uri  . }", "question": "Quantos arquitetos existem que fizeram algo usado pelo atletismo de Oakland?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Bomis> <http://dbpedia.org/ontology/foundedBy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Bomis> <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bomis> <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}], "id": "3295", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bomis> <http://dbpedia.org/ontology/foundedBy> ?x . ?x <http://dbpedia.org/ontology/board> ?uri  . }", "question": "Em que conselhos de administra\u00e7\u00e3o est\u00e1 o fundador da Bomis?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2194", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/PyChess> <http://dbpedia.org/property/genre> ?uri} ", "question": "De que g\u00eanero \u00e9 o PyChess, que emprega Craig Van Tilbury?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2357", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ethiopian_Parliament_Building> <http://dbpedia.org/property/locationCountry> ?uri } ", "question": "Onde est\u00e1 localizado o Edif\u00edcio do Parlamento Et\u00edope?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3425", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Tukwila,_Washington> . ?x <http://dbpedia.org/ontology/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Quais s\u00e3o as cidades ribeirinhas que tamb\u00e9m correm em Tukwila, Washington?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3979", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Downtown_Athletic_Club>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}", "question": "Qual pr\u00eamio \u00e9 concedido pelo Downtown Athletic Club?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "911", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Joseph_Clay_(Georgia)> <http://dbpedia.org/ontology/appointer> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri . }", "question": "Quem nomeou Joseph Clay e William Cushing para seus cargos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Dannielynn_Birkhead> <http://dbpedia.org/ontology/parent> ?u_0", "target_var": "?u_0"}], "id": "3145", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dannielynn_Birkhead> <http://dbpedia.org/ontology/parent> ?uri } ", "question": "Quem s\u00e3o os pais biol\u00f3gicos de Dannielynn Birkhead?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "999", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harriet_Andersson> <http://dbpedia.org/ontology/partner> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Liste os pr\u00eamios ganhos pela esposa de Harriet Andersson?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> .?u_1 <http://dbpedia.org/ontology/battle> ?u_0", "target_var": "?u_1"}], "id": "3653", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Gadsden> . ?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Fort_Barrancas> . }", "question": "Quem esteve envolvido nas guerras do Forte Gadsden e do Forte Barrancas?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}], "id": "2483", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> . ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> . }", "question": "Onde Solidus e Aureus s\u00e3o usados?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2370", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Levi_Lincoln,_Sr.> <http://dbpedia.org/property/successor> ?uri. <http://dbpedia.org/resource/William_Clark> <http://dbpedia.org/property/appointer> ?uri} ", "question": "Qual nomeado de William Clark \u00e9 o sucessor de Levi Lincoln Sr?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4838", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> } ", "question": "Qual divis\u00e3o da empresa \u00e9 a Audi \u00cdndia? Pergunta correta"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "33", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Cosmos_(Carl_Sagan_book)> . ?x <http://dbpedia.org/property/subject> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Sobre o que foi o livro que conduz ao Cosmos de Sagan?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_0 .?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_0 .?u_0 <http://dbpedia.org/ontology/nationality> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>", "target_var": "?u_1"}], "id": "3789", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Mayr> <http://dbpedia.org/ontology/deputy> ?x . ?x <http://dbpedia.org/ontology/nationality> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Chancellor>}", "question": "Qual \u00e9 a nacionalidade do chanceler que foi servido por Michael Mayr?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1020", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Helen_Getachew> <http://dbpedia.org/ontology/residence> ?uri. <http://dbpedia.org/resource/Haile_Selassie_Gugsa> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Qual \u00e9 a resid\u00eancia oficial de Helen Getachew, que tamb\u00e9m \u00e9 o local da morte do Haile Selassie Gugsa?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}], "id": "1647", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?uri } ", "question": "Quem construiu o motor Ford Y-block?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "733", "query": "ASK WHERE { <http://dbpedia.org/resource/Gibby_Haynes> <http://dbpedia.org/property/instrument> <http://dbpedia.org/resource/Saxophone> }", "question": "Gibby Haynes toca saxofone?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4582", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Orator> <http://dbpedia.org/property/museum> <http://dbpedia.org/resource/National_Archaeological_Museum_(Florence)> }", "question": "O orador est\u00e1 no Museu Nacional de Arqueologia de Floren\u00e7a?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3274", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lumberjack_100> <http://dbpedia.org/property/region> ?uri } ", "question": "Qual \u00e9 a regi\u00e3o do Lenhador?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1620", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Be\u015fikta\u015f_JK_(wheelchair_basketball)> <http://dbpedia.org/ontology/president> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "Onde o presidente estudou, quem \u00e9 o presidente do Besiktas JK?"}]