[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_0 .?u_0 <http://dbpedia.org/ontology/owningCompany> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owningCompany> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_0 .?u_1 <http://dbpedia.org/ontology/owningCompany> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_0 .?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_1 .?u_0 <http://dbpedia.org/ontology/owningCompany> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Roman_Abramovich> <http://dbpedia.org/ontology/occupation> ?u_1 .?u_1 <http://dbpedia.org/ontology/owningCompany> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_0"}], "id": "2146", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }", "question": "Diga o nome de todos que trabalham para uma empresa de Roman Abramovich."}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4975", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Apollo_11> . ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/NASA>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut>}", "question": "Quem astronauta da NASA estava na miss\u00e3o da Apollo 11?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "599", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_Ryan_(politician)> <http://dbpedia.org/ontology/nominee> ?uri. <http://dbpedia.org/resource/Omar_D._Conger> <http://dbpedia.org/property/order> ?uri} ", "question": "Qual \u00e9 a profiss\u00e3o de Oamr D Conger para a qual Jack Ryan tamb\u00e9m foi indicado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1434", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_G._Santos> <http://dbpedia.org/ontology/birthPlace> ?uri. <http://dbpedia.org/resource/Wendy_Jaquet> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Onde nasceram Micheal Santos e Wendy Jaquet?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4996", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/J._Michael_Straczynski> . ?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/TNT_(TV_channel)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Nomeie o programa formado por J. Michael Stroczynski e teve uma rede como TNT?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "538", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Adrian_A._Basora> . ?uri <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Alta_Mesa_Memorial_Park>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual local de descanso do titular do cargo \u00e9 o Parque Memorial Alta Mesa e tem Adrian A. Basora como sucessor?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "721", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Monty_Python> . ?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Geoffrey_Burgon>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Diga o nome do filme escrito por Monty Python e tem o compositor Geoffrey Burgon?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4410", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/builder> <http://dbpedia.org/resource/Charles_V,_Holy_Roman_Emperor> . ?uri <http://dbpedia.org/ontology/deathPlace> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quais pol\u00edticos morreram nas cidades constru\u00eddas pelo imperador romano Carlos 5?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Uncle_Henry_(Oz)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)> .?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)> .?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_0 .?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_0 .?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Uncle_Henry_(Oz)>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)> .?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)> .?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_1 .?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Uncle_Henry_(Oz)> <http://dbpedia.org/ontology/spouse> ?u_1 .?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_0"}], "id": "2845", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Uncle_Henry_(Oz)> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }", "question": "Quais s\u00e3o alguns parentes da esposa do tio Henry de Oz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2053", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/outflow> <http://dbpedia.org/resource/Benu\u00e9_River> . ?x <http://dbpedia.org/property/outflow> ?uri  . }", "question": "Liste as vaz\u00f5es do lago que tem o rio Benu como um deles?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_0 .<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_0 .?u_1 <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0 .?u_1 <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_0 .<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0 .?u_1 <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_1 .<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_1 .?u_0 <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?u_0 .<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?u_1 .?u_0 <http://dbpedia.org/ontology/parentCompany> ?u_1", "target_var": "?u_1"}], "id": "2254", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Air_Transport_Service> <http://dbpedia.org/ontology/parentCompany> ?uri. <http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?uri . }", "question": "O Ford Air Transport Service e o Falcon cobra pertencem a qual empresa?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3912", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Julian_Gingell> . ?uri <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Nomeie a sitcom com o compositor de m\u00fasica tema como Julian Gingell e o canal como Fox Broadcasting Company?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0 .<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0 .?u_1 <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_0 .?u_1 <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0 .<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_0 .?u_1 <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_1 .<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_1 .?u_0 <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0 .<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?u_1 .?u_0 <http://dbpedia.org/ontology/college> ?u_1", "target_var": "?u_1"}], "id": "2890", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?uri. <http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?uri . }", "question": "Em qual faculdade o Sr. Hubert Wiggs e o Sr. Alvin Bell frequentaram?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3673", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Blytheville_High_School> <http://dbpedia.org/property/mascot> ?uri } ", "question": "Qual \u00e9 o mascote da Blytheville High School?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Girl_from_the_North_Country> <http://dbpedia.org/ontology/composer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Moondog_Matinee>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Girl_from_the_North_Country> <http://dbpedia.org/ontology/composer> ?u_0 .<http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}], "id": "80", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Girl_from_the_North_Country> <http://dbpedia.org/ontology/composer> ?uri. <http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?uri} ", "question": "Qual compositor de Girl from the North Country \u00e9 a obra subsequente da Moondog Matinee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2561", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cosmos_(Carl_Sagan_book)> <http://dbpedia.org/ontology/previousWork> ?x . ?x <http://dbpedia.org/property/subject> ?uri  . }", "question": "Qual \u00e9 o assunto do livro que precedeu o Cosmos de Sagan?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1723", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/Eliza_Schneider>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Em quais programas de televis\u00e3o Eliza Schneider deu sua voz?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Catch_My_Soul_(UK_stage_version)> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_0"}], "id": "1617", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Catch_My_Soul_(UK_stage_version)> <http://dbpedia.org/ontology/author> ?uri } ", "question": "Quem escreveu Catch My soul?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1654", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/archipelago> <http://dbpedia.org/resource/The_Bahamas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>}", "question": "Quais s\u00e3o algumas ilhas nas bahamas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2328", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._Bennett_Johnston> <http://dbpedia.org/ontology/relation> ?x . ?x <http://dbpedia.org/property/state> ?uri  . }", "question": "Em que estado mora o embaixador que \u00e9 parente de J Bennett Johnston?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4613", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/debutteam> <http://dbpedia.org/resource/Homestead_Grays> . ?x <http://dbpedia.org/property/birthDate> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Onde nasceram os esportistas que come\u00e7aram suas carreiras com Homestead Greys?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "221", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pavel_Moroz> <http://dbpedia.org/property/hometown> ?uri. <http://dbpedia.org/resource/Helena_of_Moscow> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Qual cidade natal de pavel Moroz \u00e9 tamb\u00e9m o pal\u00e1cio do local de nascimento de Helena de Moscou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "93", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Simpsons_Ride> <http://dbpedia.org/property/starring> ?uri } ", "question": "Quem s\u00e3o os membros do elenco de The Simpsons Ride?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2609", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/IPhone_OS_1> <http://dbpedia.org/property/developer> ?uri. <http://dbpedia.org/resource/XNU> <http://dbpedia.org/ontology/developer> ?uri . }", "question": "Qual \u00e9 a organiza\u00e7\u00e3o que desenvolveu o iPhone OS e o XNU?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3382", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/French_people> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quantos pr\u00eamios receberam os franceses?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Bacteria> <http://dbpedia.org/property/domain> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria>", "target_var": "?u_1"}], "id": "4415", "query": " SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> } ", "question": "Quantas bact\u00e9rias t\u00eam taxonomia como Bacillales e dom\u00ednio como Bact\u00e9rias?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4686", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Smith_Griffin> <http://dbpedia.org/property/constituency> ?x . ?x <http://dbpedia.org/ontology/location> ?uri  . }", "question": "Onde est\u00e1 o eleitorado de John Smith Griffin?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Honeybuns> <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Wahoo!>", "target_var": "?u_-1"}], "id": "1292", "query": "ASK WHERE { <http://dbpedia.org/resource/Honeybuns> <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Wahoo!> }", "question": "Is Wahoo! os trabalhos anteriores de Honeybuns?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2164", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/property/animator> ?uri } ", "question": "Quem \u00e9 o animador de Tooth de Tommy Tucker&#39;s?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}], "id": "2939", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?uri } ", "question": "Quem \u00e9 o diretor de cinema de Alice&#39;s Wonderland?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3668", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Liste alguns autores cuja forma\u00e7\u00e3o ocorreu em S\u00e3o Petersburgo?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/influenced> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://dbpedia.org/ontology/influenced> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/influenced> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_0 .?u_1 <http://dbpedia.org/ontology/influenced> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_1 .?u_0 <http://dbpedia.org/ontology/influenced> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://dbpedia.org/ontology/influenced> ?u_0", "target_var": "?u_0"}], "id": "812", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Evenor_(collection)> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/influenced> ?uri  . }", "question": "Quem s\u00e3o as pessoas que influenciaram os escritores de Evenor?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1258", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/American_Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri. <http://dbpedia.org/resource/Entronque_de_Herradura> <http://dbpedia.org/property/nickname> ?uri} ", "question": "Quais cidades do Mar Mediterr\u00e2neo americano t\u00eam o apelido Entronque de Herradura?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House>", "target_var": "?u_1"}], "id": "889", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> . ?x <http://dbpedia.org/property/subject> ?uri  . }", "question": "Sobre quantos assuntos os editores da Random House publicaram livros?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1451", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Al_Bano_and_Romina_Power> <http://dbpedia.org/property/currentMembers> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }", "question": "Listar o artista musical associado dos atuais membros do Al Bano e Romina Power?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3316", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/neighboringMunicipalities> <http://dbpedia.org/resource/Cologny> . ?uri <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>}", "question": "Que munic\u00edpios vizinhos de assentamento s\u00e3o Cologny e Pregny-Chambsy?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2559", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Sandman_(Vertigo)> <http://dbpedia.org/property/writers> ?uri } ", "question": "Quem \u00e9 o escritor de The Sandman (Vertigo)?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2680", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/garrison> <http://dbpedia.org/resource/The_Pentagon> . ?uri <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_Defense>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "A guarni\u00e7\u00e3o de qual unidade militar \u00e9 o Pent\u00e1gono e a estrutura de comando \u00e9 o Departamento de Defesa dos Estados Unidos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4651", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_Christian_Turn'd_Turk> <http://dbpedia.org/property/subject> ?uri } ", "question": "Liste os assuntos principais de A Christian Turn&#39;d Turk?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4811", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/Wallace_and_Gromit> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Que pr\u00eamios foram dados aos escritores de Wallace e Gromit?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4679", "query": "ASK WHERE { <http://dbpedia.org/resource/Karl_Marx> <http://dbpedia.org/ontology/mainInterest> <http://dbpedia.org/resource/Labor_relations> }", "question": "As rela\u00e7\u00f5es de trabalho s\u00e3o o principal interesse de Karl Marx?"}]