[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "883", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingmar_Bergman> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Laemmle_Theatres> <http://dbpedia.org/ontology/service> ?uri} ", "question": "Que pr\u00eamios j\u00e1 foram atribu\u00eddos a Ingmar Bergman e empregaram o servi\u00e7o dos Teatros Laemmle?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hyundai_Lavita> <http://dbpedia.org/ontology/relatedMeanOfTransportation> <http://dbpedia.org/resource/Kia_Sportage>", "target_var": "?u_-1"}], "id": "2944", "query": "ASK WHERE { <http://dbpedia.org/resource/Hyundai_Lavita> <http://dbpedia.org/ontology/relatedMeanOfTransportation> <http://dbpedia.org/resource/Kia_Sportage> }", "question": "O Kia Sportage \u00e9 semelhante ao Hyundai Lavita?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Robert_William_Wilcox> <http://dbpedia.org/property/district> ?u_0", "target_var": "?u_0"}], "id": "1091", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_William_Wilcox> <http://dbpedia.org/property/district> ?uri } ", "question": "Qual \u00e9 o nome do distrito de Robert William Wilcox?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4783", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Hirokazu_Tanaka>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Quais s\u00e3o os videogames compostos por Hirokazu Tanaka?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "531", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Philip_Novak> <http://dbpedia.org/property/mainInterests> ?uri } ", "question": "Quais s\u00e3o os interesses acad\u00eamicos de Philip Novak?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers>", "target_var": "?u_0"}], "id": "4022", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> } ", "question": "A Tandem Computers \u00e9 subsidi\u00e1ria de qual empresa?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?u_0 .?u_0 <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parentMountainPeak> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parentMountainPeak> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?u_1 .?u_1 <http://dbpedia.org/ontology/mountainRange> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/mountainRange> ?u_1", "target_var": "?u_1"}], "id": "4421", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Malatraix> <http://dbpedia.org/ontology/parentMountainPeak> ?x . ?x <http://dbpedia.org/ontology/mountainRange> ?uri  . }", "question": "Diga o nome da cordilheira \u00e0 qual pertence o pico da montanha de Malatraix?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4098", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/OneDrive> . ?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Outlook.com> . }", "question": "Quem oferece os servi\u00e7os do OneDrive e Outlook.com?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1727", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Walter_Evans_Edge> <http://dbpedia.org/property/office> ?uri. <http://dbpedia.org/resource/Henry_Miller_Shreve> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Qual \u00e9 a localiza\u00e7\u00e3o do escrit\u00f3rio Walter Evans Edge, que tamb\u00e9m \u00e9 o local de nascimento de Henry Miller?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Peter_Thorneycroft> <http://dbpedia.org/ontology/primeMinister> ?u_0", "target_var": "?u_0"}], "id": "610", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Peter_Thorneycroft> <http://dbpedia.org/ontology/primeMinister> ?uri } ", "question": "Listar os primeiros-ministros de Peter Thorneycroft?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "570", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Runes_of_Magic> . ?x <http://dbpedia.org/ontology/division> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a divis\u00e3o das empresas que fazem Runes of Magic?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3718", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cujo diretor de fotografia \u00e9 Jordan Cronenweth?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3000", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Graham_Holdings_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Qual \u00e9 a universidade cuja afilia\u00e7\u00e3o \u00e9 Graham Holdings Company?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?u_0", "target_var": "?u_0"}], "id": "3139", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?uri } ", "question": "Qual \u00e9 a divis\u00e3o da sele\u00e7\u00e3o nacional de futebol americano da S\u00e9rvia?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "434", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quantas empresas est\u00e3o localizadas em Toronto?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1903", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Quinn_Ojinnaka> <http://dbpedia.org/property/billed> ?uri } ", "question": "De onde Quinn Ojinnaka \u00e9 cobrado?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Westwood,_Los_Angeles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/editing> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Westwood,_Los_Angeles> .?u_1 <http://dbpedia.org/ontology/editing> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Westwood,_Los_Angeles>", "target_var": "?u_1"}], "id": "3804", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Westwood,_Los_Angeles> . ?uri <http://dbpedia.org/ontology/editing> ?x  . }", "question": "Quais s\u00e3o os filmes cujo editor morreu em Westwood, Los Angeles?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}], "id": "4776", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quais s\u00e3o os softwares que usam plataformas como arquitetura ARM?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2069", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bruce_Timm> . ?uri <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Paul_Dini>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>}", "question": "Quais s\u00e3o os personagens de quadrinhos pintados por Bruce Timm e criados por Paul Dini?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1537", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jerry_Tagge> <http://dbpedia.org/property/highSchool> ?uri } ", "question": "Onde Jerry Tagge fez sua educa\u00e7\u00e3o prim\u00e1ria?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}], "id": "2252", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/A_Goon's_Deed_in_a_Weary_World> . ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/CBS> . }", "question": "Quem trabalhou em A Goon&#39;s Deed in a Weary World e na CBS?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2346", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Ministry_of_Internal_Affairs_(Ukraine)> . ?x <http://dbpedia.org/property/allegiance> ?uri  . }", "question": "Em que pa\u00edses os membros do minist\u00e9rio ucraniano de assuntos internos prestaram juramento?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Brower's_Spring>", "target_var": "?u_0"}], "id": "1517", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Brower's_Spring> } ", "question": "Quais rios come\u00e7am na primavera de Brower?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "965", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Bernard_Herrmann> . ?uri <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Orson_Welles>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Em quais filmes dirigidos por Orson Welles Bernard Herrmann tem como compositor musical?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Presidio_Santa_Cruz_de_Terrenate> <http://dbpedia.org/ontology/builder> ?u_0", "target_var": "?u_0"}], "id": "4406", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Presidio_Santa_Cruz_de_Terrenate> <http://dbpedia.org/ontology/builder> ?uri } ", "question": "Quem \u00e9 o construtor do Pres\u00eddio Santa Cruz de Terrenate?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_0 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?u_1 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}], "id": "176", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Qual \u00e9 a maior cidade do pa\u00eds onde nasce o rio San Marcos?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Nick_Clegg> <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/David_Cameron>", "target_var": "?u_-1"}], "id": "3482", "query": "ASK WHERE { <http://dbpedia.org/resource/Nick_Clegg> <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/David_Cameron> }", "question": "David Cameron \u00e9 o primeiro-ministro de Nick Clegg?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2543", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/Harriman,_New_York>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Qual m\u00fasico nasceu em Harriman, NY?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "572", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ramiro_Pe\u00f1a> <http://dbpedia.org/ontology/team> ?uri. <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri . }", "question": "Quais times em comum Ramiro Pea e Bruce Bochy compartilham?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2299", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Air_2000> <http://dbpedia.org/property/destinations> ?uri. <http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/property/destinations> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Continent>}", "question": "Em que continente operam as companhias a\u00e9reas Air 2000 e Novair International?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Comedy_Central>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "3508", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Comedy_Central>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos programas s\u00e3o exibidos no Comedy Central?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3609", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingmar_Bergman> <http://dbpedia.org/property/awards> ?uri } ", "question": "Quais pr\u00eamios Ingmar Bergman ganhou?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_1 .?u_1 <http://dbpedia.org/ontology/product> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/product> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_1 .?u_1 <http://dbpedia.org/ontology/product> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_0 .?u_0 <http://dbpedia.org/ontology/product> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/product> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?u_0 .?u_0 <http://dbpedia.org/ontology/product> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_1"}], "id": "4554", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robot_Wars:_Metal_Mayhem> <http://dbpedia.org/ontology/publisher> ?x . ?x <http://dbpedia.org/ontology/product> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quais s\u00e3o os produtos da empresa que publicou Robot Wars: Metal Mayhem?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Colemanville_Covered_Bridge> <http://dbpedia.org/ontology/state> ?u_0", "target_var": "?u_0"}], "id": "2208", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Colemanville_Covered_Bridge> <http://dbpedia.org/ontology/state> ?uri } ", "question": "Em que estado est\u00e1 localizada a Ponte Coberta de Colemanville?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4720", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Teriitaria_II> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . }", "question": "Onde morreu a companheira de Teriitaria II?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2755", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/licensee> <http://dbpedia.org/resource/Incorporation_(business)> . ?x <http://dbpedia.org/property/licensee> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionStation>}", "question": "Qual \u00e9 o licenciado da esta\u00e7\u00e3o de TV cujo um dos licenciados \u00e9 Incorporation?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "383", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Theatre> <http://dbpedia.org/property/company> ?uri } ", "question": "Qual \u00e9 a empresa do Ford Theatre?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "852", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Sturm_College_of_Law> . ?x <http://dbpedia.org/property/restingplace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Senator>}", "question": "Para todos os senadores que j\u00e1 estudaram no Sturm College of Law, d\u00ea seu local de sepultamento?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1880", "query": "ASK WHERE { <http://dbpedia.org/resource/Jim_Kiick> <http://dbpedia.org/property/highSchool> <http://dbpedia.org/resource/New_Jersey> }", "question": "Jim Kiick fez o ensino m\u00e9dio em Nova Jersey?"}]