[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .?u_1 <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1 .<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1 .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0 .<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_1 .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}], "id": "2903", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?uri. <http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?uri . }", "question": "Qual empresa desenvolveu o Dart e o Go?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "447", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Philippe_Tesni\u00e8re> <http://dbpedia.org/property/placeOfDeath> ?uri. <http://dbpedia.org/resource/Judson_Huss> <http://dbpedia.org/property/placeOfDeath> ?uri . }", "question": "Em que pa\u00eds Philippe tesnire e judson huss morreram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3834", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Stephen_Kozmeniuk> . ?x <http://dbpedia.org/property/artist> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Liste todos os artistas dos \u00e1lbuns produzidos por Stephen Kozmeniuk?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Lena_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Olyokma_River>", "target_var": "?u_-1"}], "id": "3758", "query": "ASK WHERE { <http://dbpedia.org/resource/Lena_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Olyokma_River> }", "question": "O rio Olyokma \u00e9 o afluente direito do rio Lena?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3703", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/honours> <http://dbpedia.org/resource/Grand_National> . ?x <http://dbpedia.org/ontology/colour> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RaceHorse>}", "question": "Quais cavalos de corrida coloridos ganharam o Grand National?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Virtual_Kasparov> <http://dbpedia.org/ontology/genre> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fr._Agnel_Multipurpose_School_and_Junior_College> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Virtual_Kasparov> <http://dbpedia.org/ontology/genre> ?u_0 .<http://dbpedia.org/resource/Fr._Agnel_Multipurpose_School_and_Junior_College> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "359", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Virtual_Kasparov> <http://dbpedia.org/ontology/genre> ?uri. <http://dbpedia.org/resource/Fr._Agnel_Multipurpose_School_and_Junior_College> <http://dbpedia.org/ontology/sport> ?uri} ", "question": "O que h\u00e1 de comum entre os esportes praticados na Fr Agnel School e Jr College, e o g\u00eanero Virtual Kasparov?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2064", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures> . ?x <http://dbpedia.org/ontology/notableWork> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quais s\u00e3o as outras obras famosas do escritor que criou as aventuras de Sarah Jane?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4449", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Deborah_Crombie> <http://dbpedia.org/ontology/almaMater> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }", "question": "Qual \u00e9 o mascote da alma mater de Deborah Crombie?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3810", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Mudbloods> <http://dbpedia.org/property/genre> ?x . ?x <http://dbpedia.org/ontology/stylisticOrigin> ?uri  . }", "question": "De onde se originaram os g\u00eaneros que podem ser encontrados em The Mudbloods?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1690", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/James_W._Hyatt> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual \u00e9 o lugar de descanso da pessoa que \u00e9 o sucessor de James W. Hyatt?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4326", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Masahiko_Minami> . ?x <http://dbpedia.org/ontology/author> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Manga>}", "question": "Quem escreveu os mang\u00e1s produzidos por Masahike Minami?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Microsoft_Office_Picture_Manager> <http://dbpedia.org/ontology/license> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Google_Cloud_Connect> <http://dbpedia.org/ontology/computingPlatform> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Microsoft_Office_Picture_Manager> <http://dbpedia.org/ontology/license> ?u_0 .<http://dbpedia.org/resource/Google_Cloud_Connect> <http://dbpedia.org/ontology/computingPlatform> ?u_0", "target_var": "?u_0"}], "id": "1548", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Microsoft_Office_Picture_Manager> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/Google_Cloud_Connect> <http://dbpedia.org/ontology/computingPlatform> ?uri} ", "question": "Qual provedor de licen\u00e7a contnet do Microsoft Office Picture Manager tamb\u00e9m \u00e9 a plataforma de jogos do Google Clud Connect?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1247", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/garrison> <http://dbpedia.org/resource/Quezon_City> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "Qual \u00e9 o mascote dos militares na cidade de Quezon?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ja,_vi_elsker_dette_landet>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ja,_vi_elsker_dette_landet> .?u_1 <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ja,_vi_elsker_dette_landet>", "target_var": "?u_1"}], "id": "1985", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ja,_vi_elsker_dette_landet> . ?uri <http://dbpedia.org/ontology/country> ?x  . }", "question": "O que todos est\u00e3o nos estados cujo hino \u00e9 Ja, vi esker dette landet?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}], "id": "294", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Siege_of_Fort_Recovery>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quais oficiais lutaram na guerra de Siege of Fort Recovery?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Basketball_Association>", "target_var": "?u_0"}], "id": "2012", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/league> <http://dbpedia.org/resource/National_Basketball_Association> } ", "question": "retornar alguns jogadores que jogaram na NBA?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3329", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/Montpelier_(Orange,_Virginia)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "D\u00ea-me todos os titulares de cargos que finalmente se aposentaram em Montpelier, Orange, Virgina?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/knownFor> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>", "target_var": "?u_1"}], "id": "2403", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee> . ?uri <http://dbpedia.org/property/knownFor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Diga-me um cientista conhecido pela guarni\u00e7\u00e3o do Tennessee?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2129", "query": "ASK WHERE { <http://dbpedia.org/resource/Ronaldinho> <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Brazil_national_under-23_football_team> }", "question": "Ronaldinho joga na sele\u00e7\u00e3o brasileira de sub-23?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2410", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fabio_Mercurio> <http://dbpedia.org/property/institution> ?x . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bank>}", "question": "Quem \u00e9 o dono do banco onde Fabio Mercurio trabalha?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_0"}], "id": "425", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>  . }", "question": "Quais s\u00e3o alguns personagens fict\u00edcios cuja voz est\u00e1 no filme amendoim?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2582", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mahbuba_Islam_Rakhi> <http://dbpedia.org/ontology/nationality> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Que religi\u00e3o as pessoas do pa\u00eds de Mahbuba Islam Rakhi seguem?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Toronto_Argonauts>", "target_var": "?u_0"}], "id": "1054", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Toronto_Argonauts>  . }", "question": "Quantas pessoas costumavam jogar pelo Toronto Argonauts?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Indian_Standard_Time>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Indian_Standard_Time> .?u_0 <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Indian_Standard_Time>", "target_var": "?u_1"}], "id": "3966", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Indian_Standard_Time> . ?x <http://dbpedia.org/ontology/leaderName> ?uri  . }", "question": "Quantas pessoas diferentes ocuparam qualquer assento pol\u00edtico em lugares que est\u00e3o dentro do fuso hor\u00e1rio padr\u00e3o indiano?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3938", "query": "ASK WHERE { <http://dbpedia.org/resource/Karl_Marx> <http://dbpedia.org/ontology/mainInterest> <http://dbpedia.org/resource/Class_conflict> }", "question": "O conflito de classes era um interesse de Karl Marx?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4712", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }", "question": "Conte os inquilinos dos est\u00e1dios de toronto."}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2469", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Clinton_family> . ?uri <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Winston_Bryant>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}", "question": "Diga o nome do presidente que tem rela\u00e7\u00f5es com a fam\u00edlia Clinton e tinha um tenente chamado Winston Bryant?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4710", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/animator> <http://dbpedia.org/resource/Dick_Lundy_(animator)> . ?uri <http://dbpedia.org/ontology/voice> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Qual \u00e9 o personagem fict\u00edcio cuja narra\u00e7\u00e3o \u00e9 feita pelo animador de Dick Lundy?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> .?u_1 <http://dbpedia.org/ontology/sport> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>", "target_var": "?u_1"}], "id": "355", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/president> <http://dbpedia.org/resource/Emanuel_de_Guzman> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sport>}", "question": "Quantos esportes s\u00e3o praticados nas organiza\u00e7\u00f5es presididas por Emanuel de Guzman?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Leonid_Fedun>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Leonid_Fedun> .?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Leonid_Fedun>", "target_var": "?u_1"}], "id": "1193", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Leonid_Fedun> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }", "question": "Quais s\u00e3o os est\u00e1dios das coisas de que Leonid Fedun foi presidente?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1716", "query": "ASK WHERE { <http://dbpedia.org/resource/Ghana> <http://dbpedia.org/property/languages> <http://dbpedia.org/resource/Akan_language> }", "question": "O Akan \u00e9 falado em Gana?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3416", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/English_Americans> <http://dbpedia.org/property/region> ?uri. <http://dbpedia.org/resource/Brent_Darby> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Qual regi\u00e3o do English American tamb\u00e9m \u00e9 o lugar da Death of Brent Darby?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2604", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Colin_Brake> . ?x <http://dbpedia.org/property/starring> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>}", "question": "Quem atuou na obra de Colin Brake?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Oh!_Darling> <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Robin_Gibb>", "target_var": "?u_-1"}], "id": "4129", "query": "ASK WHERE { <http://dbpedia.org/resource/Oh!_Darling> <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Robin_Gibb> }", "question": "Robin Gibb \u00e9 o cantor do Oh! Querida?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2828", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/EXperimental_Computing_Facility> . ?uri <http://dbpedia.org/property/programmingLanguage> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>}", "question": "Listar tudo o que est\u00e1 escrito em linguagens desenvolvidas pela EXperimental Computing Facility?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1704", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Bodhi_Elfman> . ?uri <http://dbpedia.org/property/music> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o alguns filmes cuja trilha sonora \u00e9 composta por parentes de Bodhi Elfman?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chiva_bus> <http://dbpedia.org/ontology/automobilePlatform> <http://dbpedia.org/resource/Ford_Motor_Company>", "target_var": "?u_-1"}], "id": "2863", "query": "ASK WHERE { <http://dbpedia.org/resource/Chiva_bus> <http://dbpedia.org/ontology/automobilePlatform> <http://dbpedia.org/resource/Ford_Motor_Company> }", "question": "O \u00f4nibus Chiva \u00e9 da Ford Motor Company?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?u_0 .<http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}], "id": "2400", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?uri. <http://dbpedia.org/resource/Hubert_Wiggs> <http://dbpedia.org/ontology/college> ?uri} ", "question": "Qual \u00e9 a universidade comum de Commodores vanderbilt e tamb\u00e9m a faculdade de Hubert Wiggs?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/DisneyToon_Studios> <http://dbpedia.org/ontology/keyPerson> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/DisneyToon_Studios> <http://dbpedia.org/ontology/keyPerson> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/DisneyToon_Studios> <http://dbpedia.org/ontology/keyPerson> ?u_1", "target_var": "?u_1"}], "id": "3239", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/DisneyToon_Studios> <http://dbpedia.org/ontology/keyPerson> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios concedidos aos principais membros do DisneyToon Studios?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Metaphysics>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/mainInterests> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/mainInterests> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Metaphysics> .?u_0 <http://dbpedia.org/property/mainInterests> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Metaphysics>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Metaphysics> .?u_1 <http://dbpedia.org/property/mainInterests> ?u_0", "target_var": "?u_0"}], "id": "3218", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Metaphysics> . ?x <http://dbpedia.org/property/mainInterests> ?uri }", "question": "D\u00ea-me a contagem dos interesses do fil\u00f3sofo cujo principal interesse \u00e9 a Metaf\u00edsica?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3935", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Benedict_Arnold's_expedition_to_Quebec> . ?uri <http://dbpedia.org/property/placeofburial> <http://dbpedia.org/resource/St_Mary's_Church,_Battersea>  . }", "question": "Quem foi enterrado na Igreja de Santa Maria e lutou na batalha da expedi\u00e7\u00e3o de Benedict Arnold a Quebec?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}], "id": "1285", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?uri } ", "question": "Sobre quais assuntos o autor do romance Thud! mergulhar?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4894", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/William_W._Brien> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }", "question": "Diga o nome das pessoas que vivem em um local governado por William W Brien?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "2087", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Gold_Medal_of_the_Royal_Astronomical_Society>  . }", "question": "Quantas pessoas ganharam a medalha de ouro da Royal Astronomical Society?"}]