[{"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/RENFE_Class_333> <http://dbpedia.org/ontology/designer> ?u_0", "target_var": "?u_0"}], "id": "772", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/RENFE_Class_333> <http://dbpedia.org/ontology/designer> ?uri } ", "question": "Por quais empresas o RENFE Classe 333 foi projetado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1284", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WGBC_(DT2)> <http://dbpedia.org/property/sisterStations> ?x . ?x <http://dbpedia.org/ontology/formerBroadcastNetwork> ?uri  . }", "question": "Quais s\u00e3o as redes de transmiss\u00e3o anteriores de canais irm\u00e3os do WGBC?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4603", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Orson_Welles>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cujo diretor \u00e9 Orson Welles?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Janice_Soprano> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}], "id": "4794", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Janice_Soprano> <http://dbpedia.org/ontology/religion> ?uri } ", "question": "Qual \u00e9 a religi\u00e3o da personagem Janice Soprano do programa de televis\u00e3o The Soprano?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/discoverer> <http://dbpedia.org/resource/Urbain_Le_Verrier>", "target_var": "?u_0"}], "id": "1414", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/discoverer> <http://dbpedia.org/resource/Urbain_Le_Verrier> } ", "question": "qual planeta foi descoberto por Urbain Le Verrier?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1234", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } ", "question": "? Quais s\u00e3o os hubs de companhias a\u00e9reas da Cascade Airways"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2699", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charlie_Mensuel> <http://dbpedia.org/property/editor> ?x . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . }", "question": "Onde morreu o editor de Charlie Mensuel?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "435", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mike_Salmon> <http://dbpedia.org/property/currentclub> ?x . ?x <http://dbpedia.org/property/chairman> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>}", "question": "Qual \u00e9 o presidente do clube de futebol pelo qual Mike Salmon joga atualmente?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Harris_County,_Texas>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Harris_County,_Texas> .?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Harris_County,_Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Harris_County,_Texas> .?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "1674", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Harris_County,_Texas> . ?uri <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual empresa com sede no Condado de Harris \u00e9 subsidi\u00e1ria da Tandem Computers?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "365", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frontaccounting> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/NUbuntu> <http://dbpedia.org/ontology/license> ?uri . }", "question": "Qual \u00e9 a licen\u00e7a comum do Frontaccounting e do nUbuntu?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Eric_Schiller> <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eric_Schiller> <http://dbpedia.org/ontology/knownFor> ?u_0 .<http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}], "id": "2649", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eric_Schiller> <http://dbpedia.org/ontology/knownFor> ?uri. <http://dbpedia.org/resource/Craig_Van_Tilbury> <http://dbpedia.org/ontology/occupation> ?uri} ", "question": "Por qual esporte Eric Schiller \u00e9 conhecido e emprega Craig Van Tibury?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Box_girder_bridge> <http://dbpedia.org/property/design> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/crosses> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Box_girder_bridge> <http://dbpedia.org/property/design> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/crosses> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Box_girder_bridge> <http://dbpedia.org/property/design> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Box_girder_bridge> <http://dbpedia.org/property/design> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}], "id": "231", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/design> <http://dbpedia.org/resource/Box_girder_bridge> . ?x <http://dbpedia.org/property/crosses> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Quantos rios s\u00e3o atravessados por diferentes pontes de viga de caixa?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4267", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/writer> <http://dbpedia.org/resource/Monty_Python> . ?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Cinema_International_Corporation>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Qual filme de Monty Python \u00e9 distribu\u00eddo pela Cinema International Corporation?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4041", "query": "ASK WHERE { <http://dbpedia.org/resource/Outlawz> <http://dbpedia.org/property/pastMembers> <http://dbpedia.org/resource/Tupac_Shakur> }", "question": "Tupac era membro do Outlawz?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4399", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/membership> <http://dbpedia.org/resource/Austria> . ?x <http://dbpedia.org/property/membership> ?uri }", "question": "Contar o n\u00famero de membros da organiza\u00e7\u00e3o que t\u00eam a \u00c1ustria como um dos membros?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "407", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/currentMember> <http://dbpedia.org/resource/Jason_Hayne> . ?x <http://dbpedia.org/property/name> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OrganisationMember>}", "question": "Liste os outros membros da equipe onde Jason Hayne joga atualmente?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2090", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Susan_Weber_Soros>  . }", "question": "Quem \u00e9 casado com Susan Weber Soros?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "86", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Rosemarie_DeWitt> . ?x <http://dbpedia.org/property/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "lista o produtor dos filmes em que Rosemarie DeWitt no elenco de estrelas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "844", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arunachal_Pradesh_Legislative_Assembly_election,_2014> <http://dbpedia.org/property/party> ?uri. <http://dbpedia.org/resource/Rishikesh> <http://dbpedia.org/ontology/leaderName> ?uri} ", "question": "Qual partido pol\u00edtico das elei\u00e7\u00f5es para a Assembleia Legislativa de Arunachal Pradesh de 2014 foi o l\u00edder de Rishikesh?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1031", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Richard_Taylor_(colonel)> <http://dbpedia.org/property/battles> ?x . ?x <http://dbpedia.org/property/combatant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Quantos grupos lutaram em guerras onde Richard Taylor tamb\u00e9m lutou?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Another_Lonely_Night_in_New_York> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Robin_Gibb>", "target_var": "?u_-1"}], "id": "2855", "query": "ASK WHERE { <http://dbpedia.org/resource/Another_Lonely_Night_in_New_York> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Robin_Gibb> }", "question": "Is Another Lonely Night in New York da banda musical Robin Gibb?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4109", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elliott_Bay> <http://dbpedia.org/property/cities> ?uri } ", "question": "A qual povoado pertence Elliot Bay?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4396", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Tangerine_Dream> . ?uri <http://dbpedia.org/property/artist> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Quais s\u00e3o os \u00e1lbuns cujos artistas se apresentaram com o Tangerine Dream?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Batoka_Gorge_Hydroelectric_Power_Station> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}], "id": "3893", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Batoka_Gorge_Hydroelectric_Power_Station> <http://dbpedia.org/ontology/river> ?uri } ", "question": "Qual \u00e9 o nome do rio na Usina Hidrel\u00e9trica Batoka Gorge?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2658", "query": "ASK WHERE { <http://dbpedia.org/resource/Batman_Returns> <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Chris_Lebenzon> }", "question": "Chris Lebenzon editou os retornos do Batman?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "855", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Dragons'_Den_(UK_TV_series)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quais pessoas s\u00e3o conhecidas por aparecerem no programa de televis\u00e3o Dragon&#39;s Den?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Indiana>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Indiana> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>", "target_var": "?u_0"}], "id": "78", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Indiana>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Quais campi universit\u00e1rios est\u00e3o situados em Indiana?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Maine_School_of_Science_and_Mathematics> <http://dbpedia.org/ontology/authority> ?u_0", "target_var": "?u_0"}], "id": "2247", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Maine_School_of_Science_and_Mathematics> <http://dbpedia.org/ontology/authority> ?uri } ", "question": "Quem \u00e9 a autoridade da Escola de Ci\u00eancias e Matem\u00e1tica do Maine?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "4151", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/ITV_(TV_network)>  . }", "question": "O ITV emprega quantas pessoas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3378", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Joe_Hahn> . ?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Chester_Bennington> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Que banda tem Joe Hahn e Chester Bennington?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Tofa\u015f_\u015eahin> <http://dbpedia.org/ontology/assembly> <http://dbpedia.org/resource/Ethiopia>", "target_var": "?u_-1"}], "id": "2279", "query": "ASK WHERE { <http://dbpedia.org/resource/Tofa\u015f_\u015eahin> <http://dbpedia.org/ontology/assembly> <http://dbpedia.org/resource/Ethiopia> }", "question": "\u00c9 a montagem de tofa ahin ethopia?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2598", "query": "ASK WHERE { <http://dbpedia.org/resource/Street_Dogs_of_South_Central> <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Queen_Latifah> }", "question": "Os c\u00e3es de rua do centro-sul foram narrados pela Rainha Latifah?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_1 <http://dbpedia.org/property/subject> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> .?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}], "id": "3870", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Carl_Sagan> . ?x <http://dbpedia.org/property/subject> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Sobre o que Carl Sagan escreveu seus livros?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3428", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mateusz_Morawiecki> <http://dbpedia.org/property/almaMater> ?x . ?x <http://dbpedia.org/property/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Em que estado fica a universidade que \u00e9 a alma mater de Mateusz Morawiecki?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/voice> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_0 <http://dbpedia.org/ontology/voice> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> .?u_0 <http://dbpedia.org/ontology/voice> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> .?u_0 <http://dbpedia.org/ontology/voice> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/voice> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> .?u_1 <http://dbpedia.org/ontology/voice> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> .?u_0 <http://dbpedia.org/ontology/voice> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> .?u_1 <http://dbpedia.org/ontology/voice> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> .?u_1 <http://dbpedia.org/ontology/voice> ?u_0", "target_var": "?u_1"}], "id": "2176", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/Peanuts_Motion_Comics> . ?uri <http://dbpedia.org/ontology/voice> <http://dbpedia.org/resource/The_Peanuts_Movie> . }", "question": "Quem fez a voz em Peanuts Motion Comics e no filme Peanuts?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "424", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Secunda> <http://dbpedia.org/ontology/occupation> ?x . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bank>}", "question": "Quem \u00e9 o dono do banco onde trabalha Thomas Secunda?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nationality> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/nationality> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/ontology/nationality> ?u_0", "target_var": "?u_1"}], "id": "392", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }", "question": "Pelo que alguns cidad\u00e3os americanos s\u00e3o famosos?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Mid_Wales>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Mid_Wales> .?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Mid_Wales>", "target_var": "?u_1"}], "id": "4726", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Mid_Wales> . ?x <http://dbpedia.org/ontology/foundedBy> ?uri  . }", "question": "Quem fundou uma empresa que atendia a Mid Wales?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3693", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_Kingdom> . ?uri <http://dbpedia.org/property/editing> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Os brit\u00e2nicos editaram quais filmes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "104", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Myntdu_River> <http://dbpedia.org/ontology/origin> ?x . ?x <http://dbpedia.org/ontology/leaderName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Town>}", "question": "Quem \u00e9 o l\u00edder da cidade onde o rio Myntdu nasce?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3994", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Alive_Naturalsound_Records> . ?x <http://dbpedia.org/ontology/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Liste a cidade natal das bandas cujo selo \u00e9 Alive Naturalsound Records?"}]