[{"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2628", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Saint_Petersburg> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }", "question": "Por quantas coisas as pessoas que morreram em S\u00e3o Petersburgo s\u00e3o conhecidas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "819", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Elders_(organization)> <http://dbpedia.org/property/keyPeople> ?uri } ", "question": "Fa\u00e7a uma lista das pessoas importantes dos Elders?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1403", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Douglas_Netter> . ?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Stewart_Copeland>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "O produtor executivo de qual programa de TV \u00e9 Douglas Netter e composto por Stewart Copeland?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1382", "query": "ASK WHERE { <http://dbpedia.org/resource/Nintendo> <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Nintendo_Entertainment_Planning_&_Development> }", "question": "A Nintendo tem uma divis\u00e3o chamada Nintendo Entertainment Planning &amp; Development?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2148", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Pittsburg,_New_Hampshire> . ?uri <http://dbpedia.org/ontology/source> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Nomeie os rios que se originam de Pittsburg?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/country> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/country> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> .?u_0 <http://dbpedia.org/property/country> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/country> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/country> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> .?u_1 <http://dbpedia.org/property/country> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/country> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/country> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}], "id": "1575", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Coconut> . ?x <http://dbpedia.org/property/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Em quantas na\u00e7\u00f5es o coco \u00e9 um ingrediente alimentar comum?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1638", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sourceRegion> <http://dbpedia.org/resource/Greater_London> . ?x <http://dbpedia.org/property/mouthLocation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Para onde des\u00e1guam os rios da grande Londres?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4815", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Cookie> . ?x <http://dbpedia.org/property/creator> ?uri  . }", "question": "Quem criou novos tipos de cookies?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "882", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/school> <http://dbpedia.org/resource/Balgowan,_KwaZulu-Natal> . ?x <http://dbpedia.org/property/school> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Listar as escolas do atleta com Balgowan como uma das escolas?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Nebraska>", "target_var": "?u_0"}], "id": "2897", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Nebraska> . ?x <http://dbpedia.org/ontology/knownFor> ?uri  . }", "question": "Por quantas coisas as pessoas que nasceram em Nebraska s\u00e3o famosas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Pandaruan_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0", "target_var": "?u_0"}], "id": "1352", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pandaruan_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?uri } ", "question": "Listar os mantenedores da Ponte Pandaruan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4550", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Slapstick_(band)> <http://dbpedia.org/property/currentMembers> ?x . ?x <http://dbpedia.org/ontology/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Qual \u00e9 a cidade natal do artista musical que s\u00e3o os atuais membros do Slapstick?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2130", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/Zambia> . ?x <http://dbpedia.org/ontology/river> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Dam>}", "question": "Quais s\u00e3o alguns rios da Z\u00e2mbia que possuem uma barragem?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?u_0 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/successor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?u_1 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}], "id": "982", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chatumongol_Sonakul> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual \u00e9 a religi\u00e3o do sucessor de Chatumongol Sonakul?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1079", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cahora_Bassa> <http://dbpedia.org/property/inflow> ?uri } ", "question": "para onde flui a cahora bassa?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1950", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alfred_Tarnowski> <http://dbpedia.org/property/placeOfDeath> ?uri } ", "question": "onde Alfred Tarnowski morreu?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4314", "query": "ASK WHERE { <http://dbpedia.org/resource/Walson_Augustin> <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Brothers_Union> }", "question": "Walson Augustin joga pelo Brothers Union?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "689", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arsenal_Cider_House> <http://dbpedia.org/property/locationCity> ?uri } ", "question": "Em que cidade fica a Casa de Cidra do Arsenal? localizado ?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2429", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Broadcast_syndication> . ?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/Eliza_Schneider>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de televis\u00e3o distribu\u00eddo por Broadcast syndication e dublado por Eliza Schneider?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "641", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/LG_Optimus_Vu> <http://dbpedia.org/ontology/operatingSystem> ?uri. <http://dbpedia.org/resource/Manu_Cornet> <http://dbpedia.org/property/employer> ?uri} ", "question": "Qual provedor de sistema operacional do LG Optimus Vu tamb\u00e9m \u00e9 o empregador do Manu Cornet?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2392", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/History_of_Trier> . ?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Mediolanum> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Qual pa\u00eds teve as sedes de condado como Hist\u00f3ria de Trier e Mediolanum?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1953", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/American_Mediterranean_Sea> <http://dbpedia.org/property/cities> ?uri. <http://dbpedia.org/resource/Laszlo_Bellak> <http://dbpedia.org/ontology/deathPlace> ?uri} ", "question": "Listar a cidade americana do Mar Mediterr\u00e2neo \u00e9 tamb\u00e9m o local da morte de Laszlo Bellak?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2748", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/I_Pray_on_Christmas> <http://dbpedia.org/property/label> ?uri. <http://dbpedia.org/resource/Next_Thing> <http://dbpedia.org/ontology/recordLabel> ?uri} ", "question": "Diga o nome da gravadora comum de I pray on Christmas and Next Thing?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3435", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fikret_Orman> <http://dbpedia.org/property/almaMater> ?uri } ", "question": "Qual \u00e9 a alma mater de Fikret Orman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3336", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/National_Academy_Museum_and_School> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Onde est\u00e3o enterrados os ganhadores do National Academy Museum and School?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4766", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Airman_first_class> . ?x <http://dbpedia.org/property/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Onde est\u00e1 a pessoa de cujo posto militar pertence o Airman de primeira classe?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_United_States_Steel_Hour> <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_0"}], "id": "3370", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_United_States_Steel_Hour> <http://dbpedia.org/ontology/writer> ?uri } ", "question": "Quem escreveu a hora do a\u00e7o nos EUA?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1884", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Snake_Island_(Black_Sea)> <http://dbpedia.org/property/locationCountry> ?uri } ", "question": "Onde est\u00e1 localizada a Ilha da Cobra?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_0 <http://dbpedia.org/ontology/foundedBy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> .?u_1 <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>", "target_var": "?u_0"}], "id": "389", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/David_Pressman> . ?x <http://dbpedia.org/ontology/foundedBy> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation>}", "question": "Liste todos os co-fundadores da organiza\u00e7\u00e3o sem fins lucrativos que t\u00eam como membro fundador David Pressman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2494", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolando_Gomez> <http://dbpedia.org/property/homeTown> ?uri. <http://dbpedia.org/resource/Clyde_McNeal> <http://dbpedia.org/property/deathDate> ?uri} ", "question": "Qual \u00e9 a cidade natal do Rolando Gomez \u00e9 o DOD do Clyde McNeal?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3878", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/New_York_City_FC>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer>}", "question": "Quais jogadores de futebol est\u00e3o jogando atualmente pelo NYC FC?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3856", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Lyubov_Dostoyevskaya>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Diga o nome de um escritor que foi educado em S\u00e3o Petersburgo e teve um filho chamado Lyubov Dostoyevskaya?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "845", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/The_Comedy_Channel_(United_States)> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais programas costumavam ir ao ar no canal que antes era conhecido como &quot;The Comedy Central&quot;?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Evraz> <http://dbpedia.org/ontology/owningCompany> ?u_0", "target_var": "?u_0"}], "id": "542", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Evraz> <http://dbpedia.org/ontology/owningCompany> ?uri } ", "question": "Qual empresa \u00e9 propriet\u00e1ria da Evraz?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_1 <http://dbpedia.org/ontology/leader> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}], "id": "91", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Berlin> . ?x <http://dbpedia.org/ontology/leader> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}", "question": "Quantos l\u00edderes partid\u00e1rios existem cujos partidos t\u00eam sede em Berlim?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3889", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Java_Gold> <http://dbpedia.org/property/trainer> ?x . ?x <http://dbpedia.org/property/birthPlace> ?uri  . }", "question": "Onde nasceu o treinador de Java Gold?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/San_Francisco_49ers>", "target_var": "?u_0"}], "id": "2812", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/San_Francisco_49ers>  . }", "question": "Quem s\u00e3o as pessoas que jogaram no San Francisco 49ers?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/6th_Infantry_Regiment_(United_States)> <http://dbpedia.org/ontology/notableCommander> <http://dbpedia.org/resource/Zachary_Taylor>", "target_var": "?u_-1"}], "id": "4082", "query": "ASK WHERE { <http://dbpedia.org/resource/6th_Infantry_Regiment_(United_States)> <http://dbpedia.org/ontology/notableCommander> <http://dbpedia.org/resource/Zachary_Taylor> }", "question": "Zachary Taylor era comandante do sexto regimento de infantaria dos EUA?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>", "target_var": "?u_0"}], "id": "2902", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }", "question": "Diga o nome de um parente famoso de Barry Voight"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2529", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Groove_Thang> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/property/associatedActs> ?uri  . }", "question": "Com qual artista o artista musical de Groove Thang colaborou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1676", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/P._Elmo_Futrell,_Jr.> <http://dbpedia.org/property/office> ?uri  . }", "question": "Onde fica o escrit\u00f3rio de P Elmo Futrell Jr?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1048", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Royal_Society> . ?uri <http://dbpedia.org/ontology/academicAdvisor> <http://dbpedia.org/resource/Franz_Brentano>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Nomeie o cientista que recebeu uma posi\u00e7\u00e3o na Royal Society e tem o orientador acad\u00eamico como Franz Brentano?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/Moondog_Matinee>", "target_var": "?u_0"}], "id": "1960", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?uri } ", "question": "Quais s\u00e3o os dois \u00faltimos \u00e1lbuns de est\u00fadio do Moondog Matinee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2530", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/mainIngredient> <http://dbpedia.org/resource/Salad> . ?x <http://dbpedia.org/property/country> ?uri  . }", "question": "Onde posso encontrar comida \u00e0 base de salada?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Walson_Augustin> <http://dbpedia.org/ontology/position> <http://dbpedia.org/resource/Midfielder>", "target_var": "?u_-1"}], "id": "3992", "query": "ASK WHERE { <http://dbpedia.org/resource/Walson_Augustin> <http://dbpedia.org/ontology/position> <http://dbpedia.org/resource/Midfielder> }", "question": "Walson Augustin joga como meio-campista?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "237", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }", "question": "Liste os locais que est\u00e3o associados a cidades no estado de Mecklenburg-Vorpommern."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3097", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Creature_Comforts> <http://dbpedia.org/property/creator> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quais pr\u00eamios o escritor, que \u00e9 o criador de Creature Comforts, ganhou?"}]