[{"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick>", "target_var": "?u_0"}], "id": "1501", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Stanley_Kubrick>  . }", "question": "Quantos filmes Stanley Kubrick dirigiu?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Dead_Sea>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Dead_Sea> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "2653", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Dead_Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Qual \u00e9 o rio cuja foz est\u00e1 no mar morto?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1055", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Kotelawala> <http://dbpedia.org/property/allegiance> ?uri } ", "question": "Qual \u00e9 a lealdade de John Kotelawala?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "705", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/breeder> <http://dbpedia.org/resource/Jacques_Van't_Hart> . ?x <http://dbpedia.org/property/race> ?uri  . }", "question": "De quantas corridas os cavalos criados por Jacques Van&#39;t Hart participaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "106", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Al_Gore_presidential_campaign,_2000> <http://dbpedia.org/ontology/incumbent> ?uri. <http://dbpedia.org/resource/Ann_Lewis> <http://dbpedia.org/ontology/president> ?uri} ", "question": "Qual \u00e9 o titular da campanha presidencial de Al Gore de 2000 e tamb\u00e9m o presidente da Ann Lewis?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Tom_Perriello> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}], "id": "589", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tom_Perriello> <http://dbpedia.org/ontology/region> ?uri } ", "question": "Qual \u00e9 a regi\u00e3o de Tom Perriello?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2468", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/related> <http://dbpedia.org/resource/Subaru_Outback> . ?x <http://dbpedia.org/ontology/layout> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Qual layout pode ser encontrado em carros semelhantes ao Subaru Outback?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2413", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/Starwood_Hotels_and_Resorts_Worldwide> . ?x <http://dbpedia.org/property/address> ?uri  . }", "question": "A Starwood opera em quais lugares?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1600", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Austin_College> <http://dbpedia.org/property/mascot> ?uri } ", "question": "Qual \u00e9 o mascote do Austin College?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2464", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1906\u201317_Stanford_rugby_teams> <http://dbpedia.org/property/headcoach> ?x . ?x <http://dbpedia.org/ontology/university> ?uri  . }", "question": "Qual foi a universidade do jogador de r\u00fagbi que treinou os times de r\u00fagbi de Stanford durante 1906-1917?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "228", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Wilton,_Connecticut>  . }", "question": "Quantas pessoas vivem em Wilton, Connecticut?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}], "id": "915", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais pr\u00eamios o diretor de cinema de The Haunted House ganhou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "794", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Henry_Cluney> <http://dbpedia.org/property/origin> ?uri } ", "question": "Qual \u00e9 a origem de Henry Cluney?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1073", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Batch_Monitor> <http://dbpedia.org/property/developer> ?uri. <http://dbpedia.org/resource/Riddim_Ribbon_feat._The_Black_Eyed_Peas> <http://dbpedia.org/property/distributor> ?uri} ", "question": "Qual empresa trouxe a Riddim Ribbon ao mercado e desenvolveu o monitor de lote?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_0 .<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_0 .?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_0 .?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_0 .<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_0 .?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_1 .<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_1 .?u_0 <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?u_0 .<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?u_1 .?u_0 <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}], "id": "3351", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Xynisteri> <http://dbpedia.org/ontology/origin> ?uri. <http://dbpedia.org/resource/Mavro> <http://dbpedia.org/ontology/origin> ?uri . }", "question": "Em que parte do mundo posso encontrar Xynisteri e Mavro?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1084", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_Edward_Magoon> <http://dbpedia.org/property/restingplace> ?uri } ", "question": "Diga o nome do local de descanso de Charles Edward Magoon?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "926", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/2013_Copa_Centroamericana> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem construiu o est\u00e1dio que foi alugado para a Copa Centroamericana 2013?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Gymnastics_at_the_2008_Summer_Olympics_\u2013_Women's_artistic_individual_all-around> <http://dbpedia.org/ontology/silverMedalist> ?u_0", "target_var": "?u_0"}], "id": "3049", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gymnastics_at_the_2008_Summer_Olympics_\u2013_Women's_artistic_individual_all-around> <http://dbpedia.org/ontology/silverMedalist> ?uri } ", "question": "Quem foi o medalhista de prata da gin\u00e1stica no indiv\u00edduo art\u00edstico feminino dos Jogos Ol\u00edmpicos de Ver\u00e3o de 2008?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/gender> <http://dbpedia.org/resource/Female>", "target_var": "?u_0"}], "id": "1117", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/gender> <http://dbpedia.org/resource/Female> } ", "question": "quais s\u00e3o alguns sobrenomes comuns de pessoas do sexo feminino?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "642", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Edsel_Ranger> . ?x <http://dbpedia.org/property/parent> ?uri  . }", "question": "Qual empresa possui o fabricante do Edsel Ranger?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Creative_Commons>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Creative_Commons> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Creative_Commons>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Creative_Commons> .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_0"}], "id": "4767", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Creative_Commons> . ?x <http://dbpedia.org/ontology/board> ?uri }", "question": "Liste o n\u00famero total de membros do conselho que compartilham o conselho com Creative Commons?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "501", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/United_States_House_of_Representatives_elections,_1788_and_1789> <http://dbpedia.org/property/leader> ?uri } ", "question": "Quem \u00e9 o l\u00edder das elei\u00e7\u00f5es para a C\u00e2mara dos Representantes dos Estados Unidos, 1788 e 1789?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4066", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Fugitive_Kind> <http://dbpedia.org/property/writer> ?uri. <http://dbpedia.org/resource/The_Notebook_of_Trigorin> <http://dbpedia.org/ontology/author> ?uri . }", "question": "O tipo fugitivo e o caderno de Trigorin s\u00e3o escritos por que autor?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "333", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)> . ?uri <http://dbpedia.org/ontology/parentMountainPeak> <http://dbpedia.org/resource/Nevado_de_Toluca>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}", "question": "Diga o nome da montanha cuja cordilheira \u00e9 Sierra Nevada (EUA) e o pico da montanha pai \u00e9 Nevado de Toluca?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4684", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Monument_to_Salavat_Yulaev> <http://dbpedia.org/ontology/designer> ?x . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . }", "question": "Onde morreu o designer do Monumento a Salavat Yulaev?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_1"}], "id": "486", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "Quantos mam\u00edferos existem no filo Chordate?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1962", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Roh_Tae-woo> <http://dbpedia.org/property/battles> ?uri } ", "question": "Liste as batalhas travadas por Roh Tae-woo?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_1 <http://dbpedia.org/property/subject> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_1 <http://dbpedia.org/property/subject> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_0 <http://dbpedia.org/property/subject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> .?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/subject> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}], "id": "393", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Random_House> . ?x <http://dbpedia.org/property/subject> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Qual g\u00eanero de livro \u00e9 publicado pela Random House?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4842", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri} ", "question": "Que famosa figura pol\u00edtica nomeou william cushing, e tamb\u00e9m fundou Pittsburgh&gt;"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4866", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Rolv_Erik_Ryssdal> . ?uri <http://dbpedia.org/property/owners> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}", "question": "Quais jornais s\u00e3o propriedade de empresas sob Rolv Erik Ryssdal?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1755", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Lost_Special> <http://dbpedia.org/property/series> ?uri. <http://dbpedia.org/resource/Sherlock_Holmes_(play)> <http://dbpedia.org/property/characters> ?uri} ", "question": "Qual s\u00e9rie tem um epis\u00f3dio chamado O especial perdido e tamb\u00e9m um personagem chamado Sherlock Holmes?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .?u_1 <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .?u_1 <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .?u_1 <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_1 .<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_1 .?u_0 <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?u_0 .<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?u_1 .?u_0 <http://dbpedia.org/ontology/officialLanguage> ?u_1", "target_var": "?u_1"}], "id": "3585", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ladonia_(micronation)> <http://dbpedia.org/ontology/officialLanguage> ?uri. <http://dbpedia.org/resource/Empire_of_Atlantium> <http://dbpedia.org/ontology/officialLanguage> ?uri . }", "question": "Liste a l\u00edngua oficial comum da lad\u00f4nia e do Imp\u00e9rio de Atlantium?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> ?u_1", "target_var": "?u_1"}], "id": "4315", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pelo animador de The Skeleton Dance?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4966", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Haight-Ashbury> . ?uri <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/USS_Kittiwake_(ASR-13)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual distrito eleitoral do titular do cargo \u00e9 Haight-Ashbury e tem unidade militar como USS Kittiwake?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2099", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arkansas> <http://dbpedia.org/ontology/language> ?x . ?x <http://dbpedia.org/property/region> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EthnicGroup>}", "question": "Qual \u00e9 a regi\u00e3o do grupo \u00e9tnico que fala a l\u00edngua do Arkansas?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}], "id": "3599", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Sarathchandra_Rajakaruna> . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "Qual \u00e9 a religi\u00e3o do membro do parlamento que \u00e9 parente de Sarathchandra Rajakaruna?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/New_Sanno_Hotel> <http://dbpedia.org/ontology/tenant> ?u_0", "target_var": "?u_0"}], "id": "4121", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/New_Sanno_Hotel> <http://dbpedia.org/ontology/tenant> ?uri } ", "question": "Que organiza\u00e7\u00e3o regula e controla o New Sanno Hotel?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "65", "query": "ASK WHERE { <http://dbpedia.org/resource/Ganymede_(moon)> <http://dbpedia.org/property/discoverer> <http://dbpedia.org/resource/Galileo_Galilei> }", "question": "Ganimedes foi descoberto por Galileo Galilei?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "838", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Ralf_Schumacher> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Mick_Schumacher>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FormulaOneRacer>}", "question": "Nomeie o piloto de F1 com parente como Ralf Schumacher e tem um filho chamado Mick Schumacher?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3906", "query": "ASK WHERE { <http://dbpedia.org/resource/Toyota_Verossa> <http://dbpedia.org/ontology/automobilePlatform> <http://dbpedia.org/resource/Front-engine_design>  . }", "question": "O Toyota Verossa tem a plataforma de design do motor dianteiro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3773", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Postbanken> . ?x <http://dbpedia.org/property/products> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bank>}", "question": "Quais s\u00e3o alguns outros produtos dos bancos que fazem o Postbanken?"}]