[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/maintainedBy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_1 <http://dbpedia.org/ontology/maintainedBy> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_1 <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/maintainedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_0 <http://dbpedia.org/ontology/maintainedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> .?u_0 <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_1"}], "id": "4697", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Pandaruan_River> . ?x <http://dbpedia.org/ontology/maintainedBy> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Quem s\u00e3o os mantenedores das pontes que cruzam o rio Pandaruan?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "360", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Colts_Neck_Township,_New_Jersey> . ?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Beverly_Hills,_California> . }", "question": "Quem tem resid\u00eancias oficiais em Colts Neck Township e Beverly Hills?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4656", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WBCQ-FM> <http://dbpedia.org/property/sisterStations> ?x . ?x <http://dbpedia.org/property/area> ?uri  . }", "question": "Liste a \u00e1rea das esta\u00e7\u00f5es de r\u00e1dio cuja esta\u00e7\u00e3o irm\u00e3 \u00e9 WBCQ-FM?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1614", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robbie_Diack> <http://dbpedia.org/property/school> ?uri } ", "question": "Qual escola Robbie Diack frequentou?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2303", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Nashville,_Tennessee> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Congressman>}", "question": "Liste a alma mater dos congressistas que compareceram a Nashville, Tennessee?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/CFRX> <http://dbpedia.org/ontology/broadcastArea> ?u_0", "target_var": "?u_0"}], "id": "4141", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/CFRX> <http://dbpedia.org/ontology/broadcastArea> ?uri } ", "question": "Qual \u00e9 a \u00e1rea de transmiss\u00e3o do CFRX?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4214", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri. <http://dbpedia.org/resource/Brandon_Lee> <http://dbpedia.org/ontology/restingPlace> ?uri} ", "question": "Qual hub da Cascade Airways tamb\u00e9m \u00e9 o local de descanso de Brandon Lee?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4884", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Kaliningrad> . ?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Gda\u0144sk> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>}", "question": "Qual \u00e9 o mar conectado a Kaliningrado e Gdask?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3163", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Election_Commission_of_Thailand> <http://dbpedia.org/property/agencyName> ?uri } ", "question": "Nomeie a ag\u00eancia da Comiss\u00e3o Eleitoral da Tail\u00e2ndia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "490", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Ursula_H\u00e4nle> . ?x <http://dbpedia.org/property/nationalOrigin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Aircraft>}", "question": "Em que pa\u00eds os avi\u00f5es projetados por Ursula Hanle se originaram?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy>", "target_var": "?u_0"}], "id": "862", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy> } ", "question": "quais s\u00e3o algumas unidades do Departamento da Marinha dos EUA?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/ontology/destination> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Chevrolet_Caprice>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Chevrolet_Caprice> <http://dbpedia.org/ontology/predecessor> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/ontology/destination> ?u_0 .<http://dbpedia.org/resource/Chevrolet_Caprice> <http://dbpedia.org/ontology/predecessor> ?u_0", "target_var": "?u_0"}], "id": "1740", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/ontology/destination> ?uri. <http://dbpedia.org/resource/Chevrolet_Caprice> <http://dbpedia.org/ontology/predecessor> ?uri} ", "question": "Qual destino da Novair International Airways \u00e9 tamb\u00e9m o antecessor do Chevrolet Caprice?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/occupation> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> .?u_1 <http://dbpedia.org/ontology/occupation> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_0"}], "id": "4099", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Shirelles> . ?x <http://dbpedia.org/ontology/occupation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "O que outros artistas associados aos Shirelles fizeram?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_0 <http://dbpedia.org/ontology/company> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_0 <http://dbpedia.org/ontology/company> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/company> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/company> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_1 <http://dbpedia.org/ontology/company> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/company> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> .?u_1 <http://dbpedia.org/ontology/company> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "4385", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/New_York_City> . ?uri <http://dbpedia.org/ontology/company> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais sitcoms s\u00e3o feitos por uma empresa com sede em NYC?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Duwamish_River> <http://dbpedia.org/ontology/city> ?u_0", "target_var": "?u_0"}], "id": "2447", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Duwamish_River> <http://dbpedia.org/ontology/city> ?uri } ", "question": "Qual \u00e9 o nome da cidade de Duwamish River?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4230", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }", "question": "Liste os filhos do pai de Marvin Bush."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "506", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Diane_Disney_Miller> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Liste os pr\u00eamios recebidos da pessoa cujo filho \u00e9 Daine Disney Miller?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2677", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Baku_Puppet_Theatre> <http://dbpedia.org/ontology/locationCountry> ?uri. <http://dbpedia.org/resource/Anar_Salmanov> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Em que pa\u00eds est\u00e1 localizado o Teatro de fantoches de Baku, que tamb\u00e9m \u00e9 o local onde nasceu Anar Salmanov?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2995", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tony_n'_Tina's_Wedding> <http://dbpedia.org/property/starring> ?uri } ", "question": "Listar todos os membros do elenco do casamento de Tony n &#39;Tina?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Dublin_Airport>", "target_var": "?u_0"}], "id": "1942", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Dublin_Airport> } ", "question": "Qual \u00e9 a companhia a\u00e9rea tem sua sede no Aeroporto de Dublin?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1222", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Operation_Autumn_Clouds> <http://dbpedia.org/property/result> ?uri } ", "question": "Qual foi o resultado da Opera\u00e7\u00e3o Nuvens de Outono?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Temptation_Waits> <http://dbpedia.org/ontology/recordedIn> ?u_0", "target_var": "?u_0"}], "id": "1113", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Temptation_Waits> <http://dbpedia.org/ontology/recordedIn> ?uri } ", "question": "Onde o Temptation Waits foi gravado?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/screenplay> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_States> .?u_1 <http://dbpedia.org/property/screenplay> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}], "id": "1905", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/screenplay> ?x  . }", "question": "Alguns filmes cujo roteiro \u00e9 feito por americanos nascidos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3423", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Clay_Aiken>  . }", "question": "Liste os parentes do clay Aiken?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1877", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Voight> <http://dbpedia.org/property/children> ?x . ?x <http://dbpedia.org/ontology/relative> ?uri  . }", "question": "Liste os parentes dos filhos de Jon Voight?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4672", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/property/children> ?x . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Qual \u00e9 o local de descanso dos filhos de Bruce Lee?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "433", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Militia> . ?uri <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Colonel_(United_States)>  . }", "question": "Listar o coronel com ramo como mil\u00edcia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2364", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/area> <http://dbpedia.org/resource/South_Carolina> . ?x <http://dbpedia.org/property/area> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>}", "question": "Liste todas as \u00e1reas servidas pela esta\u00e7\u00e3o de r\u00e1dio que atende a Carolina do Sul?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3154", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/Todd_Huth> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual o tema do programa de TV foi composto por uma banda na qual Todd Huth costumava se apresentar?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_0 .<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_0 .?u_1 <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_0 .?u_1 <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_0 .<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_0 .?u_1 <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_1 .<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_1 .?u_0 <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?u_0 .<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?u_1 .?u_0 <http://dbpedia.org/ontology/notableWork> ?u_1", "target_var": "?u_1"}], "id": "2835", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Neil_Cross> <http://dbpedia.org/ontology/notableWork> ?uri. <http://dbpedia.org/resource/Lars_Pearson> <http://dbpedia.org/ontology/notableWork> ?uri . }", "question": "Por qual trabalho Neil Cross e Lars Pearson s\u00e3o conhecidos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Abbas_Jafri> <http://dbpedia.org/ontology/stateOfOrigin> ?u_0", "target_var": "?u_0"}], "id": "2092", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abbas_Jafri> <http://dbpedia.org/ontology/stateOfOrigin> ?uri } ", "question": "Qual \u00e9 o estado de origem de Abbas Jafri?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Claudia_Moro> <http://dbpedia.org/property/title> ?u_0", "target_var": "?u_0"}], "id": "3010", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Claudia_Moro> <http://dbpedia.org/property/title> ?uri } ", "question": "qual pr\u00eamio foi conquistado por Claudia Moro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3162", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richie_Aprile> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Que religi\u00e3o o c\u00f4njuge de Richie Aprile seguia?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Baikal_Mountains>", "target_var": "?u_0"}], "id": "2945", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Baikal_Mountains> } ", "question": "Qual rio tem suas ra\u00edzes nas montanhas do Baikal?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Valentina_Matviyenko>", "target_var": "?u_0"}], "id": "3916", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Valentina_Matviyenko>  . }", "question": "Qual \u00e9 o pa\u00eds cujo l\u00edder j\u00e1 foi Valentina Matviyenko?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2916", "query": "ASK WHERE { <http://dbpedia.org/resource/Stanislav_Morozov> <http://dbpedia.org/property/formercoach> <http://dbpedia.org/resource/Ingo_Steuer> }", "question": "Ingo Steuer \u00e9 o ex-treinador de Stanislav Morozov?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1102", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/role> <http://dbpedia.org/resource/Close_air_support> . ?uri <http://dbpedia.org/ontology/militaryUnit> ?x  . }", "question": "Cujas unidades s\u00e3o respons\u00e1veis pelo apoio a\u00e9reo aproximado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1448", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/chancellor> <http://dbpedia.org/resource/Nicholas_S._Zeppos>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Qual universidade tem chanceler como Nicholas S. Zeppos?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1720", "query": "ASK WHERE { <http://dbpedia.org/resource/Shawn_Johnson> <http://dbpedia.org/property/headcoach> <http://dbpedia.org/resource/Liang_Chow> }", "question": "Liang Chow \u00e9 a cabe\u00e7a de Shawn Johnson?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4518", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Lesley-Anne_Knight> . ?x <http://dbpedia.org/property/keyPeople> ?uri  . }", "question": "Diga o nome das pessoas-chave das organiza\u00e7\u00f5es sem fins lucrativos, das quais uma das pessoas-chave \u00e9 Lesley-Anne knight?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3842", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Federal_Reserve_Bank_Building_(Seattle)> <http://dbpedia.org/property/address> ?uri } ", "question": "Qual \u00e9 o endere\u00e7o do Federal Reserve Bank Building?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1773", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Kris_Kristofferson>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "Quais artistas co-estrelaram com Kris Kristofferson?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "615", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> . ?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Liste o software usando C ++ como linguagem de programa\u00e7\u00e3o e a licen\u00e7a \u00e9 Software as a service?"}]