[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}], "id": "4112", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/RCA_Records> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais filmes t\u00eam suas m\u00fasicas compostas por algu\u00e9m que assinou com a RCA Records?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Adventures_of_Tom_Sawyer> <http://dbpedia.org/ontology/coverArtist> <http://dbpedia.org/resource/Mark_Twain>", "target_var": "?u_-1"}], "id": "3707", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Adventures_of_Tom_Sawyer> <http://dbpedia.org/ontology/coverArtist> <http://dbpedia.org/resource/Mark_Twain> }", "question": "A capa de As aventuras de Tom Sawyer foi desenhada por Mark Twain?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1101", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>}", "question": "Que jogos s\u00e3o disputados em institui\u00e7\u00f5es filiadas \u00e0 associa\u00e7\u00e3o internacional de universidades?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?u_0", "target_var": "?u_0"}], "id": "2746", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?uri } ", "question": "Qual \u00e9 a ideologia do Partido Palang Dharma?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}], "id": "2170", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/War_of_1812> . ?uri <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Battle_of_the_Thames> . }", "question": "Quem \u00e9 conhecido por Guerra de 1812 e Batalha do Tamisa?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "322", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/editor> <http://dbpedia.org/resource/Stephen_Law> . ?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AcademicJournal>}", "question": "Qual jornal de filosofia tem compilador como Stephen Law?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4254", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel> . ?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Jaber_Al-Ahmad_Al-Sabah>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Qual conflito militar ocorreu em Israel e teve como comandante Jaber Al-Ahmad Al-Sabah?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3142", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/United_First_Parish_Church> . ?uri <http://dbpedia.org/ontology/vicePresident> ?x  . }", "question": "Quem serviu a um vice-presidente enterrado na United First Parish Church?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3537", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/last> <http://dbpedia.org/resource/The_Avengers_(1998_film)> . ?x <http://dbpedia.org/property/nationality> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "De onde vem o personagem fict\u00edcio, cuja \u00faltima apari\u00e7\u00e3o foi nos Vingadores, 1998?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Miao_people> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?u_0 .<http://dbpedia.org/resource/Miao_people> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}], "id": "4925", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Palang_Dharma_Party> <http://dbpedia.org/ontology/ideology> ?uri. <http://dbpedia.org/resource/Miao_people> <http://dbpedia.org/ontology/religion> ?uri} ", "question": "Qual idelogia do Partido Palang Dharma tamb\u00e9m \u00e9 a f\u00e9 do povo Miao?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Michael_Deeley>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Michael_Deeley> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "2924", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Liste os filmes produzidos por Michael Deeley?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1149", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Scott_Berkun> <http://dbpedia.org/property/residence> ?uri. <http://dbpedia.org/resource/Dennis_DeConcini> <http://dbpedia.org/property/residence> ?uri . }", "question": "Onde moram Dennis DeConcini e Scott Berkun?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3617", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Louis_Chevrolet> <http://dbpedia.org/property/deathPlace> ?uri } ", "question": "Onde Louis Chevrolet morreu?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "291", "query": "ASK WHERE { <http://dbpedia.org/resource/Bacillus> <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> }", "question": "O Bacillus pertence ao dom\u00ednio Bact\u00e9rias?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3749", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lumbini_Bauddha_University> <http://dbpedia.org/property/affiliation> ?uri } ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o da Universidade Lumbini Bauddha?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3586", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Frank_Miller_(comics)> . ?x <http://dbpedia.org/property/characterName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Qual \u00e9 o nome dos personagens criados por Frank Miller?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/deputy> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/deputy> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/deputy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jenny_Macklin> <http://dbpedia.org/property/predecessor> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/deputy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/deputy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/deputy> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}], "id": "3607", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/deputy> <http://dbpedia.org/resource/Jenny_Macklin> . ?uri <http://dbpedia.org/property/predecessor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o n\u00famero total de pol\u00edticos cujo deputado do antecessor \u00e9 Jenny Macklin?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Middlesbrough_F.C.>", "target_var": "?u_0"}], "id": "2648", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Middlesbrough_F.C.>  . }", "question": "Quantos dirigentes administraram o Middlesbrough FC?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4810", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/arena> <http://dbpedia.org/resource/The_Palace_of_Auburn_Hills> . ?uri <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Stan_Van_Gundy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballTeam>}", "question": "Entre qual time de basquete tendo arena como The Palace of Auburn Hills tem presidente como Stan Van Gundy?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_0"}], "id": "1983", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "D\u00ea-me uma contagem de pontes localizadas na Calif\u00f3rnia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Taekwondo>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/athletics> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Taekwondo> .?u_0 <http://dbpedia.org/property/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1 .?u_1 <http://dbpedia.org/property/athletics> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Taekwondo>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Taekwondo> .?u_1 <http://dbpedia.org/property/athletics> ?u_0", "target_var": "?u_0"}], "id": "2932", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Taekwondo> . ?x <http://dbpedia.org/property/athletics> ?uri  . }", "question": "Quais s\u00e3o os esportes praticados pelas universidades que tamb\u00e9m praticam taekwondo?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/placeofburial> <http://dbpedia.org/resource/Arlington_National_Cemetery>", "target_var": "?u_0"}], "id": "1536", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/placeofburial> <http://dbpedia.org/resource/Arlington_National_Cemetery> } ", "question": "Quem est\u00e1 enterrado no cemit\u00e9rio nacional de Arlington?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4172", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Waitakere_United> . ?x <http://dbpedia.org/ontology/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "A que pa\u00eds pertencem os jogadores do Waitakere United?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Drum_kit>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Drum_kit>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Drum_kit> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Drum_kit> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}], "id": "3360", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Drum_kit> . ?x <http://dbpedia.org/ontology/stylisticOrigin> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>}", "question": "Quantos g\u00eaneros diferentes levaram a outros g\u00eaneros onde a bateria \u00e9 importante?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3665", "query": "ASK WHERE { <http://dbpedia.org/resource/Fred_Claus> <http://dbpedia.org/property/narrator> <http://dbpedia.org/resource/Trevor_Peacock> }", "question": "Trevor Peacock \u00e9 o narrador de Fred Claus?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/bandMember> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)> .?u_0 <http://dbpedia.org/ontology/bandMember> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)> .<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)> .?u_1 <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_0 .?u_1 <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_0 .?u_0 <http://dbpedia.org/ontology/associatedBand> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/associatedBand> ?u_0 .?u_0 <http://dbpedia.org/ontology/bandMember> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)> .?u_0 <http://dbpedia.org/ontology/bandMember> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Guy_(band)> .?u_1 <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_1 .?u_1 <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?u_1 .?u_0 <http://dbpedia.org/ontology/associatedBand> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/associatedBand> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/associatedBand> ?u_1 .?u_1 <http://dbpedia.org/ontology/bandMember> ?u_0", "target_var": "?u_1"}], "id": "3626", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Guy_(band)> <http://dbpedia.org/ontology/bandMember> ?x . ?x <http://dbpedia.org/ontology/associatedBand> ?uri  . }", "question": "Liste todas as bandas que t\u00eam membros da banda Guy nelas?"}]