[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "196", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/United_States_men's_national_soccer_team> . ?x <http://dbpedia.org/property/debutteam> ?uri  . }", "question": "Onde eles estrearam suas carreiras, aqueles que jogaram pela sele\u00e7\u00e3o masculina de futebol dos Estados Unidos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}], "id": "4667", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shim\u014dsa_Plateau> <http://dbpedia.org/ontology/border> ?uri } ", "question": "O que h\u00e1 nas fronteiras do planalto de Shimsa?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1330", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Theme_Time_Radio_Hour> <http://dbpedia.org/property/creator> ?uri. <http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri} ", "question": "Qual criador de Theme Time Radio Hour tamb\u00e9m deu a trilha sonora do The Times They Are a-Changin &#39;(musical)?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Interplay_Entertainment>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/genre> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Interplay_Entertainment> .?u_0 <http://dbpedia.org/property/genre> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Interplay_Entertainment>", "target_var": "?u_1"}], "id": "879", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Interplay_Entertainment> . ?x <http://dbpedia.org/property/genre> ?uri  . }", "question": "Quantos tipos diferentes de jogos s\u00e3o publicados pela Interplay Entertainment?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4502", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Goya_Awards> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Que outros pr\u00eamios foram dados aos Vencedores do Pr\u00eamio Goya?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3501", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures> . ?x <http://dbpedia.org/ontology/notableWork> ?uri  . }", "question": "Quantas outras obras importantes foram realizadas pelos escritores de Sarah Jane Adventures?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3894", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk> . ?x <http://dbpedia.org/property/race> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RaceHorse>}", "question": "Os cavalos de corrida cujo av\u00f4 \u00e9 Wild Risk participaram de quais corridas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4990", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WCW_Mayhem> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem s\u00e3o os inquilinos do est\u00e1dio que \u00e9 palco do WCW Mayhem?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "887", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2014\u201315_Virginia_Tech_Hokies_men's_basketball_team> <http://dbpedia.org/property/headcoach> ?uri. <http://dbpedia.org/resource/2012\u201313_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri} ", "question": "Qual treinador do time masculino de basquete do Marquette Golden Eagles \u00e9 tamb\u00e9m o treinador principal do time masculino de basquete do Virginia Tech Hokies?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_0"}], "id": "1345", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?uri } ", "question": "Quais s\u00e3o as corridas em que Martin Molony participou?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "68", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/OneDrive>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "A que empresa est\u00e1 associado o servi\u00e7o OneDrive?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4210", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Soylent_(drink)> <http://dbpedia.org/ontology/region> ?uri. <http://dbpedia.org/resource/Bannock_(food)> <http://dbpedia.org/ontology/region> ?uri . }", "question": "Onde as regi\u00f5es comuns s\u00e3o vendidas soja e bannock?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire> .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Ottoman_Empire>", "target_var": "?u_1"}], "id": "1815", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Ottoman_Empire> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Que pr\u00eamios foram dados aos cidad\u00e3os do Imp\u00e9rio Otomano?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "568", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction> . ?uri <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Liste os programas de fic\u00e7\u00e3o cient\u00edfica transmitidos pela BBC HD?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "96", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Playboy_Enterprises> <http://dbpedia.org/property/products> ?uri } ", "question": "Liste os produtos da Playboy Enterprises?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4181", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WGBC> <http://dbpedia.org/property/sisterStations> ?x . ?x <http://dbpedia.org/ontology/formerBroadcastNetwork> ?uri  . }", "question": "Diga o nome da antiga rede de transmiss\u00e3o da esta\u00e7\u00e3o de televis\u00e3o que \u00e9 a esta\u00e7\u00e3o irm\u00e3 do WGBC?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3353", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hirth_Acrostar> <http://dbpedia.org/ontology/origin> ?uri. <http://dbpedia.org/resource/Cobra_(missile)> <http://dbpedia.org/ontology/origin> ?uri . }", "question": "Qual \u00e9 o pa\u00eds do Hirth Acrostar e do m\u00edssil Cobra?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "139", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Daniel_O'Regan> <http://dbpedia.org/property/nickname> ?uri } ", "question": "Qual \u00e9 o apelido de Daniel O&#39;Regan?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jimmy_Wales>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jimmy_Wales> .?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jimmy_Wales>", "target_var": "?u_1"}], "id": "4954", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jimmy_Wales> . ?x <http://dbpedia.org/ontology/owner> ?uri  . }", "question": "Quem \u00e9 o dono dos sites para os quais Jimmy wales escreve?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>", "target_var": "?u_0"}], "id": "2602", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/California>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Quais s\u00e3o as pontes localizadas na Calif\u00f3rnia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1606", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Denzil_Minnan-Wong> . ?uri <http://dbpedia.org/ontology/locationCity> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Nomeie as empresas que est\u00e3o em cidades sob Denzil Minnan Wong?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1629", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pat_Kirkwood_(racing_driver)> <http://dbpedia.org/property/birthplace> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }", "question": "Qual \u00e9 a maior cidade do local de nascimento de Pat Kirkwood?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1539", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Water_resources_management_in_El_Salvador> <http://dbpedia.org/property/sourceCountry> ?uri. <http://dbpedia.org/resource/Sierra_del_Merend\u00f3n> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Qual fonte de gest\u00e3o de recursos h\u00eddricos em El Salvador \u00e9 tamb\u00e9m a na\u00e7\u00e3o da Sierra del Merendn?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Academy_of_Fine_Arts_In_\u0141\u00f3d\u017a>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Academy_of_Fine_Arts_In_\u0141\u00f3d\u017a> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Academy_of_Fine_Arts_In_\u0141\u00f3d\u017a>", "target_var": "?u_1"}], "id": "2059", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Academy_of_Fine_Arts_In_\u0141\u00f3d\u017a> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Que pr\u00eamios conquistaram os ex-alunos da Academia de Belas Artes de Lodz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "463", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Cite os membros de clubes de jovens que t\u00eam Camp Nou como seu campo de atua\u00e7\u00e3o."}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> <http://dbpedia.org/resource/Mumbai>", "target_var": "?u_-1"}], "id": "2330", "query": "ASK WHERE { <http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> <http://dbpedia.org/resource/Mumbai> }", "question": "Mumbai administra a linha ferrovi\u00e1ria que vai at\u00e9 o entroncamento ferrovi\u00e1rio de Daund?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3043", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Allen_(musician)> . ?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Qual artista musical associado a Tony Allen tem selo com a Celluloid Records?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Phoenix_Suns>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Phoenix_Suns> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}], "id": "4734", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Phoenix_Suns>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Quem s\u00e3o alguns jogadores de basquete que jogaram pelo Phoenix Suns?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3814", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/lyrics> <http://dbpedia.org/resource/Sheldon_Harnick> . ?x <http://dbpedia.org/ontology/basedOn> ?uri  . }", "question": "De quantas obras deriva o musical, cujas letras s\u00e3o escritas por Sheldon Harnick?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "625", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Dolley_Madison> . ?uri <http://dbpedia.org/property/allegiance> <http://dbpedia.org/resource/Colony_of_Virginia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Que lealdade de titular de cargo \u00e9 Col\u00f4nia da Virg\u00ednia e foi tem uma esposa chamada Dolley Madison?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Derg> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ethiopia>", "target_var": "?u_-1"}], "id": "450", "query": "ASK WHERE { <http://dbpedia.org/resource/Derg> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Ethiopia> }", "question": "Derg era o hino da Et\u00f3pia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1499", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/Ottawa_Citizen> . ?x <http://dbpedia.org/property/homeTown> ?uri  . }", "question": "Os funcion\u00e1rios da Ottawa Citizen vieram de quais cidades?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Ankh-Morpork_City_Watch>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Ankh-Morpork_City_Watch> .?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Ankh-Morpork_City_Watch>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Ankh-Morpork_City_Watch> .?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}], "id": "2456", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Ankh-Morpork_City_Watch> . ?x <http://dbpedia.org/ontology/nonFictionSubject> ?uri }", "question": "Quantos assuntos de n\u00e3o fic\u00e7\u00e3o existem dos livros cujo um dos assuntos de n\u00e3o fic\u00e7\u00e3o \u00e9 Ankh-Morpork City Watch?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4722", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/EXXV-TV> <http://dbpedia.org/property/licensee> ?uri } ", "question": "Quem \u00e9 o licenciado da EXXV-TV?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Jimmy_Wales> <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_0"}], "id": "2984", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jimmy_Wales> <http://dbpedia.org/ontology/board> ?uri } ", "question": "Quem est\u00e1 no conselho de Jimmy Wales?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3518", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_Ryan_(politician)> <http://dbpedia.org/ontology/nominee> ?uri } ", "question": "Quem \u00e9 o indicado de Jack Ryan?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dob\u0161insk\u00e1_Ice_Cave> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?u_0 .<http://dbpedia.org/resource/Dob\u0161insk\u00e1_Ice_Cave> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}], "id": "1557", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Serbia_national_American_football_team> <http://dbpedia.org/ontology/division> ?uri. <http://dbpedia.org/resource/Dob\u0161insk\u00e1_Ice_Cave> <http://dbpedia.org/ontology/region> ?uri} ", "question": "Qual divis\u00e3o da sele\u00e7\u00e3o da S\u00e9rvia tamb\u00e9m \u00e9 a regi\u00e3o da Caverna de Gelo de Dobinsk?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3624", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mother> <http://dbpedia.org/resource/Cleopatra_V_of_Egypt> . ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Ptolemy_XII_Auletes>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Diga o nome da realeza cuja esposa era Cle\u00f3patra V do Egito e um de seus pais era Ptolomeu XII Auletes?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4664", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jovan_Vladimir> <http://dbpedia.org/property/majorShrine> ?uri } ", "question": "Liste os principais santu\u00e1rios de Jovan Vladimir?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/company> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_0 <http://dbpedia.org/property/company> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/company> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> .?u_1 <http://dbpedia.org/property/company> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/CBS_Corporation> <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/CBS_Corporation> <http://dbpedia.org/ontology/owner> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/CBS_Corporation> <http://dbpedia.org/ontology/owner> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/CBS_Corporation> <http://dbpedia.org/ontology/owner> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "150", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/CBS_Corporation> . ?uri <http://dbpedia.org/property/company> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Cite alguns programas cuja empresa \u00e9 propriedade da CBS Corporation?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1420", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Marlboro_Township,_New_Jersey>  . }", "question": "Que pessoa famosa nasceu em Marlboro Township, New Jersey?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2011", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Start_+_Flug> . ?x <http://dbpedia.org/property/nationalOrigin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Aircraft>}", "question": "Em quais pa\u00edses as aeronaves Start + Flug se originaram?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/family> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/family> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae> .?u_1 <http://dbpedia.org/ontology/family> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae> .?u_0 <http://dbpedia.org/ontology/family> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/family> ?u_0 .?u_0 <http://dbpedia.org/ontology/family> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae> .?u_1 <http://dbpedia.org/ontology/family> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae> .?u_0 <http://dbpedia.org/ontology/family> ?u_1", "target_var": "?u_1"}], "id": "2686", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Hominidae> . ?x <http://dbpedia.org/ontology/family> ?uri }", "question": "Quantas outras fam\u00edlias de mam\u00edferos existem cuja fam\u00edlia tamb\u00e9m \u00e9 Hominidae?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1786", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2006_Oakland_Raiders_season> <http://dbpedia.org/property/coach> ?x . ?x <http://dbpedia.org/ontology/formerTeam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}", "question": "Qual \u00e9 a ex-equipe do jogador de futebol que \u00e9 o treinador da temporada de 2006 do Oakland Raiders?"}]