[{"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Lancy> <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Geneva>", "target_var": "?u_-1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Geneva> <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Lancy>", "target_var": "?u_-1"}], "id": "1286", "query": "ASK WHERE { <http://dbpedia.org/resource/Geneva> <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Lancy> }", "question": "Lancy \u00e9 uma cidade perto de Genebra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "349", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Even-toed_ungulate> . ?uri <http://dbpedia.org/property/mascot> ?x  . }", "question": "Liste as escolas cujo mascote \u00e9 ungulado ungulado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2137", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Boeing_F/A-18E/F_Super_Hornet> . ?uri <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Raymond_Conner>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "O nome da empresa cujos produtos \u00e9 Boeing F / A-18E / F Super Hornet e a pessoa-chave \u00e9 Raymond Conner?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?u_0 .?u_0 <http://dbpedia.org/ontology/relation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/governor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/governor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?u_1 .?u_1 <http://dbpedia.org/ontology/relation> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Gabriel_Slaughter>", "target_var": "?u_1"}], "id": "2691", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gabriel_Slaughter> <http://dbpedia.org/ontology/governor> ?x . ?x <http://dbpedia.org/ontology/relation> ?uri  . }", "question": "Listar os parentes do governador de Gabriel Slaughter?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_1 .<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_1 .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?u_1 .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}], "id": "3967", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?uri. <http://dbpedia.org/resource/Space_Shuttle> <http://dbpedia.org/ontology/manufacturer> ?uri . }", "question": "Quem fabricou o Delta III e o \u00f4nibus espacial?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "1681", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quantas empresas foram fundadas no Texas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Shaheed_Minar,_Kolkata> <http://dbpedia.org/ontology/architecturalStyle> ?u_0", "target_var": "?u_0"}], "id": "4834", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shaheed_Minar,_Kolkata> <http://dbpedia.org/ontology/architecturalStyle> ?uri } ", "question": "Qual \u00e9 o estilo de arquitetura de Shaheed Minar, Calcut\u00e1?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1443", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Go_(programming_language)> <http://dbpedia.org/ontology/developer> ?uri. <http://dbpedia.org/resource/X_(company)> <http://dbpedia.org/property/predecessor> ?uri} ", "question": "Qual desenvolvedor do Go tamb\u00e9m foi o predecessor do X Compnay?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3243", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/United_States_Congress> <http://dbpedia.org/property/houses> ?uri } ", "question": "Listar todas as casas do Congresso dos Estados Unidos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3836", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Seewoosagur_Ramgoolam> . ?x <http://dbpedia.org/property/broadcastArea> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BroadcastNetwork>}", "question": "Onde a emissora cofundada pela Seewoosagur Ramgoolam exibe seus programas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1179", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> . ?uri <http://dbpedia.org/property/os> <http://dbpedia.org/resource/PlayStation_3_system_software>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}", "question": "Nomeie o aparelho produzido pela Foxconn e seu sistema operacional \u00e9 fornecido pelo software de sistema do PlayStation 3?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2798", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Patr\u00edcia_Amorim> . ?x <http://dbpedia.org/property/name> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsSeason>}", "question": "Quais times participam das temporadas comandadas por Patricia Amorim?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1692", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/Bradenton,_Florida> . ?x <http://dbpedia.org/property/architect> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem foi o arquiteto do est\u00e1dio atualmente administrado por Brandenton?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3956", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Side_Elevated_Railroad> <http://dbpedia.org/ontology/operatedBy> ?uri } ", "question": "quem opera a ferrovia elevada do lado sul?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "372", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Cite algumas empresas fundadas no Texas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Khok_Kwang> <http://dbpedia.org/ontology/timeZone> ?u_0", "target_var": "?u_0"}], "id": "3610", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Khok_Kwang> <http://dbpedia.org/ontology/timeZone> ?uri } ", "question": "Em que fuso hor\u00e1rio Khok Kwang se encontra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1916", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Anaheim,_California> . ?x <http://dbpedia.org/property/director> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Quem dirigiu os \u00e1lbuns gravados em Anaheim?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1357", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saint_Joseph> . ?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Mary_(mother_of_Jesus)> . }", "question": "Quem s\u00e3o os pais de S\u00e3o Jos\u00e9 e Maria?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1825", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/University_of_Melbourne_Faculty_of_VCA_and_MCM> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quantos pr\u00eamios foram recebidos por graduados da University of Melbourne, Faculty of VCA e MCM?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "786", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Avalon_Biddle> <http://dbpedia.org/property/currentTeam> ?uri. <http://dbpedia.org/resource/John_McGuinness_(motorcycle_racer)> <http://dbpedia.org/property/currentTeam> ?uri . }", "question": "Qual \u00e9 o nome da equipe atual comum de Avalon biddle e John mcGuinness?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "469", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gaza\u2013Israel_conflict> <http://dbpedia.org/property/result> ?uri. <http://dbpedia.org/resource/Qaqun> <http://dbpedia.org/property/place> ?uri} ", "question": "Qual \u00e9 o resultado do conflito de Gaza. Israel \u00e9 tamb\u00e9m o lugar do Qaqun?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/currency> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_1 <http://dbpedia.org/ontology/currency> ?u_0", "target_var": "?u_1"}], "id": "140", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> . ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> . }", "question": "Onde o Aureus e o Solidus s\u00e3o usados como moeda?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Clark_Daniel_Stearns> <http://dbpedia.org/ontology/militaryBranch> ?u_0", "target_var": "?u_0"}], "id": "788", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Clark_Daniel_Stearns> <http://dbpedia.org/ontology/militaryBranch> ?uri } ", "question": "A qual divis\u00e3o militar pertence Clark Daniel Stearns?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Gervase_Helwys> <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_0"}], "id": "323", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gervase_Helwys> <http://dbpedia.org/ontology/opponent> ?uri } ", "question": "Quem s\u00e3o os oponentes de Gervase Helwys?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "50", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discoverer> <http://dbpedia.org/resource/Johann_Gottfried_Galle> . ?uri <http://dbpedia.org/ontology/discoverer> <http://dbpedia.org/resource/Urbain_Le_Verrier>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Planet>}", "question": "Qual planeta foi descoberto por Johann Gottfired e Urbain Le Verrier?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mickey_Roker> <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Ella_Fitzgerald>", "target_var": "?u_-1"}], "id": "714", "query": "ASK WHERE { <http://dbpedia.org/resource/Mickey_Roker> <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Ella_Fitzgerald> }", "question": "Ella Fitzgerald est\u00e1 associada a Mickey Roker?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4889", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Castro_District,_San_Francisco> . ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Haight-Ashbury> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quem \u00e9 o titular do cargo para os distritos de Castro e Haight-Ashbury?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2840", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/fields> <http://dbpedia.org/resource/Immunology> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais pr\u00eamios foram dados aos imunologistas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4813", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alvin_Bell> <http://dbpedia.org/ontology/college> ?uri. <http://dbpedia.org/resource/Charles_Plosser> <http://dbpedia.org/property/almaMater> ?uri} ", "question": "Qual \u00e9 a alma mater de Alvin Bell e Charles Plosser?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4419", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> ?uri. <http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/property/animator> ?uri} ", "question": "Qual animador de The Skeleton Dance tamb\u00e9m \u00e9 o animador de Tooth de Tommy Tucker?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ben_Wilson_(American_football)> <http://dbpedia.org/ontology/highschool> ?u_0", "target_var": "?u_0"}], "id": "4596", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ben_Wilson_(American_football)> <http://dbpedia.org/ontology/highschool> ?uri } ", "question": "De onde Ben Wilson (futebol americano) tirou seu highscool?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Lena_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Laptev_Sea>", "target_var": "?u_-1"}], "id": "3015", "query": "ASK WHERE { <http://dbpedia.org/resource/Lena_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Laptev_Sea> }", "question": "O rio lena des\u00e1gua no mar de Laptev?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2666", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }", "question": "Cite alguns livros de autores que falam espanhol."}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Long_Island>", "target_var": "?u_0"}], "id": "406", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Long_Island>  . }", "question": "Quantas pessoas famosas nascem em Long Island?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3724", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Maharashtra> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Cite alguns esportes praticados em institui\u00e7\u00f5es de Maharashtra?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/programmeFormat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/programmeFormat> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock> .?u_0 <http://dbpedia.org/ontology/programmeFormat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock> .?u_1 <http://dbpedia.org/ontology/programmeFormat> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock> .?u_0 <http://dbpedia.org/ontology/programmeFormat> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock> .?u_1 <http://dbpedia.org/ontology/programmeFormat> ?u_0", "target_var": "?u_0"}], "id": "1004", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Classic_rock> . ?x <http://dbpedia.org/ontology/programmeFormat> ?uri }", "question": "Quantos outros g\u00eaneros existem de esta\u00e7\u00f5es de r\u00e1dio cujo \u00fanico g\u00eanero \u00e9 Classic rock?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Allama_Matthews> <http://dbpedia.org/ontology/college> ?u_0", "target_var": "?u_0"}], "id": "3787", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Allama_Matthews> <http://dbpedia.org/ontology/college> ?uri } ", "question": "Onde Allama Matthews estudou?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "890", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Funny_Face_(comedian)> <http://dbpedia.org/property/nationality> ?uri. <http://dbpedia.org/resource/Georgina_Theodora_Wood> <http://dbpedia.org/ontology/nationality> ?uri} ", "question": "Qual \u00e9 a nacionalidade comum de Funny Face uma comediante e a de Georgina Theodora Wood?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/United_States> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>", "target_var": "?u_0"}], "id": "2545", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/United_States>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>}", "question": "Quantos veteranos est\u00e3o enterrados nos Estados Unidos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Glover_(video_game)> <http://dbpedia.org/ontology/distributor> ?u_0", "target_var": "?u_0"}], "id": "2390", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Glover_(video_game)> <http://dbpedia.org/ontology/distributor> ?uri } ", "question": "nome do distribuidor do Glover?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/West_Thurrock> <http://dbpedia.org/ontology/ceremonialCounty> <http://dbpedia.org/resource/Essex>", "target_var": "?u_-1"}], "id": "42", "query": "ASK WHERE { <http://dbpedia.org/resource/West_Thurrock> <http://dbpedia.org/ontology/ceremonialCounty> <http://dbpedia.org/resource/Essex> }", "question": "O thurrock oeste est\u00e1 sob o condado de Essex?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2830", "query": "ASK WHERE { <http://dbpedia.org/resource/European_Go_Federation> <http://dbpedia.org/property/membership> <http://dbpedia.org/resource/Azerbaijan> }", "question": "O Azerbaij\u00e3o \u00e9 membro da European Go Federation?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .?u_1 <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .?u_1 <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .?u_1 <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1 .<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_0 .<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1 .?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?u_1 .?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}], "id": "3965", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?uri. <http://dbpedia.org/resource/Ryan_Powell_(lacrosse)> <http://dbpedia.org/ontology/team> ?uri . }", "question": "Em qual time Michael e Ryan Powell jogaram?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "303", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Prime_Time_Entertainment_Network>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cuja rede \u00e9 Prime Time Entertainment Network?"}]