[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/producer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_1 <http://dbpedia.org/property/producer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/producer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/producer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_1 <http://dbpedia.org/property/producer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/producer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/producer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_0 <http://dbpedia.org/property/producer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/producer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> .?u_0 <http://dbpedia.org/property/producer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}], "id": "3431", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/James_Horner> . ?x <http://dbpedia.org/property/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quem produziu filmes com trilha sonora de James Horner?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1506", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/Warner_Bros.> . ?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Qual filme produzido por Michael Deeley foi distribu\u00eddo pela Warner Bros?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1923", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Rohan_Marley> . ?uri <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Sharon_Marley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Diga o nome da pessoa cuja filha \u00e9 Rohan Marley e tamb\u00e9m de outra crian\u00e7a chamada Sharon Marley?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4128", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/April_Stewart> . ?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/Eliza_Schneider> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual o nome do programa de televis\u00e3o dublado por April Stewart e Eliza Schneider?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2528", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/placeOfDeath> ?uri  . }", "question": "Conte os diferentes lugares onde as pessoas morreram, que nasceram na Inglaterra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4969", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/battles> <http://dbpedia.org/resource/Battle_of_the_Bulge> . ?x <http://dbpedia.org/ontology/relation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryPerson>}", "question": "Quais s\u00e3o alguns parentes dos veteranos de Battle of the Bulge?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1 .<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1 .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?u_0 .<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?u_1 .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}], "id": "2789", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Y-block_engine> <http://dbpedia.org/ontology/manufacturer> ?uri. <http://dbpedia.org/resource/Ford_SHO_V8_engine> <http://dbpedia.org/ontology/manufacturer> ?uri . }", "question": "Quem fez o motor de bloco Y e o motor SHO V8?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "361", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/Blizzard_Entertainment> . ?x <http://dbpedia.org/property/genre> ?uri  . }", "question": "Quantos g\u00eaneros de jogos diferentes s\u00e3o produzidos pela Blizzard?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Kenthurst,_New_South_Wales>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TennisPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Kenthurst,_New_South_Wales> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TennisPlayer>", "target_var": "?u_0"}], "id": "2183", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Kenthurst,_New_South_Wales>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TennisPlayer>}", "question": "Quais jogadores de t\u00eanis vivem em Kenthurst, nova Gales do Sul?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1134", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_Gregory_I> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Edwin_of_Northumbria> <http://dbpedia.org/property/veneratedIn> ?uri . }", "question": "Em que religi\u00f5es o Papa Greg\u00f3rio 1 e Edwin da Nort\u00fambria reverraram?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ridgewood,_New_Jersey>", "target_var": "?u_0"}], "id": "3880", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ridgewood,_New_Jersey>  . }", "question": "Quantas coisas est\u00e3o localizadas em Ridgewood, New Jersey?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Shaun_the_Sheep> <http://dbpedia.org/ontology/executiveProducer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Shaun_the_Sheep> <http://dbpedia.org/ontology/executiveProducer> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Shaun_the_Sheep> <http://dbpedia.org/ontology/executiveProducer> ?u_1", "target_var": "?u_1"}], "id": "1830", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shaun_the_Sheep> <http://dbpedia.org/ontology/executiveProducer> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Qual pr\u00eamio foi ganho pelo produtor executivo de Shaun the Sheep?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1053", "query": "ASK WHERE { <http://dbpedia.org/resource/Altazor> <http://dbpedia.org/property/illustrator> <http://dbpedia.org/resource/Pablo_Picasso> }", "question": "O altazor foi desenhado por Picasso?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/SR_class_3Sub> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}], "id": "22", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SR_class_3Sub> <http://dbpedia.org/ontology/operator> ?uri } ", "question": "Qual \u00e9 o operador da classe SR 3Sub?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2066", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Edward_J._Perkins> <http://dbpedia.org/ontology/president> ?uri. <http://dbpedia.org/resource/Clinton_Foundation> <http://dbpedia.org/property/keyPeople> ?uri} ", "question": "Qual pessoa-chave da Funda\u00e7\u00e3o Clinton tamb\u00e9m \u00e9 o presidente de Edward J. Perkins?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1653", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mother> <http://dbpedia.org/resource/Cleopatra_V_of_Egypt> . ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Ptolemy_XIV_of_Egypt>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Qual \u00e9 o nome da realeza cuja filha era Cle\u00f3patra V e era casada com Ptolomeu XIV do Egito?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jeff_Conaway>", "target_var": "?u_0"}], "id": "2587", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jeff_Conaway>  . }", "question": "Quantas vezes Jeff Conaway foi escalado?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Miss_Michigan_USA>", "target_var": "?u_0"}], "id": "3210", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/Miss_Michigan_USA>  . }", "question": "quem s\u00e3o alguns miss michigan usa?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2325", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Regional_Radio_Sports_Network> <http://dbpedia.org/property/affiliations> ?uri } ", "question": "A que est\u00e1 associada a rede regional de r\u00e1dio esportiva?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1067", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Roger_Barton_(film_editor)> . ?uri <http://dbpedia.org/ontology/portrayer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "O retratador de qual personagem fict\u00edcio foi editado por Roger Barton?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Sapindales>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Sapindales> .?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Sapindales>", "target_var": "?u_1"}], "id": "87", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Sapindales> . ?uri <http://dbpedia.org/ontology/ingredient> ?x  . }", "question": "O que pode ser cozinhado com coisas pertencentes \u00e0 ordem Sapindales?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1430", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Miguel_Garc\u00eda_Granados> <http://dbpedia.org/property/children> ?x . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . }", "question": "Qual \u00e9 a naturalidade dos filhos de Miguel Garca Granados?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2647", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sylvain_L\u00e9vi> <http://dbpedia.org/property/fields> ?uri } ", "question": "Listar os campos de Sylvain Lvi?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "282", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Victor_Hope,_2nd_Marquess_of_Linlithgow> <http://dbpedia.org/property/primeminister> ?uri } ", "question": "Liste os primeiros ministros de Victor Hope, 2\u00ba Marqu\u00eas de Linlithgow?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "462", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Manchester_Airport> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>}", "question": "Para onde voam as companhias a\u00e9reas com guarni\u00e7\u00f5es no aeroporto de Manchester?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television> .?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television> .?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television> .?u_0 <http://dbpedia.org/property/company> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television> .?u_1 <http://dbpedia.org/property/company> ?u_0", "target_var": "?u_1"}], "id": "212", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Paramount_Domestic_Television> . ?uri <http://dbpedia.org/property/company> ?x  . }", "question": "O que tudo pertence a uma empresa cuja divis\u00e3o \u00e9 a Paramount Domestic Television?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2499", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/I_Love_How_You_Love_Me> <http://dbpedia.org/property/language> ?uri } ", "question": "Diga o nome de I Love How You Love Me?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/University_of_Edinburgh>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/University_of_Edinburgh> .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> <http://dbpedia.org/resource/University_of_Edinburgh>", "target_var": "?u_1"}], "id": "1368", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/education> <http://dbpedia.org/resource/University_of_Edinburgh> . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . }", "question": "Contar o n\u00famero de lugares onde morreram alumini da Universidade de Edimburgo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "234", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Thomas_Meehan_(writer)> . ?x <http://dbpedia.org/property/label> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Qual gravadora lan\u00e7ou o filme escrito por Thomas Meehan?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2770", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Indy_PopCon> <http://dbpedia.org/property/venue> ?uri } ", "question": "Qual \u00e9 o local da Indy PopCon?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Dalma_Kov\u00e1cs> <http://dbpedia.org/ontology/associatedMusicalArtist> ?u_0", "target_var": "?u_0"}], "id": "597", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dalma_Kov\u00e1cs> <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri } ", "question": "Quem s\u00e3o os artistas musicais associados de Dalma Kovcs?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4420", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wickramabahu_Central_College_(National_School)> <http://dbpedia.org/property/religiousAffiliation> ?uri. <http://dbpedia.org/resource/Vesak> <http://dbpedia.org/ontology/type> ?uri} ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o religiosa comum do Wickramabahu Central College (National School) e a de Vesak?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2250", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Harvard-Westlake_School> . ?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Adrian_A._Basora>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Diga o nome de uma pessoa cujo sucessor foi Adrian A. basora e foi educado na Harvard-Westlake School?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?u_0", "target_var": "?u_0"}], "id": "4031", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?uri } ", "question": "Diga o nome de Chandra Shekhar para a outra parte?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cinematography> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cinematography> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "2283", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/cinematography> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes tiveram um diretor de fotografia que morreu nos EUA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "662", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Ultimate_Fighter:_Brazil_2> <http://dbpedia.org/ontology/subsequentWork> ?x . ?x <http://dbpedia.org/property/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais cidades estavam no programa de TV que veio depois de The Ultimate Fighter: Brazil 2?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4963", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Le_Cirque:_A_Table_in_Heaven> <http://dbpedia.org/property/starring> ?uri. <http://dbpedia.org/resource/Maryanne_Trump_Barry> <http://dbpedia.org/ontology/relation> ?uri} ", "question": "Que ator do Le Cirque \u00e9 parente de Maryanne Trump Barry?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2285", "query": "ASK WHERE { <http://dbpedia.org/resource/Stanley_Cavell> <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/William_Shakespeare> }", "question": "Stanley Cavell estuda Shakespeare?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4716", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Producers_(2005_film)> <http://dbpedia.org/property/label> ?uri } ", "question": "Quem \u00e9 o selo dos Produtores (filme de 2005)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3193", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/LoDaisKa_Site> <http://dbpedia.org/ontology/nearestCity> ?uri. <http://dbpedia.org/resource/Oskar_Blues_Brewery> <http://dbpedia.org/property/location> ?uri} ", "question": "Em qual cidade mais pr\u00f3xima de LoDaisKa Site tamb\u00e9m fica a Oskar Blues Brewery?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Field_marshal>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Field_marshal> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Field_marshal>", "target_var": "?u_1"}], "id": "2503", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Field_marshal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Contar o n\u00famero de religi\u00f5es diferentes que os marechais de campo seguiram?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4043", "query": "ASK WHERE { <http://dbpedia.org/resource/Beth_Tweddle> <http://dbpedia.org/property/club> <http://dbpedia.org/resource/City_of_Liverpool_Gymnastics_Club> }", "question": "Beth Tweddle joga no clube de ginasta da cidade de Liverpool?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "779", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Conte os pr\u00eamios dados aos destinat\u00e1rios do fundo Becket para a liberdade religiosa."}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}], "id": "4019", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?uri } ", "question": "Qual rio passa pelo centro de Washington?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3426", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/narrated> <http://dbpedia.org/resource/Alan_Barzman> . ?x <http://dbpedia.org/property/narrated> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Listar todos os narradores dos \u00e1lbuns que tiveram Alan Barzman como um dos narradores?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4306", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Saint-Amand-en-Puisaye> . ?x <http://dbpedia.org/property/knownFor> ?uri  . }", "question": "As pessoas nascidas em Saint-Amand-en-Puisaye s\u00e3o famosas por que coisas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3196", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/European_Border_and_Coast_Guard> <http://dbpedia.org/property/jurisdiction> ?uri. <http://dbpedia.org/resource/European_School,_Karlsruhe> <http://dbpedia.org/property/founder> ?uri} ", "question": "Que fundador da Escola Europeia, karlsruhe \u00e9 tamb\u00e9m a jurisdi\u00e7\u00e3o da Fronteira Europeia da Guarda Costeira?"}]