[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_0 <http://dbpedia.org/ontology/residence> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_0 <http://dbpedia.org/ontology/residence> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> .?u_1 <http://dbpedia.org/ontology/residence> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "3820", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/Bachelor_of_Arts> . ?x <http://dbpedia.org/ontology/residence> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Em quantos lugares posso encontrar pessoas cuja alma mater foi bacharel em artes?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1963", "query": "ASK WHERE { <http://dbpedia.org/resource/Madiswil> <http://dbpedia.org/property/neighboringMunicipalities> <http://dbpedia.org/resource/Gutenburg,_Switzerland> }", "question": "Gutenberg \u00e9 vizinho de Madiswil?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4732", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/U.S._Route_59_in_Texas> <http://dbpedia.org/property/junction> ?uri. <http://dbpedia.org/resource/U.S._Route_59> <http://dbpedia.org/property/junction> ?uri . }", "question": "Liste os cruzamentos que ficam na US Route 59 no Texas e na US Route 59?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mr._Jim's_Pizza> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Pizza>", "target_var": "?u_-1"}], "id": "348", "query": "ASK WHERE { <http://dbpedia.org/resource/Mr._Jim's_Pizza> <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Pizza> }", "question": "O Sr. Jim&#39;s Pizza atua na ind\u00fastria de pizza?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/South_Park:_The_Stick_of_Truth> <http://dbpedia.org/ontology/writer> ?u_0", "target_var": "?u_0"}], "id": "2246", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Park:_The_Stick_of_Truth> <http://dbpedia.org/ontology/writer> ?uri } ", "question": "Diga o nome do escritor de South Park: The Stick of Truth?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4166", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Torrey_Pines_Gliderport> <http://dbpedia.org/property/owner> ?uri } ", "question": "Quem \u00e9 o dono do Torrey Pines Gliderport?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1709", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_Streetcar_Named_Desire_(play)> <http://dbpedia.org/property/writer> ?uri } ", "question": "Quem escreveu um bonde chamado desejo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "519", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/If_(band)> . ?x <http://dbpedia.org/property/label> ?uri  . }", "question": "Qual \u00e9 o r\u00f3tulo das coisas produzidas pela banda If?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4308", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Winston_Bryant> <http://dbpedia.org/property/governor> ?uri } ", "question": "Liste o governador de Winston Bryant?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2477", "query": " SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Danny_Elfman> . ?uri <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Tim_Burton> } ", "question": "Conte os filmes dirigidos por Tim Burton e o compositor Danny Elfman?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1083", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Erik_Jendresen> . ?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/Playtone>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Erik Jendresen \u00e9 o escritor e o Play tone \u00e9 a companhia de qual programa de TV?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Spider-Man:_Edge_of_Time> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/PlayStation_2>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/PlayStation_2> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Spider-Man:_Edge_of_Time> <http://dbpedia.org/ontology/developer> ?u_0 .<http://dbpedia.org/resource/PlayStation_2> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_0"}], "id": "4778", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Spider-Man:_Edge_of_Time> <http://dbpedia.org/ontology/developer> ?uri. <http://dbpedia.org/resource/PlayStation_2> <http://dbpedia.org/ontology/successor> ?uri} ", "question": "Qual desenvolvedor de Spider-Man: Edge of Time \u00e9 o sucessor do PlayStation 2?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4509", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Earl_B._Ruth> <http://dbpedia.org/property/appointer> ?uri } ", "question": "Quem \u00e9 o apontador de Earl B. Ruth?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1294", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Labour_Party_(Norway)> <http://dbpedia.org/property/leader> ?x . ?x <http://dbpedia.org/property/constituency> ?uri  . }", "question": "Qual \u00e9 o c\u00edrculo eleitoral do l\u00edder do Partido Trabalhista (Noruega)?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1809", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Lori_Black> . ?uri <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Harvard-Westlake_School>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o titular do cargo que tem um filho chamado lori Black e a escola Harvard Westlake como um do instituto educacional?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "791", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Samuel_Isham> <http://dbpedia.org/property/education> ?uri } ", "question": "A quais institui\u00e7\u00f5es de ensino Samuel Isham est\u00e1 associado?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1855", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/National_League> <http://dbpedia.org/property/champion> ?uri } ", "question": "Nomeie o campe\u00e3o da Liga Nacional?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4757", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Europe> . ?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Oulu>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>}", "question": "Em que mar europeu Oulu \u00e9 uma das cidades costeiras?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1980", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steve_Ontiveros_(infielder)> <http://dbpedia.org/property/debutteam> ?uri. <http://dbpedia.org/resource/Ramiro_Pe\u00f1a> <http://dbpedia.org/ontology/team> ?uri} ", "question": "Qual foi o time em que Ramiro Pea jogou, que tamb\u00e9m foi o primeiro time de Steve Ontiveros?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Tony_Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/awards> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Tony_Award> .?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1 .?u_1 <http://dbpedia.org/property/awards> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Tony_Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Tony_Award> .?u_1 <http://dbpedia.org/property/awards> ?u_0", "target_var": "?u_0"}], "id": "3233", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Tony_Award> . ?x <http://dbpedia.org/property/awards> ?uri }", "question": "Liste o n\u00famero total de pr\u00eamios dos musicais que ganharam o Tony Award?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3908", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vargas_(state)> . ?x <http://dbpedia.org/property/debutteam> ?uri  . }", "question": "Qual \u00e9 o time de estreia de pessoas nascidas em Vargas?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Jordan_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Golan_Heights>", "target_var": "?u_-1"}], "id": "3328", "query": "ASK WHERE { <http://dbpedia.org/resource/Jordan_River> <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/Golan_Heights> }", "question": "O rio Jord\u00e3o come\u00e7a nas Colinas de Gol\u00e3?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Battle_of_France>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Battle_of_France> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Battle_of_France>", "target_var": "?u_1"}], "id": "1530", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Battle_of_France> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Conte os pr\u00eamios recebidos por quem lutou na batalha da Fran\u00e7a?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1410", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Henry_Hyde> <http://dbpedia.org/ontology/militaryBranch> ?uri } ", "question": "Liste o ramo militar de Henry Hyde?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4294", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Maike_Evers> <http://dbpedia.org/ontology/ethnicity> ?uri. <http://dbpedia.org/resource/Theodor_Hillenhinrichs> <http://dbpedia.org/ontology/stateOfOrigin> ?uri} ", "question": "Qual \u00e9 a etnia dos Maike Evers e o estado de origem dos Theodor Hillenhinrichs?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Dallas_Cowboys>", "target_var": "?u_0"}], "id": "4648", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Dallas_Cowboys>  . }", "question": "Quantas pessoas jogam pelo Dallas Cowboys?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "83", "query": "ASK WHERE { <http://dbpedia.org/resource/Reza_Amrollahi> <http://dbpedia.org/property/birthplace> <http://dbpedia.org/resource/Iran> }", "question": "Reza Amrollahi nasceu no Ir\u00e3?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2350", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Chess_Monthly> <http://dbpedia.org/property/discipline> ?uri. <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?uri} ", "question": "Quais esportes da Universidade Polit\u00e9cnica das Filipinas Taguig s\u00e3o a disciplina do The Chess Monthly?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "20", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Samur\u2013Absheron_channel> <http://dbpedia.org/ontology/sourceCountry> ?uri. <http://dbpedia.org/resource/Anar_Salmanov> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Em que pa\u00eds de origem do canal SamurAbsheron nasceu Anar Salmanov?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2795", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Madden_Football_'92> <http://dbpedia.org/property/designer> ?uri } ", "question": "Quem foi o designer de john madden Football &#39;92?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4572", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Chicago> . ?uri <http://dbpedia.org/property/editor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Magazine>}", "question": "D\u00ea-me todas as revistas cujos editores moram em Chicago?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Donald_Wilson_(writer_and_producer)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Donald_Wilson_(writer_and_producer)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "3093", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Donald_Wilson_(writer_and_producer)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o criados por Donald Wilson?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Colonel_(United_States)>", "target_var": "?u_0"}], "id": "3155", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/rank> <http://dbpedia.org/resource/Colonel_(United_States)>  . }", "question": "Contar todos os coron\u00e9is?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hudson_River> <http://dbpedia.org/ontology/leftTributary> <http://dbpedia.org/resource/Croton_River>", "target_var": "?u_-1"}], "id": "973", "query": "ASK WHERE { <http://dbpedia.org/resource/Hudson_River> <http://dbpedia.org/ontology/leftTributary> <http://dbpedia.org/resource/Croton_River> }", "question": "O rio croton flui para o hudson?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1710", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Metro_Manila> . ?x <http://dbpedia.org/property/athletics> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Que esportes podem ser praticados nas universidades da regi\u00e3o metropolitana de Manila?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Sam_Keller> <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jim_McMillin> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sam_Keller> <http://dbpedia.org/ontology/formerTeam> ?u_0 .<http://dbpedia.org/resource/Jim_McMillin> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}], "id": "3201", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sam_Keller> <http://dbpedia.org/ontology/formerTeam> ?uri. <http://dbpedia.org/resource/Jim_McMillin> <http://dbpedia.org/ontology/team> ?uri . }", "question": "Por qual time Sam Keller e Jim McMilin jogaram?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_0"}], "id": "4371", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Ontario>  . }", "question": "O que tem localiza\u00e7\u00e3o como Ont\u00e1rio?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Juno_I> <http://dbpedia.org/ontology/launchSite> ?u_0", "target_var": "?u_0"}], "id": "4819", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juno_I> <http://dbpedia.org/ontology/launchSite> ?uri } ", "question": "De onde o Juno I foi lan\u00e7ado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1098", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/\u00c6thelred_the_Unready> . ?x <http://dbpedia.org/property/veneratedIn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Em que seitas era venerado o aristocrata, cujo pai \u00e9 Thelred, o Desprezado?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4161", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/United_States_House_of_Representatives_elections_in_Ohio,_2010> <http://dbpedia.org/property/incumbent> ?uri } ", "question": "Quem ganhou a C\u00e2mara dos Deputados de Ohio em 2010?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2844", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chinga_Chang_Records> <http://dbpedia.org/ontology/distributingLabel> ?uri. <http://dbpedia.org/resource/StandBy_Records> <http://dbpedia.org/ontology/distributingLabel> ?uri . }", "question": "Qual \u00e9 o selo de distribui\u00e7\u00e3o comum da Chinga Chang Records e da StandBy Records?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "886", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gene_Conley> <http://dbpedia.org/property/draftTeam> ?uri } ", "question": "Qual \u00e9 o draft da equipe de Gene Conley?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4931", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1967_Mexican_Grand_Prix> <http://dbpedia.org/property/firstTeam> ?uri. <http://dbpedia.org/resource/1971_United_States_Grand_Prix> <http://dbpedia.org/property/firstTeam> ?uri . }", "question": "Qual foi a primeira equipe comum no Grande Pr\u00eamio do M\u00e9xico de 1967 e nos Estados Unidos de 1971?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> .?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden>", "target_var": "?u_1"}], "id": "3678", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> . ?x <http://dbpedia.org/ontology/ingredient> ?uri  . }", "question": "Quais s\u00e3o alguns ingredientes comuns usados em pratos suecos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rheinmetall_MG_60> <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}], "id": "4580", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rheinmetall_MG_60> <http://dbpedia.org/ontology/origin> ?uri } ", "question": "Onde o Rheinmetall MG 60 se originou?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3566", "query": "ASK WHERE { <http://dbpedia.org/resource/Nokia_215> <http://dbpedia.org/property/os> <http://dbpedia.org/resource/Series_30+> }", "question": "O nokia 215 tem o sistema operacional da s\u00e9rie 30+?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland>", "target_var": "?u_0"}], "id": "4401", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland>  . }", "question": "Gregg Toland filmou quantas coisas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Kumta> <http://dbpedia.org/ontology/governmentType> ?u_0", "target_var": "?u_0"}], "id": "515", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kumta> <http://dbpedia.org/ontology/governmentType> ?uri } ", "question": "Que tipo de governo \u00e9 eleito em Kumta?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/ontology/animator> <http://dbpedia.org/resource/Walt_Disney>", "target_var": "?u_-1"}], "id": "737", "query": "ASK WHERE { <http://dbpedia.org/resource/Tommy_Tucker's_Tooth> <http://dbpedia.org/ontology/animator> <http://dbpedia.org/resource/Walt_Disney> }", "question": "Tommy Tucker&#39;s Tooth foi animado por Walt Disney?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1453", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ben_Dreith> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/John_McGeever> <http://dbpedia.org/ontology/team> ?uri . }", "question": "Para qual time John McGeever joga, que tamb\u00e9m contratou Ben Dreith em algum momento?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3971", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/owner> <http://dbpedia.org/resource/Metro-North_Railroad> . ?x <http://dbpedia.org/property/owner> ?uri }", "question": "D\u00ea-me o n\u00famero total de linhas de propriedade do propriet\u00e1rio da Mwtro-Noth Railroad?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4700", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Guido_Guerrini> <http://dbpedia.org/property/currentTeam> ?uri. <http://dbpedia.org/resource/Massimo_Liverani> <http://dbpedia.org/property/currentTeam> ?uri . }", "question": "Por qual time Guido Guerrini e Massimo Liverani jogam atualmente?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2506", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fort_Monroe> <http://dbpedia.org/property/governingBody> ?uri } ", "question": "Qual \u00e9 o \u00f3rg\u00e3o governante de Fort Monroe?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2994", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_\u2013_Bataan> <http://dbpedia.org/ontology/sport> ?uri. <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?uri} ", "question": "Liste os esportes comuns praticados pela Universidade Polit\u00e9cnica das Filipinas Bataan e Jamiatu Muslim Mindanao?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2126", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos programas de televis\u00e3o s\u00e3o transmitidos pela Fox Broadcasting Company?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2926", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Simon_Fuller>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o alguns programas de TV criados por Simon Fuller?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "906", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }", "question": "Quem \u00e9 casado com Tony Ramo"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mediterranean_Basketball_Association> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mediterranean_Basketball_Association> <http://dbpedia.org/ontology/country> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}], "id": "3647", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Mediterranean_Basketball_Association> <http://dbpedia.org/ontology/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Quantos estados fazem parte da Associa\u00e7\u00e3o Mediterr\u00e2nea de Basquete?"}]