[{"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Adventures_of_Huckleberry_Finn>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Redding,_Connecticut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Adventures_of_Huckleberry_Finn> .?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Redding,_Connecticut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Adventures_of_Huckleberry_Finn> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Redding,_Connecticut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Adventures_of_Huckleberry_Finn> .?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Redding,_Connecticut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}], "id": "2378", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/notableWork> <http://dbpedia.org/resource/Adventures_of_Huckleberry_Finn> . ?uri <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Redding,_Connecticut>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Diga o nome do escritor cuja obra not\u00e1vel \u00e9 Adventures of Huckleberry Finn e morreu em Redding, Connecticut?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4323", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Long_rifle> <http://dbpedia.org/property/origin> ?uri. <http://dbpedia.org/resource/Hugh_Scott> <http://dbpedia.org/ontology/residence> ?uri} ", "question": "Qual resid\u00eancia oficial de hugh Scott \u00e9 tamb\u00e9m a origem do Long Rifle?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1105", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/order> <http://dbpedia.org/resource/United_States_Senate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quantos pol\u00edticos existem no Senado dos EUA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1336", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/American_Classical_League> <http://dbpedia.org/property/motto> ?uri. <http://dbpedia.org/resource/Probus_(journal)> <http://dbpedia.org/ontology/academicDiscipline> ?uri} ", "question": "Qual moto da Liga Cl\u00e1ssica americana tamb\u00e9m \u00e9 a disciplina acad\u00eamica do Probus?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_1 <http://dbpedia.org/ontology/majorShrine> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_0 <http://dbpedia.org/ontology/majorShrine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_0 <http://dbpedia.org/ontology/majorShrine> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> .?u_1 <http://dbpedia.org/ontology/majorShrine> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_0"}], "id": "2189", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Debre_Libanos> . ?x <http://dbpedia.org/ontology/majorShrine> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Liste todos os principais santu\u00e1rios dos santos que tem um dos santu\u00e1rios como Debre Libanos?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Japan>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/foundation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Japan> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/foundation> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Japan>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Japan> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/foundation> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/foundation> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/foundation> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/foundation> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}], "id": "4705", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/Japan> . ?uri <http://dbpedia.org/property/label> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Quantas bandas assinaram com gravadoras fundadas no Jap\u00e3o?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Arabian_Peninsula>", "target_var": "?u_0"}], "id": "3710", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Arabian_Peninsula>  . }", "question": "Quantos reis e rainhas morreram na Pen\u00ednsula Ar\u00e1bica?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4848", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bloomington_Viaduct> <http://dbpedia.org/property/crosses> ?uri } ", "question": "O que o viaduto de Bloomington foi constru\u00eddo para atravessar?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Cape_Town>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}], "id": "4325", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Cape_Town>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quantos pol\u00edticos residem na Cidade do Cabo?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>", "target_var": "?u_0"}], "id": "2694", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Quantos jogos s\u00e3o lan\u00e7ados para consoles virtuais?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1422", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/builder> <http://dbpedia.org/resource/Soares_da_Costa> . ?x <http://dbpedia.org/ontology/crosses> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Saores de costa construiu uma ponte sobre que rio?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2651", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Akira_Ifukube>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Em que filmes Akira Ifukube comp\u00f4s a m\u00fasica?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4155", "query": "ASK WHERE { <http://dbpedia.org/resource/National_Endowment_for_the_Arts> <http://dbpedia.org/property/jurisdiction> <http://dbpedia.org/resource/Federal_government_of_the_United_States> }", "question": "O patrim\u00f4nio nacional de artes est\u00e1 sob a jurisdi\u00e7\u00e3o do governo federal dos EUA?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rainbow_Warrior_(1955)> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}], "id": "1464", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rainbow_Warrior_(1955)> <http://dbpedia.org/ontology/operator> ?uri } ", "question": "Quem \u00e9 o operador de Rainbow Warrior (1955)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "874", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Other_Side_(The_Outer_Limits)> <http://dbpedia.org/property/guests> ?uri } ", "question": "Liste os convidados do show The Other Side (The Outer Limits)?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3339", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elizabeth_of_Rhuddlan> <http://dbpedia.org/property/placeOfBurial> ?uri. <http://dbpedia.org/resource/Isabel_of_Cambridge,_Countess_of_Essex> <http://dbpedia.org/property/placeOfBurial> ?uri . }", "question": "Qual \u00e9 a localiza\u00e7\u00e3o comum da tumba de Elizabeth de Rhuddlan e Isabel de Cambridge?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/George_M._Chilcott> <http://dbpedia.org/property/state> ?u_0", "target_var": "?u_0"}], "id": "4340", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_M._Chilcott> <http://dbpedia.org/property/state> ?uri } ", "question": "A que estado pertence Eorge M. Chilcott?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2348", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eristoff> <http://dbpedia.org/property/manufacturer> ?uri. <http://dbpedia.org/resource/Bombay_Sapphire> <http://dbpedia.org/property/distributor> ?uri} ", "question": "Qual produtor do Eristoff tamb\u00e9m \u00e9 distribuidor do Bombay Sapphire?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/archipelago> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/archipelago> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_0 <http://dbpedia.org/property/archipelago> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_0 <http://dbpedia.org/property/archipelago> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>", "target_var": "?u_0"}], "id": "840", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Pacific_Ocean> . ?uri <http://dbpedia.org/property/archipelago> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island>}", "question": "Quantas ilhas pertencem a arquip\u00e9lagos localizados no Pac\u00edfico?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_0 .<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_0 .?u_1 <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_0 .?u_1 <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_0 .<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_0 .?u_1 <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_1 .<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_0 .<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?u_1 .?u_0 <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?u_1 .?u_0 <http://dbpedia.org/ontology/chairman> ?u_1", "target_var": "?u_1"}], "id": "4568", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/chairman> ?uri. <http://dbpedia.org/resource/Fort_Lauderdale_Strikers> <http://dbpedia.org/ontology/chairman> ?uri . }", "question": "Quem foi o presidente do Fort Lauderdale Strikers e tamb\u00e9m da temporada 2015 do Fort Lauderdale Strikers?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "581", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Creatures_(company)> . ?uri <http://dbpedia.org/property/composer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Quais s\u00e3o alguns videogames cuja m\u00fasica \u00e9 composta por um funcion\u00e1rio da empresa Creatures?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2015_Argentine_Primera_Divisi\u00f3n>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/youthclubs> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2015_Argentine_Primera_Divisi\u00f3n> .?u_1 <http://dbpedia.org/property/youthclubs> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2015_Argentine_Primera_Divisi\u00f3n>", "target_var": "?u_1"}], "id": "204", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/season> <http://dbpedia.org/resource/2015_Argentine_Primera_Divisi\u00f3n> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Quem esteve nos clubes juvenis que estiveram na temporada 2015 da Primera Division Argentina?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>", "target_var": "?u_0"}], "id": "1641", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/commandStructure> <http://dbpedia.org/resource/United_States_Department_of_the_Navy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryUnit>}", "question": "Quantas unidades seguem a estrutura de comando do Departamento da Marinha dos EUA?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2014", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kenya_national_under-20_football_team> <http://dbpedia.org/property/homeStadium> ?uri } ", "question": "Qual \u00e9 o nome da sele\u00e7\u00e3o nacional de futebol sub-20 do Est\u00e1dio do Qu\u00eania?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "905", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arthur_A._Ross> <http://dbpedia.org/property/placeOfBirth> ?uri. <http://dbpedia.org/resource/Edward_Niesen> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "De que cidade v\u00eam Arthur Ross e Edward Niesen?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "631", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Pugh> <http://dbpedia.org/property/associatedActs> ?uri. <http://dbpedia.org/resource/Alana_Stewart> <http://dbpedia.org/ontology/spouse> ?uri} ", "question": "Qual s\u00f3cio de Martin Pugh tamb\u00e9m \u00e9 casado com Alana Stewert?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/youthclubs> <http://dbpedia.org/resource/Newell's_Old_Boys>", "target_var": "?u_0"}], "id": "3364", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/youthclubs> <http://dbpedia.org/resource/Newell's_Old_Boys>  . }", "question": "Quantas pessoas jogaram no Newell&#39;s Old Boys?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1974", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Panathinaikos_F.C.> <http://dbpedia.org/ontology/owner> ?x . ?x <http://dbpedia.org/property/residence> ?uri  . }", "question": "Onde moram os acionistas do Pathaninaikos FC?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chris_Marve> <http://dbpedia.org/ontology/school> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Neria_Douglass> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chris_Marve> <http://dbpedia.org/ontology/school> ?u_0 .<http://dbpedia.org/resource/Neria_Douglass> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}], "id": "162", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chris_Marve> <http://dbpedia.org/ontology/school> ?uri. <http://dbpedia.org/resource/Neria_Douglass> <http://dbpedia.org/ontology/almaMater> ?uri} ", "question": "Qual \u00e9 a escola comum de Chris Marve e Neria Douglass?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3172", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }", "question": "D\u00ea-me a contagem do artista na empresa cujo Artista \u00e9 Jean-Fran\u00e7ois Cot\u00e9?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/currentMembers> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/currentMembers> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}], "id": "3612", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Fender_Stratocaster> . ?uri <http://dbpedia.org/property/currentMembers> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Quantas bandas t\u00eam membros atualmente tocando na Fender Stratocaster?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4675", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/2013_Central_American_Games> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem construiu os est\u00e1dios que foram alugados pelos jogos da Am\u00e9rica Central de 2013?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> .?u_1 <http://dbpedia.org/ontology/foundationPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas>", "target_var": "?u_1"}], "id": "617", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> . ?uri <http://dbpedia.org/ontology/foundationPlace> ?x  . }", "question": "O que foi fundado no estado do qual faz parte o condado de Denton, no Texas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "547", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Clan_McDuck> . ?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "O parente de qual personagem fict\u00edcio \u00e9 o cl\u00e3 McDuck e pertence ao pato americano Pekin?"}]