[{"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4538", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Regional_Transit_Authority_of_Southeast_Michigan> <http://dbpedia.org/property/headquarters> ?uri } ", "question": "Onde fica a sede da Autoridade de Tr\u00e2nsito Regional do Sudeste de Michigan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3352", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Daniel_Bergman> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pelo pai de Daniel Bergmans?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0 .<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_1 <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_1 <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0 .<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_1 <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_1 .<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_1 .?u_0 <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?u_0 .<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?u_1 .?u_0 <http://dbpedia.org/ontology/debutTeam> ?u_1", "target_var": "?u_1"}], "id": "3102", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Dan_Otero> <http://dbpedia.org/ontology/debutTeam> ?uri . }", "question": "Qual \u00e9 a equipe de estreia comum do Butch Metzger e Dan Otero?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language> .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language> .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language> .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language> .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_0"}], "id": "3355", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/ontology/location> ?x  . }", "question": "Recolher e devolver uma lista de coisas na \u00e1rea onde o espanhol \u00e9 usado?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "839", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hafth\u00f3r_J\u00fal\u00edus_Bj\u00f6rnsson> <http://dbpedia.org/ontology/stateOfOrigin> ?uri } ", "question": "De onde \u00e9 Hafthor Julius Bjornsson?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "500", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Que escritores t\u00eam nacionalidade como apatridia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "141", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathCause> <http://dbpedia.org/resource/Cardiovascular_disease> . ?uri <http://dbpedia.org/property/music> ?x  . }", "question": "M\u00fasica para o que foi feito por algu\u00e9m que morreu de uma doen\u00e7a cardiovascular?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Remo>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Remo> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}], "id": "1377", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Remo>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Que m\u00fasicos famosos tocam remo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2144", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Geography_Club_(play)> <http://dbpedia.org/property/place> ?uri. <http://dbpedia.org/resource/The_Kentucky_Cycle> <http://dbpedia.org/property/place> ?uri . }", "question": "Entre qual cidade onde o Geography Club jogou tamb\u00e9m teve o Ciclo de Kenticky?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1138", "query": "ASK WHERE { <http://dbpedia.org/resource/Alberta_Highway_42> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Lousana>  . }", "question": "Lousana fica no final da Rodovia 42 de Alberta?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Basketball>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Basketball>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/athletics> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/athletics> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/athletics> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Basketball>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/Basketball>", "target_var": "?u_0"}], "id": "2927", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Basketball> . ?x <http://dbpedia.org/property/athletics> ?uri }", "question": "Contar o n\u00famero de esportes praticados pelas universidades cujo um dos esportes \u00e9 o baketball?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1787", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/doctoralAdvisor> <http://dbpedia.org/resource/John_Robert_Woodyard> . ?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Lovelace_Medal>  . }", "question": "Entre os vencedores da medalha Lovelace, quem tem John Robert como orientador de doutorado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3484", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/New_Mexico> . }", "question": "Que coisas fundaram lugar como Estados Unidos e Novo M\u00e9xico?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/format> <http://dbpedia.org/resource/5.1_surround_sound>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/format> <http://dbpedia.org/resource/5.1_surround_sound> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "550", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/format> <http://dbpedia.org/resource/5.1_surround_sound>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais programas de televis\u00e3o t\u00eam formato de som surround 5.1?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/He's_a_Liar>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?u_0 .?u_0 <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/He's_a_Liar>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/He's_a_Liar> .?u_0 <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?u_1 .?u_1 <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/He's_a_Liar>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/He's_a_Liar> .?u_1 <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_0"}], "id": "4906", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/He's_a_Liar> <http://dbpedia.org/ontology/subsequentWork> ?x . ?x <http://dbpedia.org/ontology/producer> ?uri  . }", "question": "Quem \u00e9 o produtor do single que foi o trabalho subsequente de Hehe a Liar?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2019", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Good_Hair> <http://dbpedia.org/property/starring> ?x . ?x <http://dbpedia.org/ontology/influencedBy> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Comedian>}", "question": "Liste as pessoas que influenciaram o comediante que atuou em Good Hair?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_0 <http://dbpedia.org/property/destinations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_1"}], "id": "948", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Birmingham_Airport> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>}", "question": "Para quais outros locais as companhias a\u00e9reas t\u00eam voos, que tamb\u00e9m voam para Birmingham?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2600", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Simon_Fuller> . ?uri <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de televis\u00e3o cujo criador \u00e9 Simon Fuller e apresentado por Ryan Seacrest?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "532", "query": "ASK WHERE { <http://dbpedia.org/resource/Westchester_Avenue> <http://dbpedia.org/property/counties> <http://dbpedia.org/resource/The_Bronx> }", "question": "A Westchester Avenue cai sob o Bronx?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)>", "target_var": "?u_1"}], "id": "1829", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> . ?x <http://dbpedia.org/ontology/recordedIn> ?uri  . }", "question": "Em quantos lugares o Garbage gravou suas m\u00fasicas?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/engine> <http://dbpedia.org/resource/V8_engine>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/related> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/related> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/related> <http://dbpedia.org/resource/V8_engine>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/engine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/engine> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/engine> <http://dbpedia.org/resource/V8_engine>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/related> <http://dbpedia.org/resource/V8_engine>", "target_var": "?u_0"}], "id": "2917", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/engine> <http://dbpedia.org/resource/V8_engine> . ?x <http://dbpedia.org/property/related> ?uri  . }", "question": "Quantos carros posso encontrar em rela\u00e7\u00e3o aos carros com motor V8?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Office_(U.S._TV_series)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Office_(U.S._TV_series)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}], "id": "3871", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Office_(U.S._TV_series)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Quantos personagens existem em The Office?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mount_Hoffmann> <http://dbpedia.org/ontology/firstAscentPerson> ?u_0", "target_var": "?u_0"}], "id": "639", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mount_Hoffmann> <http://dbpedia.org/ontology/firstAscentPerson> ?uri } ", "question": "Quem primeiro subiu uma montanha do Monte Hoffmann?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4832", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Steven_Moffat> . ?uri <http://dbpedia.org/property/genre> <http://dbpedia.org/resource/Science_fiction>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual s\u00e9rie de fic\u00e7\u00e3o cient\u00edfica tem Steven Moffat como produtor executivo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "967", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/arena> <http://dbpedia.org/resource/United_Center> . ?uri <http://dbpedia.org/property/team> ?x  . }", "question": "Quem joga pelos times que atuam no centro unido?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4237", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/leader> <http://dbpedia.org/resource/Y._S._Rajasekhara_Reddy> . ?x <http://dbpedia.org/ontology/affiliation> ?uri  . }", "question": "Quantos partidos chegaram ao poder nas elei\u00e7\u00f5es em que YS Rajasekhara Reddy venceu?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Wallace_Dollase> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}], "id": "2697", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wallace_Dollase> <http://dbpedia.org/ontology/deathPlace> ?uri  . }", "question": "Onde Wallace Dollase morreu?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Red_Willow_Creek> <http://dbpedia.org/ontology/state> ?u_0", "target_var": "?u_0"}], "id": "1683", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Red_Willow_Creek> <http://dbpedia.org/ontology/state> ?uri } ", "question": "Em que estado fica Red Willow Creek?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4470", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Amalgamated_Clothing_Workers_of_America> <http://dbpedia.org/ontology/affiliation> ?x . ?x <http://dbpedia.org/property/founded> ?uri  . }", "question": "Quem \u00e9 o fundador do sindicato ao qual a Amalgamated Clothing Workers of America est\u00e1 afiliada?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2342", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/Minneapolis> . ?x <http://dbpedia.org/ontology/operatedBy> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RailwayLine>}", "question": "Quem opera a linha ferrovi\u00e1ria que come\u00e7a em Minneapolis?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://dbpedia.org/ontology/country> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_0 .?u_0 <http://dbpedia.org/ontology/country> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>", "target_var": "?u_1"}], "id": "155", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ikaros_Smederna> <http://dbpedia.org/ontology/league> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SpeedwayLeague>}", "question": "Qual \u00e9 o pa\u00eds da liga de aut\u00f3dromo onde Ikaros Smederna jogou?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}], "id": "2487", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Thud!> <http://dbpedia.org/ontology/nonFictionSubject> ?uri  . }", "question": "Quantos t\u00f3picos de n\u00e3o fic\u00e7\u00e3o Thud! lida com?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?u_0 .<http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?u_0", "target_var": "?u_0"}], "id": "4641", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Moscow-Kazan_high-speed_railway> <http://dbpedia.org/ontology/routeStart> ?uri. <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri} ", "question": "Qual rota da ferrovia de alta velocidade Moscou-Caz\u00e3 ser\u00e1 o est\u00e1dio do FC Spartak Moscou 2011-12?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1089", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Manendragarh> <http://dbpedia.org/ontology/leaderName> ?uri. <http://dbpedia.org/resource/Rishang_Keishing> <http://dbpedia.org/property/party> ?uri} ", "question": "Qual partido de Rishang Keishing \u00e9 o l\u00edder em Manendragarh?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2655", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Argentine_Primera_Divisi\u00f3n> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Quantas pessoas participaram de um clube juvenil que disputou a Primera Division argentina?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jack_Your_Body> <http://dbpedia.org/ontology/musicalArtist> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jack_Your_Body> <http://dbpedia.org/ontology/musicalArtist> ?u_0 .?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_Your_Body> <http://dbpedia.org/ontology/musicalArtist> ?u_1", "target_var": "?u_1"}], "id": "4240", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_Your_Body> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/ontology/hometown> ?uri  . }", "question": "Qual \u00e9 a cidade natal do m\u00fasico de Jack your Body?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "288", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/James_L._McConaughy> <http://dbpedia.org/ontology/governor> ?x . ?x <http://dbpedia.org/property/branch> ?uri  . }", "question": "A que ramo do governo pertence James L. McConaughy?"}]