[{"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1427", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chickasaw_Campaign_of_1736> <http://dbpedia.org/property/combatant> ?uri } ", "question": "De quantas batalhas a Campanha Chickasaw de 1736 consistiu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "325", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leader> <http://dbpedia.org/resource/Jose_Cha_Cha_Jimenez> . ?x <http://dbpedia.org/property/international> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/PoliticalParty>}", "question": "Em que pa\u00eds existe um partido pol\u00edtico cujo l\u00edder \u00e9 Jose Cha Cha Jimenez?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> .?u_1 <http://dbpedia.org/ontology/musicComposer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_1"}], "id": "1051", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/BAFTA_Award_for_Best_Film_Music> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Que compositores de filmes ganharam um BAFTA de m\u00fasica para cinema?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3319", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/affiliations> <http://dbpedia.org/resource/Baltimore_Ravens> . ?x <http://dbpedia.org/ontology/programmeFormat> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>}", "question": "Que tipo de coisa est\u00e1 nas esta\u00e7\u00f5es de r\u00e1dio afiliadas ao Baltimore Ravens?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4721", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Andrew_Schally> <http://dbpedia.org/property/workInstitutions> ?uri. <http://dbpedia.org/resource/WTUL> <http://dbpedia.org/property/owner> ?uri} ", "question": "Qual instituto de trabalho de andrew Schally pertence \u00e0 WTUL?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3864", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri. <http://dbpedia.org/resource/Karakuri_D\u00f4ji_Ultimo> <http://dbpedia.org/ontology/author> ?uri} ", "question": "Quem \u00e9 o autor de Heroman \u00e9 tamb\u00e9m o autor de Karakuri Dji Ultimo?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Greenpeace_Nordic> <http://dbpedia.org/ontology/parentOrganisation> ?u_0", "target_var": "?u_0"}], "id": "1738", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Greenpeace_Nordic> <http://dbpedia.org/ontology/parentOrganisation> ?uri } ", "question": "Qual organiza\u00e7\u00e3o \u00e9 a controladora do Greenpeace Nordic?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1196", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/David_Ian_Salter> } ", "question": "De que tudo foi David Ian Salter editor?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>", "target_var": "?u_0"}], "id": "620", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }", "question": "Quantos"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Essex>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Essex> .?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Essex> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Essex> .?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "2879", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Essex> . ?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/North_Sea>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Diga o nome do rio cuja montanha na foz \u00e9 Essex e a foz do rio \u00e9 o Mar do Norte?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "328", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Korea_Presbyterian_Theological_Seminary> <http://dbpedia.org/property/nickname> ?uri. <http://dbpedia.org/resource/Celal_Bayar_University> <http://dbpedia.org/property/mascot> ?uri} ", "question": "Qual mascote da universidade Celal Bayer tamb\u00e9m \u00e9 o apelido de Semin\u00e1rio Teol\u00f3gico Presbiteriano Coreano?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sourceCountry> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_0 <http://dbpedia.org/ontology/sourceCountry> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sourceCountry> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_0 <http://dbpedia.org/ontology/sourceCountry> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sourceCountry> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_1 <http://dbpedia.org/ontology/sourceCountry> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sourceCountry> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> .?u_1 <http://dbpedia.org/ontology/sourceCountry> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}], "id": "648", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Caspian_Sea> . ?x <http://dbpedia.org/ontology/sourceCountry> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Em quantos pa\u00edses os rios nascem e terminam no Mar C\u00e1spio?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_0 .<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_0 .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_0 .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_0 .<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_0 .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_1 .<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_1 .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?u_0 .<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?u_1 .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}], "id": "897", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?uri. <http://dbpedia.org/resource/Ordnungspolizei> <http://dbpedia.org/ontology/leader> ?uri . }", "question": "Quem \u00e9 o l\u00edder da Kriminalpolizei e Ordnungspolizei?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3882", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Roy_Walker_(production_designer)> <http://dbpedia.org/ontology/award> ?uri. <http://dbpedia.org/resource/Walt_Disney> <http://dbpedia.org/ontology/award> ?uri . }", "question": "Que pr\u00eamio foi dado a Roy Walker e tamb\u00e9m a Walt Disney?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> .?u_0 <http://dbpedia.org/property/destinations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> .?u_1 <http://dbpedia.org/property/destinations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/targetAirport> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/destinations> <http://dbpedia.org/resource/Glasgow_Airport> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/targetAirport> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "1123", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> . ?x <http://dbpedia.org/property/destinations> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "D\u00ea o n\u00famero total de lugares para os quais as companhias a\u00e9reas v\u00e3o, que tamb\u00e9m v\u00e3o para Glasgow?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_0 .<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_0 .<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_0 .?u_1 <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_1 .<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?u_0 .<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?u_1 .?u_0 <http://dbpedia.org/ontology/deathPlace> ?u_1", "target_var": "?u_1"}], "id": "1891", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marina_Pankova> <http://dbpedia.org/ontology/deathPlace> ?uri. <http://dbpedia.org/resource/Viktor_Ulyanich> <http://dbpedia.org/ontology/deathPlace> ?uri . }", "question": "Qual \u00e9 o local da morte de Marina Pankova e Viktor Ulyanich?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/William_Deane> <http://dbpedia.org/ontology/primeMinister> ?u_0", "target_var": "?u_0"}], "id": "4643", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Deane> <http://dbpedia.org/ontology/primeMinister> ?uri  . }", "question": "Quem foi o PM sob o qual William Deane serviu?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4791", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Maryanne_Trump_Barry> <http://dbpedia.org/ontology/relation> ?uri. <http://dbpedia.org/resource/Trump_Entertainment_Resorts> <http://dbpedia.org/ontology/keyPerson> ?uri . }", "question": "Qual l\u00edder do Trump Entertainment Resorts \u00e9 parente de Maryanne Barry?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4529", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/style> <http://dbpedia.org/resource/Truss_bridge> . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Em quais estados posso encontrar pontes Truss?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4234", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Puerto_Rico> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais pr\u00eamios os Puerto Ricons conquistaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1593", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rival> <http://dbpedia.org/resource/Somerset_Berkley_Regional_High_School> . ?x <http://dbpedia.org/ontology/region> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Onde est\u00e1 a escola rival da escola secund\u00e1ria Somerset Berkeley Regional?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2547", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Gold_Base> . ?uri <http://dbpedia.org/ontology/religion> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Contar o n\u00famero de pessoas que seguem uma religi\u00e3o que tem um cargo importante na Gold Base?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4336", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Luther_Hill> <http://dbpedia.org/ontology/profession> ?uri. <http://dbpedia.org/resource/Richard_Coke> <http://dbpedia.org/property/office> ?uri} ", "question": "Qual \u00e9 a profiss\u00e3o do William Luther Hill e tamb\u00e9m o of\u00edcio da Richard Coke?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1023", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Republic_of_China_legislative_election,_2008> <http://dbpedia.org/property/leader> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual \u00e9 a religi\u00e3o do vencedor da elei\u00e7\u00e3o chinesa de 2008?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}], "id": "4988", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quem \u00e9 o pai de Edith Vonnegut e tamb\u00e9m \u00e9 escritora?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1714", "query": "ASK WHERE { <http://dbpedia.org/resource/Charlemagne> <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Antipope_Paschal_III> }", "question": "Carlos Magno foi canonizado pelo antipapa pachal 3?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Midland_College>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Midland_College> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}], "id": "1717", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Midland_College>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Quantos jogadores de basquete estudaram no Midland College?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2850", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/place> <http://dbpedia.org/resource/New_York_City> . ?x <http://dbpedia.org/property/starring> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Play>}", "question": "Quais atores j\u00e1 atuaram em pe\u00e7as apresentadas em Nova York?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hearth_and_Home> <http://dbpedia.org/ontology/editor> ?u_0", "target_var": "?u_0"}], "id": "978", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hearth_and_Home> <http://dbpedia.org/ontology/editor> ?uri } ", "question": "Quem \u00e9 o editor de Hearth and Home?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/series> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS> .?u_1 <http://dbpedia.org/ontology/series> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS> .?u_0 <http://dbpedia.org/ontology/series> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS> .?u_1 <http://dbpedia.org/ontology/series> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS> .?u_0 <http://dbpedia.org/ontology/series> ?u_1", "target_var": "?u_1"}], "id": "4895", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/IOS> . ?x <http://dbpedia.org/ontology/series> ?uri  . }", "question": "Quantas s\u00e9ries de jogos existem para iOS?"}]