[{"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> <http://dbpedia.org/ontology/neighboringMunicipality> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> .<http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> <http://dbpedia.org/ontology/neighboringMunicipality> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> <http://dbpedia.org/ontology/neighboringMunicipality> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> .<http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> <http://dbpedia.org/ontology/neighboringMunicipality> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> .?u_0 <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> .?u_0 <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>", "target_var": "?u_0"}], "id": "2970", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Esther_Alder> . ?uri <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>}", "question": "Nomeie a cidade com l\u00edder como Esther Alder e o munic\u00edpio vizinho como Pregny-Chambsy?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Blade_Runner> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth>", "target_var": "?u_-1"}], "id": "3867", "query": "ASK WHERE { <http://dbpedia.org/resource/Blade_Runner> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth> }", "question": "Blade Runner foi cinematografado por JordanCronenweth?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1743", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Panthera_leo_fossilis> <http://dbpedia.org/ontology/species> ?uri. <http://dbpedia.org/resource/Liger> <http://dbpedia.org/ontology/species> ?uri . }", "question": "F\u00f3sseis de Panthera leo e Liger pertencem a quais esp\u00e9cies?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3948", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rhodes-Haverty_Building> <http://dbpedia.org/property/address> ?uri } ", "question": "Qual \u00e9 o endere\u00e7o da rua do Edif\u00edcio Rhodes-Haverty?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>", "target_var": "?u_1"}], "id": "3802", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Sandusky_County,_Ohio> . ?x <http://dbpedia.org/ontology/commander> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Event>}", "question": "Quem foram os comandantes durante os eventos que ocorreram no condado de Sandusky, Ohio?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2024", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pat_Vincent> <http://dbpedia.org/ontology/deathPlace> ?x . ?x <http://dbpedia.org/ontology/founder> ?uri  . }", "question": "Quem fundou a cidade onde morreu Pat Vincent?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> .?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>", "target_var": "?u_0"}], "id": "2274", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Solidus_(coin)> . ?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>  . }", "question": "Nomeie o reino com moeda Solidus (moeda) e sede administrativa em Nicomedia?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Old_Lyme,_Connecticut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Old_Lyme,_Connecticut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "4921", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mouthPlace> <http://dbpedia.org/resource/Old_Lyme,_Connecticut>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Diga o nome do rio cuja foz \u00e9 Old Lyme, Connecticut?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3407", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Runewaker_Entertainment> <http://dbpedia.org/ontology/division> ?uri. <http://dbpedia.org/resource/Airtours_International_Airways> <http://dbpedia.org/property/destinations> ?uri} ", "question": "Qual divis\u00e3o da Runewaker Entertainment tamb\u00e9m s\u00e3o os destinos da Airtours International Airways?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4245", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/Prime_Time_Entertainment_Network> . ?uri <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Douglas_Netter>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Que rede de programas \u00e9 Prime time Entertainment e tem Douglas Netter como produtor executivo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4619", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/John_W._Weeks> . ?x <http://dbpedia.org/property/president> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TennisPlayer>}", "question": "Quem foi o presidente sob o qual um jogador de t\u00eanis ocupou o cargo antes de John W. Weeks?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/monarch> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/monarch> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands> .?u_1 <http://dbpedia.org/ontology/leader> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands> .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_0"}], "id": "4916", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/monarch> <http://dbpedia.org/resource/Willem-Alexander_of_the_Netherlands> . ?uri <http://dbpedia.org/ontology/leader> ?x  . }", "question": "Quais s\u00e3o as coisas cujo l\u00edder foi um monarca de Willem-Alexandre da Holanda?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "191", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Acer_nigrum> } ", "question": "acer nigrum \u00e9 usado para fazer o qu\u00ea?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4696", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mikhail_Pashnin> <http://dbpedia.org/property/prospectTeam> ?uri } ", "question": "Qual \u00e9 o nome de Mikhail Pashnin para a equipe em potencial?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1784", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BMW_M40> <http://dbpedia.org/property/predecessor> ?uri } ", "question": "Qual \u00e9 o antecessor do BMW M40?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1532", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ionian_Sea> <http://dbpedia.org/ontology/outflow> ?x . ?x <http://dbpedia.org/property/cities> ?uri  . }", "question": "Quais cidades est\u00e3o localizadas ao redor do mar para as quais o ioniano flui?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2834", "query": "ASK WHERE { <http://dbpedia.org/resource/Joe_Namath> <http://dbpedia.org/property/highSchool> <http://dbpedia.org/resource/Beaver_Falls_High_School> }", "question": "Joe Namath fez o ensino m\u00e9dio na Beaver Falls High School?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4444", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/system> <http://dbpedia.org/resource/Chicago_and_North_Western_Transportation_Company> . ?x <http://dbpedia.org/ontology/routeStart> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RailwayLine>}", "question": "Onde come\u00e7am as ferrovias da Chicago and Northwestern Transportation Company?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}], "id": "4915", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "D\u00ea-me uma contagem de mam\u00edferos que t\u00eam sua ordem de primatas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1779", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/United_States_House_of_Representatives_elections,_1790> <http://dbpedia.org/property/leader> ?x . ?x <http://dbpedia.org/property/president> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quem foi o presidente sob o qual as pessoas ganharam as elei\u00e7\u00f5es para a C\u00e2mara dos Representantes dos Estados Unidos em 1790?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose> .?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose> .?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "4900", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose> . ?uri <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/DreamWorks_Television>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual produtor de programa de TV \u00e9 Stephen E. Ambrose e a companhia \u00e9 DreamWorks Television?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2574", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mouthLocation> <http://dbpedia.org/resource/Limerick>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Qual rio se origina de limerick?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3398", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/United_States_House_of_Representatives_elections_in_Ohio,_2010> <http://dbpedia.org/property/opponent> ?uri } ", "question": "Quem \u00e9 o oponente das elei\u00e7\u00f5es para a C\u00e2mara dos Representantes dos Estados Unidos em Ohio, em 2010?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Laozi>", "target_var": "?u_0"}], "id": "3975", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Laozi> } ", "question": "Laozi \u00e9 o autor de qual livro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3770", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Marvin_Bush> . ?x <http://dbpedia.org/property/children> ?uri  . }", "question": "Quais s\u00e3o alguns outros filhos do pai de Marvin Bush?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Elliott_Bay> <http://dbpedia.org/ontology/nearestCity> ?u_0", "target_var": "?u_0"}], "id": "1751", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elliott_Bay> <http://dbpedia.org/ontology/nearestCity> ?uri } ", "question": "Qual \u00e9 a cidade mais pr\u00f3xima de Elliott Bay?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1479", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/majorShrine> <http://dbpedia.org/resource/Westminster_Abbey> . ?x <http://dbpedia.org/property/veneratedIn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Em que seitas foram inclu\u00eddos os aristocratas, que foram enterrados na abadia de Westminister?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1024", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/majorShrine> <http://dbpedia.org/resource/Canada> . ?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Benedict_XVI>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Qual \u00e9 o santo cujo santu\u00e1rio principal fica no Canad\u00e1 e foi canonizado pelo Papa Bento XVI?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1788", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Australia_at_the_2008_Summer_Olympics> <http://dbpedia.org/property/flagbearer> ?uri } ", "question": "quem foi o porta-bandeira australiano dos Jogos Ol\u00edmpicos de Ver\u00e3o de 2008?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Warren_G._Harding> <http://dbpedia.org/ontology/vicePresident> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Evans_Hughes> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Warren_G._Harding> <http://dbpedia.org/ontology/vicePresident> ?u_0 .<http://dbpedia.org/resource/Charles_Evans_Hughes> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}], "id": "2264", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Warren_G._Harding> <http://dbpedia.org/ontology/vicePresident> ?uri. <http://dbpedia.org/resource/Charles_Evans_Hughes> <http://dbpedia.org/ontology/president> ?uri} ", "question": "Qual vice-presidente de Warren G. Harsing tamb\u00e9m \u00e9 o presidente de Evans Hughes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2473", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Riverside_Stadium> . ?uri <http://dbpedia.org/ontology/managerClub> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsManager>}", "question": "Quem \u00e9 o dirigente do clube cujo campo \u00e9 o est\u00e1dio ribeirinho?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Utah_State_Route_162> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Colorado>", "target_var": "?u_-1"}], "id": "1822", "query": "ASK WHERE { <http://dbpedia.org/resource/Utah_State_Route_162> <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Colorado> }", "question": "A rota 162 do estado de Utah termina no Colorado?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1220", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Playboy_Enterprises> <http://dbpedia.org/property/products> ?uri. <http://dbpedia.org/resource/Frank_Thorne> <http://dbpedia.org/ontology/award> ?uri} ", "question": "Qual t\u00edtulo reconhecido de Frank Thorne tamb\u00e9m \u00e9 produto da Playboy Enterprise?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1666", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Duboce_Triangle,_San_Francisco>  . }", "question": "Cujo eleitorado \u00e9 o Tri\u00e2ngulo de Duboce?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2960", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Mary_(mother_of_Jesus)>  . }", "question": "Qual \u00e9 o nome do filho divino de Maria?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "152", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentMembers> <http://dbpedia.org/resource/Joe_Hahn>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Joe Hahn \u00e9 membro de qual banda?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2534", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mikhail_Pashnin> <http://dbpedia.org/property/prospectTeam> ?uri. <http://dbpedia.org/resource/Wilfred_McDonald> <http://dbpedia.org/property/playedFor> ?uri} ", "question": "Qual time wolfred McDonald \u00e9 tamb\u00e9m o time potencial de Milkhail Pashnin?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Vandenberg_Air_Force_Base>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Vandenberg_Air_Force_Base> .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Vandenberg_Air_Force_Base>", "target_var": "?u_1"}], "id": "4688", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Vandenberg_Air_Force_Base> . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . }", "question": "Quais empresas lan\u00e7aram da base a\u00e9rea da For\u00e7a A\u00e9rea de Vandenberg?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>", "target_var": "?u_0"}], "id": "1469", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>  . }", "question": "Quais s\u00e3o alguns primatas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2807", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Julius_C._Burrows> <http://dbpedia.org/property/order> ?uri } ", "question": "Qual \u00e9 a posi\u00e7\u00e3o de Julius C. Burrows politicamente?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> .?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English>", "target_var": "?u_1"}], "id": "2512", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }", "question": "Cite alguns que vivem em um lugar onde o ingl\u00eas indiano \u00e9 a l\u00edngua oficial"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Vishwajyot_High_School> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "2980", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vishwajyot_High_School> <http://dbpedia.org/ontology/sport> ?uri } ", "question": "Quais esportes s\u00e3o praticados na Vishwajyot High School?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4822", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/BBC_Two> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "BBC Two \u00e9 o canal irm\u00e3o das redes com quais programas?"}]