[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2229", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)> <http://dbpedia.org/ontology/draftTeam> ?uri. <http://dbpedia.org/resource/Doug_Acomb> <http://dbpedia.org/property/playedFor> ?uri} ", "question": "Em qual tema Dough Acomb jogou que tamb\u00e9m \u00e9 o drafty time de Dale Mitchell?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1173", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/executiveProducer> <http://dbpedia.org/resource/Steven_Moffat> . ?x <http://dbpedia.org/property/executiveProducer> ?uri }", "question": "Liste o n\u00famero total de produtores executivos de programas de TV que t\u00eam um dos produtores executivos como Steven Moffat?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1832", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tickle_Me> <http://dbpedia.org/property/artist> ?uri. <http://dbpedia.org/resource/Viva_Las_Vegas> <http://dbpedia.org/property/artist> ?uri . }", "question": "De quem s\u00e3o as can\u00e7\u00f5es Tickle Me e Viva Las Vegas?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedMusicalArtist> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett> .?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett> .?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_0"}], "id": "376", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Tony_Bennett> . ?uri <http://dbpedia.org/ontology/spouse> ?x  . }", "question": "Diga o nome de todos aqueles cujos c\u00f4njuges se apresentaram com Tony Bennett?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3853", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/HBO>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a empresa que possui a divis\u00e3o HBO?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3616", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Waxiang_people> <http://dbpedia.org/property/related> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Quantas religi\u00f5es os parentes de Weriangs seguiram?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ramiro_Pe\u00f1a> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_0"}], "id": "798", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ramiro_Pe\u00f1a> <http://dbpedia.org/ontology/team> ?uri } ", "question": "Por qual time Ramiro Pea joga?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1158", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/battles> <http://dbpedia.org/resource/Levant> . ?x <http://dbpedia.org/property/battles> ?uri }", "question": "Contar o n\u00famero total de batalhas travadas pelos militares que travaram no Levante?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> .?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> .?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> .?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy> .?u_0 <http://dbpedia.org/ontology/literaryGenre> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/literaryGenre> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> .?u_0 <http://dbpedia.org/ontology/nonFictionSubject> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> .?u_1 <http://dbpedia.org/ontology/nonFictionSubject> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/nonFictionSubject> <http://dbpedia.org/resource/Fantasy> .?u_1 <http://dbpedia.org/ontology/literaryGenre> ?u_0", "target_var": "?u_1"}], "id": "2792", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Fantasy> . ?x <http://dbpedia.org/ontology/nonFictionSubject> ?uri  . }", "question": "Quantos assuntos foram abordados em romances de fantasia?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_0 <http://dbpedia.org/ontology/creator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld> .?u_0 <http://dbpedia.org/ontology/creator> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld> .?u_0 <http://dbpedia.org/ontology/creator> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_1 <http://dbpedia.org/ontology/creator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> .?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld> .?u_1 <http://dbpedia.org/ontology/creator> ?u_0", "target_var": "?u_1"}], "id": "4035", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Larry_David> . ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Jerry_Seinfeld> . }", "question": "O que foi criado por Larry David e Jerry Seinfeld?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Let_It_Be_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Ringo_Starr>", "target_var": "?u_-1"}], "id": "2662", "query": "ASK WHERE { <http://dbpedia.org/resource/Let_It_Be_(musical)> <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Ringo_Starr> }", "question": "Let it Be foi escrito por Ringo Starr?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4012", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Women_in_the_Garden> <http://dbpedia.org/property/artist> ?uri } ", "question": "qual pessoa criou as mulheres no jardim?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Girl_from_the_North_Country> <http://dbpedia.org/ontology/composer> ?u_0", "target_var": "?u_0"}], "id": "2957", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Girl_from_the_North_Country> <http://dbpedia.org/ontology/composer> ?uri } ", "question": "Quem \u00e9 o compositor de Girl from the North Country?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Evergreen_High_School_(King_County,_Washington)> <http://dbpedia.org/ontology/county> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Evergreen_High_School_(King_County,_Washington)> <http://dbpedia.org/ontology/county> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Evergreen_High_School_(King_County,_Washington)> <http://dbpedia.org/ontology/county> ?u_1", "target_var": "?u_1"}], "id": "3927", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Evergreen_High_School_(King_County,_Washington)> <http://dbpedia.org/ontology/county> ?x . ?x <http://dbpedia.org/ontology/countySeat> ?uri  . }", "question": "Qual \u00e9 a sede do condado onde existe uma Evergreen High School?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_1 <http://dbpedia.org/ontology/commander> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> .?u_0 <http://dbpedia.org/ontology/commander> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "1038", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deputy> <http://dbpedia.org/resource/Robert_T._Herres> . ?uri <http://dbpedia.org/ontology/commander> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Quais guerras foram travadas pelo comandante cujo vice foi Robert T. Herres?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/state> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/state> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_0 <http://dbpedia.org/ontology/state> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_0 <http://dbpedia.org/ontology/state> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>", "target_var": "?u_1"}], "id": "3259", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/routeJunction> <http://dbpedia.org/resource/Kensington,_Maryland> . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Road>}", "question": "Por quais estados vai a estrada, que tem um entroncamento em Keningston Maryland?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1344", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", "question": "Do que morreram as pessoas enterradas em Toronto?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2505", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pizza-ghetti> <http://dbpedia.org/property/mainIngredient> ?uri } ", "question": "Liste o ingrediente principal da Pizza-ghetti?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1721", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/workInstitutions> <http://dbpedia.org/resource/University_of_Miami> . ?x <http://dbpedia.org/property/workInstitutions> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Medician>}", "question": "Liste o instituto de trabalho dos m\u00e9dicos que tamb\u00e9m trabalharam na Universidade de Miami?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "175", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thanong_Bidaya> <http://dbpedia.org/property/primeminister> ?x . ?x <http://dbpedia.org/ontology/nationality> ?uri  . }", "question": "A que pa\u00eds pertencia o primeiro-ministro que era servido por Thanong Bidaya?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_1 .<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}], "id": "4893", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hang_Chuon_Naron> <http://dbpedia.org/ontology/religion> ?uri. <http://dbpedia.org/resource/Krom_Ngoy> <http://dbpedia.org/ontology/religion> ?uri . }", "question": "Que f\u00e9 hang chuon naron e Kron Ngoy seguem?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1909", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Motor_Credit_Company> <http://dbpedia.org/property/owner> ?uri. <http://dbpedia.org/resource/Dagenham_wind_turbines> <http://dbpedia.org/property/owner> ?uri . }", "question": "Qual empresa possui a\u00e7\u00f5es das turbinas Dagenham e cr\u00e9dito da Ford Motor?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "45", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Falcon_Cobra> <http://dbpedia.org/ontology/parentCompany> ?uri. <http://dbpedia.org/resource/Dagenham_wind_turbines> <http://dbpedia.org/property/owner> ?uri} ", "question": "Qual acionista das turbinas e\u00f3licas Dagenham tamb\u00e9m \u00e9 a empresa-m\u00e3e do Ford Falcon Cobra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3409", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mickey's_Mellerdrammer> <http://dbpedia.org/property/cinematography> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Liste os pr\u00eamios ganhos pelo diretor de fotografia do Mellerdrammer de Mickey?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4674", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cyril_Hume> <http://dbpedia.org/property/education> ?uri } ", "question": "me diga a escola para a qual Cyril Hume foi?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1075", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boga_(soft_drink)> <http://dbpedia.org/property/origin> ?uri } ", "question": "onde o Boga se originou?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2829", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Me_and_My_Arrow> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/property/narrated> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Quem \u00e9 a cantora do \u00e1lbum que tem uma m\u00fasica Me and My arrow?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1504", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/architecturalStyle> <http://dbpedia.org/resource/Modern_architecture> . ?x <http://dbpedia.org/property/address> ?uri  . }", "question": "Em quantos lugares diferentes posso encontrar edif\u00edcios de arquitetura moderna?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2309", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Habib_Boromand_Dashghapu> <http://dbpedia.org/property/almaMater> ?x . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Quais esportes s\u00e3o praticados na alma mater de Habib Boromand Dashghapu?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1436", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Parliament_Security_Services> <http://dbpedia.org/property/houses> ?uri } ", "question": "Quais s\u00e3o as casas dos Servi\u00e7os de Seguran\u00e7a do Parlamento?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/origin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/origin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> .?u_1 <http://dbpedia.org/property/origin> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> .?u_0 <http://dbpedia.org/property/origin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> .?u_1 <http://dbpedia.org/property/origin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> .?u_0 <http://dbpedia.org/property/origin> ?u_1", "target_var": "?u_1"}], "id": "2418", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }", "question": "Conte a origem das bebidas que foram originadas na Inglaterra /"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson> .?u_1 <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson> .?u_0 <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Andrew_Jackson>", "target_var": "?u_1"}], "id": "3986", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Andrew_Jackson> . ?uri <http://dbpedia.org/ontology/knownFor> ?x  . }", "question": "Contar quantas pessoas ficaram famosas quando Andrew Jackson era comandante?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3098", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Al_Gore_presidential_campaign,_2000> <http://dbpedia.org/ontology/incumbent> ?uri } ", "question": "Quem \u00e9 o titular da campanha presidencial de Al Gore em 2000?"}]