[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}], "id": "3760", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Park_Bridge> <http://dbpedia.org/ontology/maintainedBy> ?x . ?x <http://dbpedia.org/ontology/countySeat> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>}", "question": "Qual \u00e9 a capital da regi\u00e3o que mant\u00e9m a ponte South Park?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?u_0", "target_var": "?u_0"}], "id": "4213", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?uri } ", "question": "A rodovia AH141 faz parte de que pa\u00eds?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "48", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Trinity_School,_Brentwood> <http://dbpedia.org/ontology/localAuthority> ?uri. <http://dbpedia.org/resource/Sarah_Walker_(badminton)> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Qual \u00e9 a autoridade local da Trinity School, Brentwood e local de nascimento de Sarah Walker (badminton)?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/William_Anthony_(artist)> <http://dbpedia.org/ontology/training> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0 .<http://dbpedia.org/resource/William_Anthony_(artist)> <http://dbpedia.org/ontology/training> ?u_0", "target_var": "?u_0"}], "id": "2367", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?uri. <http://dbpedia.org/resource/William_Anthony_(artist)> <http://dbpedia.org/ontology/training> ?uri} ", "question": "Qual escola de jack mcGregor frequenta qual tamb\u00e9m foi o centro de treinamento de William Anthony?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "700", "query": "ASK WHERE { <http://dbpedia.org/resource/Julia_Gillard> <http://dbpedia.org/property/monarch> <http://dbpedia.org/resource/Elizabeth_II> }", "question": "Julia Gillard faz parte do monarca de Elizabeth 2?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/city> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> .?u_1 <http://dbpedia.org/property/city> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/city> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/city> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/city> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/city> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> .?u_0 <http://dbpedia.org/property/city> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/city> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>", "target_var": "?u_1"}], "id": "652", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/West_Berkshire_Council> . ?uri <http://dbpedia.org/property/city> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Contar o n\u00famero de escolas que existem em uma cidade governada pelo Conselho de West Berkshire?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/East_Tilbury> <http://dbpedia.org/ontology/ceremonialCounty> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/East_Tilbury> <http://dbpedia.org/ontology/ceremonialCounty> ?u_0 .<http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?u_0", "target_var": "?u_0"}], "id": "3933", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/East_Tilbury> <http://dbpedia.org/ontology/ceremonialCounty> ?uri. <http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?uri} ", "question": "Que condado cerimonial de East Tilbury tamb\u00e9m \u00e9 a autoridade local da Escola de Segundo Grau do Condado de Buckhurst Hill?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4409", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/DeWitt_Clinton> <http://dbpedia.org/property/office> ?uri. <http://dbpedia.org/resource/Claiborne_Pell> <http://dbpedia.org/ontology/profession> ?uri} ", "question": "Qual \u00e9 a profiss\u00e3o comum de DeWitt Clinton e Claiborne Pell?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "748", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Israel>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Quantas guerras ocorreram em Israel?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1455", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Let_Me_Be_Your_Star> . ?x <http://dbpedia.org/property/guests> ?uri  . }", "question": "Qual \u00e9 o n\u00famero total de convidados no programa cuja m\u00fasica tema \u00e9 Let me be your star?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2389", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/David_Miscavige> . ?uri <http://dbpedia.org/ontology/religion> ?x  . }", "question": "Quem segue as religi\u00f5es lideradas por David Miscavige?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3494", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/magazine> <http://dbpedia.org/resource/Gangan_Comics> . ?x <http://dbpedia.org/property/author> ?uri  . }", "question": "Quantas pessoas escreveram para Gangan Comics?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "866", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arthur_P._Bagby> <http://dbpedia.org/property/order> ?uri. <http://dbpedia.org/resource/Thomas_Holliday_Hicks> <http://dbpedia.org/property/order> ?uri . }", "question": "A qual parte da estrutura pol\u00edtica dos EUA Arthur Bagby e Thomas H Hicks serviram?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?u_0", "target_var": "?u_0"}], "id": "752", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri } ", "question": "Quem escreveu The Times They Are a-Changin?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Duncan_U._Fletcher> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Duncan_U._Fletcher> <http://dbpedia.org/ontology/almaMater> ?u_0 .<http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?u_0", "target_var": "?u_0"}], "id": "1644", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Duncan_U._Fletcher> <http://dbpedia.org/ontology/almaMater> ?uri. <http://dbpedia.org/resource/Vanderbilt_Commodores> <http://dbpedia.org/ontology/university> ?uri} ", "question": "Qual instituto de educa\u00e7\u00e3o de Duncan U. Fletcher tamb\u00e9m \u00e9 a universidade de Vanderbilt Commodores?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> .?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> .?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}], "id": "92", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/property/religion> ?uri  . }", "question": "Quantas religi\u00f5es no total s\u00e3o seguidas por pessoas cuja cidade natal est\u00e1 em algum lugar da \u00cdndia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Walt_Disney_Records> <http://dbpedia.org/ontology/foundedBy> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Walt_Disney_Records> <http://dbpedia.org/ontology/foundedBy> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Walt_Disney_Records> <http://dbpedia.org/ontology/foundedBy> ?u_1", "target_var": "?u_1"}], "id": "4824", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Walt_Disney_Records> <http://dbpedia.org/ontology/foundedBy> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Quais foram os pr\u00eamios ganhos pelo fundador da Walt Disney Records?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England>", "target_var": "?u_0"}], "id": "3101", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England>  . }", "question": "A Inglaterra \u00e9 a origem de quantas coisas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2432", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> . ?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Julian_Gingell>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o com apresentador como Ryan Seacrest e compositor de m\u00fasica tema como Julian Gingell?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2629", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ", "question": "Onde Ed Podolak foi para o ensino m\u00e9dio?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}], "id": "1490", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?uri } ", "question": "Onde fica a sede do condado de King County, Washington?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2895", "query": "ASK WHERE { <http://dbpedia.org/resource/South_Asia_Subregional_Economic_Cooperation> <http://dbpedia.org/property/membership> <http://dbpedia.org/resource/Maldives> }", "question": "As Maldivas s\u00e3o membro da Coopera\u00e7\u00e3o Econ\u00f4mica Sub-regional da \u00c1sia do Sul?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rain_Over_Me> <http://dbpedia.org/ontology/album> <http://dbpedia.org/resource/Planet_Pit>", "target_var": "?u_-1"}], "id": "2177", "query": "ASK WHERE { <http://dbpedia.org/resource/Rain_Over_Me> <http://dbpedia.org/ontology/album> <http://dbpedia.org/resource/Planet_Pit> }", "question": "O \u00e1lbum Rain Over me est\u00e1 no pit do planeta?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "729", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mikhail_Pashnin> <http://dbpedia.org/property/prospectTeam> ?uri. <http://dbpedia.org/resource/Robin_Kovacs> <http://dbpedia.org/property/prospectTeam> ?uri . }", "question": "Em que time comum se espera que Mikhail Pashnin e Robin Kovacs joguem?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4759", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Medininagar> <http://dbpedia.org/property/leaderTitle> ?x . ?x <http://dbpedia.org/property/houses> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Legislature>}", "question": "Quais s\u00e3o as casas da legislatura na sede do l\u00edder pol\u00edtico de Medininagar?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2471", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Dennis_Muilenburg> . ?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Boeing_F/A-18E/F_Super_Hornet>  . }", "question": "Qual produtor do Boeing F / A-18E / F Super Hornet tem uma pessoa-chave, Dennis Muilenburg?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2242", "query": "ASK WHERE { <http://dbpedia.org/resource/Ne_daj_se,_Nina> <http://dbpedia.org/property/firstAired> <http://dbpedia.org/resource/Croatia> }", "question": "Ne Daj Se, Nina foi ao ar pela primeira vez na Cro\u00e1cia?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Federal_Bureau_of_Investigation>", "target_var": "?u_0"}], "id": "1936", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Federal_Bureau_of_Investigation>  . }", "question": "Quantas pessoas trabalham no FBI?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/California> <http://dbpedia.org/property/city> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/training> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/training> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/California> <http://dbpedia.org/property/city> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/training> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/training> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/training> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/training> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "1745", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California> . ?uri <http://dbpedia.org/property/training> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quantas pessoas foram treinadas em um instituto localizado na Calif\u00f3rnia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/parent> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/parent> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parent> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parent> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/parent> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bruce_Lee> <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee> .?u_1 <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_0"}], "id": "4746", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Bruce_Lee> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Onde est\u00e1 o t\u00famulo do filho de Bruce Lee?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/United_States>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/United_States> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "4373", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/United_States>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quais s\u00e3o algumas empresas famosas fundadas nos Estados Unidos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3491", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marv_McFadden> <http://dbpedia.org/property/pastteams> ?uri. <http://dbpedia.org/resource/Carlos_Emmons_(American_football)> <http://dbpedia.org/ontology/formerTeam> ?uri} ", "question": "Diga o nome do ex-time comum de Marv mcFadden e Carlos Emmons?"}]