[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_0 .<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_0 .<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_1 .<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?u_0 .<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}], "id": "4640", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/India> <http://dbpedia.org/ontology/largestCity> ?uri. <http://dbpedia.org/resource/Salsette_Island> <http://dbpedia.org/ontology/largestCity> ?uri . }", "question": "Qual a maior cidade da Ilha Salsette \u00e9 tamb\u00e9m a maior cidade da \u00cdndia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3917", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Samuel_Moreno_Rojas> <http://dbpedia.org/ontology/relation> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "D\u00ea-me toda a alma mater dos parentes de Samuek Moreno Rojas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1621", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Air_2000> <http://dbpedia.org/property/destinations> ?uri } ", "question": "Para quais destinos voa a Air 2000?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Robert_Nutting> <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_0"}], "id": "4103", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Nutting> <http://dbpedia.org/ontology/knownFor> ?uri } ", "question": "Qual \u00e9 o partido pol\u00edtico do qual Purnima Banerjee \u00e9 membro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2857", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Radhabinod_Koijam> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/property/party> ?uri  . }", "question": "A que partido pol\u00edtico pertence o sucessor de Radhabinod Koijam?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1896", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Linda_Hogan> <http://dbpedia.org/property/ethnicity> ?uri } ", "question": "Qual \u00e9 a etnia de Linda Hogan?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate> .?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate> .?u_0 <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}], "id": "3924", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Primate> . ?uri <http://dbpedia.org/ontology/family> <http://dbpedia.org/resource/Ape>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "Nomeie os mam\u00edferos que s\u00e3o primatas e pertencem \u00e0 fam\u00edlia dos macacos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3014", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Arthur_Slaght> . ?x <http://dbpedia.org/property/playedFor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Para quem jogou a pessoa cujo antecessor \u00e9 Arthur Slaght?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4438", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Lohan_Ratwatte> . ?x <http://dbpedia.org/property/allegiance> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "A que jurou a parlamentar, de quem tem filhos \u00e9 Lohan Ratwatte?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "67", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elizabeth:_The_Golden_Age_(soundtrack)> <http://dbpedia.org/property/producer> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pelo produtor de Elizabeth: The Golden Age?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2580", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/VC_Lokomotiv_Novosibirsk> . ?x <http://dbpedia.org/property/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VolleyballPlayer>}", "question": "Qual \u00e9 a cidade natal do jogador de voleibol cujo clube \u00e9 o VC Lokomotiv Novosibirsk?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3782", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/crosses> <http://dbpedia.org/resource/Orange_Line_(MBTA)> . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Quem \u00e9 o dono da ponte que atravessa a Linha Laranja da MBTA?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3790", "query": "ASK WHERE { <http://dbpedia.org/resource/Chicago_Blackhawks> <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/Joel_Quenneville> }", "question": "Joel Quenneville \u00e9 o t\u00e9cnico principal do Chicago Blackhawks?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "820", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Mel_Brooks> . ?x <http://dbpedia.org/property/label> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Por meio de qual gravadora Mel Brooks produziu seu filme?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/judges> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> .?u_0 <http://dbpedia.org/property/judges> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network>", "target_var": "?u_1"}], "id": "1226", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }", "question": "Conte o n\u00famero de ju\u00edzes que compareceram aos programas da rede CTV."}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2991", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Kobalt_Label_Services>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Diga o nome dos artistas musicais cujo selo \u00e9 dado pela Kobalt Label Services?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Watkins_Glen,_New_York>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/firstTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Watkins_Glen,_New_York> .?u_0 <http://dbpedia.org/property/firstTeam> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Watkins_Glen,_New_York>", "target_var": "?u_1"}], "id": "3132", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Watkins_Glen,_New_York> . ?x <http://dbpedia.org/property/firstTeam> ?uri  . }", "question": "Enumere todas as primeiras equipes dos GPs que foram realizados em Watkins Glen, NY?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/G\u00e9za_Horv\u00e1th> <http://dbpedia.org/ontology/nationality> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?u_0 .<http://dbpedia.org/resource/G\u00e9za_Horv\u00e1th> <http://dbpedia.org/ontology/nationality> ?u_0", "target_var": "?u_0"}], "id": "2743", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?uri. <http://dbpedia.org/resource/G\u00e9za_Horv\u00e1th> <http://dbpedia.org/ontology/nationality> ?uri} ", "question": "Qual operador de ganz UV tamb\u00e9m \u00e9 a nacionalidade do Gza Horvth?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4457", "query": "ASK WHERE { <http://dbpedia.org/resource/AMC_Gremlin> <http://dbpedia.org/property/engine> <http://dbpedia.org/resource/Audi> }", "question": "O AMC Gremlin usa um motor Audi?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4269", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abiye_Abebe> <http://dbpedia.org/property/placeOfDeath> ?uri. <http://dbpedia.org/resource/Amsale_Aberra> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Qual \u00e9 o local da morte do Abiye Abebe e \u00e9 o local de nascimento do Amsale Aberra?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3349", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2014\u201315_Panionios_G.S.S._season> <http://dbpedia.org/property/stadium> ?uri. <http://dbpedia.org/resource/Nikos_Pateras> <http://dbpedia.org/ontology/residence> ?uri} ", "question": "Qual resid\u00eancia oficial de Nikos Pateras \u00e9 tamb\u00e9m o est\u00e1dio dos anionios GSS da temporada 2014-15?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Larry_J._Franco>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Larry_J._Franco> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "1143", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Larry_J._Franco>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "D\u00ea-me uma contagem de filmes cujo produtor \u00e9 Larry J. Franco?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "397", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Luther_Hill> <http://dbpedia.org/ontology/profession> ?uri. <http://dbpedia.org/resource/Claiborne_Pell> <http://dbpedia.org/ontology/profession> ?uri . }", "question": "Qual \u00e9 a profiss\u00e3o comum de William Luther Hill e Claiborne Pell?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2906", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nihoa> <http://dbpedia.org/property/nearestCity> ?uri. <http://dbpedia.org/resource/Jim_Brady_(quarterback)> <http://dbpedia.org/ontology/deathPlace> ?uri} ", "question": "Em que cidade perto de Nihoa \u00e9 o local da morte de Jim Brady?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/discipline> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/property/discipline> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}], "id": "4301", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/discipline> ?uri  . }", "question": "Peri\u00f3dicos de quantos campos podem ser encontrados nos EUA?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Commodore_64>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/genre> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Commodore_64> .?u_0 <http://dbpedia.org/property/genre> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Commodore_64>", "target_var": "?u_1"}], "id": "2759", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Commodore_64> . ?x <http://dbpedia.org/property/genre> ?uri  . }", "question": "Quantos g\u00eaneros de jogos diferentes posso encontrar que s\u00e3o compat\u00edveis com o Commodore 64?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1398", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steven_Palazzo> <http://dbpedia.org/property/battles> ?uri } ", "question": "Em quais guerras Steven Palazzo lutou?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/discipline> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> .?u_0 <http://dbpedia.org/property/discipline> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States>", "target_var": "?u_1"}], "id": "1659", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/discipline> ?uri  . }", "question": "Peri\u00f3dicos acad\u00eamicos de quais campos s\u00e3o encontrados nos EUA?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Mike_Shinoda>", "target_var": "?u_0"}], "id": "979", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Mike_Shinoda> } ", "question": "Mike Shinoda est\u00e1 em qual banda?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1298", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/voices> <http://dbpedia.org/resource/Mona_Marshall>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cujas vozes s\u00e3o dadas por Mona Marshall?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House> .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> .?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House> .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}], "id": "82", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Freedom_of_the_City> . ?uri <http://dbpedia.org/ontology/board> <http://dbpedia.org/resource/Trinity_House> . }", "question": "Nomeie os membros dos conselhos da Freedom of the City e da Trinity House?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4507", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Microsoft_Visual_Studio> . ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Microsoft_Surface>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Nomeie a empresa com linhas de produtos como Visual Studio e Surface?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2458", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Canc\u00fan> . ?x <http://dbpedia.org/ontology/country> ?uri  . }", "question": "Quantos pa\u00edses circundam os mares \u00e0s margens de qual est\u00e1 a cidade de Canc\u00fan?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rama_I>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra> .?u_0 <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rama_I>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rama_I> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra> .?u_0 <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rama_I> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_0"}], "id": "3781", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Sukhumbhand_Paribatra> . ?uri <http://dbpedia.org/ontology/founder> <http://dbpedia.org/resource/Rama_I>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>}", "question": "Qual l\u00edder da regi\u00e3o administrativa \u00e9 Sukhumbhand Paribatra e foi fundada por Rama I?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_1 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?u_1 .?u_1 <http://dbpedia.org/ontology/largestCity> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}], "id": "2288", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Amit_Saigal> <http://dbpedia.org/ontology/bodyDiscovered> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Qual \u00e9 a maior cidade do pa\u00eds onde o corpo de Amit Saigal foi descoberto?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "423", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/First_Church_of_Christ,_Scientist_(Pittsburgh)> <http://dbpedia.org/property/locationTown> ?x . ?x <http://dbpedia.org/ontology/founder> ?uri  . }", "question": "Quem fundou a cidade onde est\u00e1 localizada a Primeira Igreja de Cristo, Cientista?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Los_Angeles_Lakers>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Los_Angeles_Lakers> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>", "target_var": "?u_0"}], "id": "4339", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Los_Angeles_Lakers>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Los Angeles Lakers \u00e9 o time de quais jogadores de basquete?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1904", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Michael_Deeley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes produzidos por Michael Deeley?"}]