[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Lebr\u0161nik>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Lebr\u0161nik> .?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Lebr\u0161nik>", "target_var": "?u_1"}], "id": "930", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Lebr\u0161nik> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }", "question": "Em que pa\u00eds termina o rio que nasce em Lebrsnik?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2535", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Rodi> <http://dbpedia.org/ontology/birthPlace> ?uri. <http://dbpedia.org/resource/Andy_Wyant> <http://dbpedia.org/property/placeOfDeath> ?uri} ", "question": "Onde Andy Wyant morreu e Robert Rodi nasceu em?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4028", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Duboce_Triangle,_San_Francisco> . ?uri <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/USS_Kittiwake_(ASR-13)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual pessoa constituinte \u00e9 Duboce Triangle, San Francisco e unidade militar \u00e9 USS Kittiwake (ASR-13)?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/The_Shirelles>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/The_Shirelles> .?u_0 <http://dbpedia.org/ontology/occupation> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/The_Shirelles>", "target_var": "?u_1"}], "id": "3371", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/The_Shirelles> . ?x <http://dbpedia.org/ontology/occupation> ?uri  . }", "question": "Qual a ocupa\u00e7\u00e3o dos integrantes da banda The Shirelles?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4621", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Indianapolis_Colts> . ?uri <http://dbpedia.org/property/currentteam> <http://dbpedia.org/resource/Michigan_Wolverines>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}", "question": "Qual jogador de futebol americano \u00e9 ex-jogador do Indianapolis Colts e o time atual \u00e9 Michigan Wolverines?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3859", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Miao_people> <http://dbpedia.org/ontology/religion> ?uri. <http://dbpedia.org/resource/Guru_Purnima> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Qual \u00e9 a religi\u00e3o comum do povo Miao e do pa\u00eds onde o Guru Purnima \u00e9 celebrado?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_0 <http://dbpedia.org/ontology/type> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_0 <http://dbpedia.org/ontology/type> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_1 <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> .?u_1 <http://dbpedia.org/ontology/type> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_0"}], "id": "1698", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Pyusawhti> . ?x <http://dbpedia.org/ontology/type> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Que tipo de edif\u00edcios foram projetados por Pyusawhti?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4708", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/parent> <http://dbpedia.org/resource/Sony_Financial> . ?x <http://dbpedia.org/ontology/owningCompany> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a empresa propriet\u00e1ria do banco cuja controladora \u00e9 a Sony Financial?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3200", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/headcoach> <http://dbpedia.org/resource/Amanda_Reddin>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Gymnast>}", "question": "Quais s\u00e3o algumas ginastas treinadas por Amanda Reddin?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4608", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/phylum> <http://dbpedia.org/resource/Chordate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "Quais s\u00e3o alguns mam\u00edferos cujo filo \u00e9 Chordate?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld> .?u_0 <http://dbpedia.org/ontology/developer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld>", "target_var": "?u_1"}], "id": "985", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Oddworld> . ?x <http://dbpedia.org/ontology/developer> ?uri  . }", "question": "Quantos desenvolvedores trabalharam em jogos da s\u00e9rie Oddworld?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/ground> ?u_0", "target_var": "?u_0"}], "id": "3318", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2015_Fort_Lauderdale_Strikers_season> <http://dbpedia.org/ontology/ground> ?uri } ", "question": "Qual \u00e9 a casa da temporada 2015 do Fort Lauderdale Strikers?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2867", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/Virtual_Console> . ?uri <http://dbpedia.org/property/composer> <http://dbpedia.org/resource/Hirokazu_Tanaka>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Qual videogame composto por Hirokazu Tanaka pode ser jogado no console virtual?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4056", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Plaza_on_DeWitt> <http://dbpedia.org/ontology/architect> ?x . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . }", "question": "Qual \u00e9 o local de descanso do engenheiro que foi o arquiteto do Plaza on DeWitt?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_0 .<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_0 .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_0 .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_0 .<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_0 .?u_1 <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_1 .<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_0 .<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?u_1 .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?u_1 .?u_0 <http://dbpedia.org/ontology/location> ?u_1", "target_var": "?u_1"}], "id": "4777", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cooper_Mountain_Vineyards> <http://dbpedia.org/ontology/location> ?uri. <http://dbpedia.org/resource/Mount_Bachelor_ski_area> <http://dbpedia.org/ontology/location> ?uri . }", "question": "Onde est\u00e3o localizados os vinhedos da montanha de Cooper e a \u00e1rea de esqui Mt. Bachelor?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "981", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Mercedes-Benz_Superdome> <http://dbpedia.org/ontology/tenant> ?uri  . }", "question": "Quantos inquilinos existem no Mercedes Benz Superdome?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2492", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alfred_Blalock> <http://dbpedia.org/property/workInstitutions> ?x . ?x <http://dbpedia.org/property/affiliation> ?uri  . }", "question": "Qual \u00e9 a afilia\u00e7\u00e3o do hospital onde Alfred Blalock trabalha?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Bass_guitar>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Bass_guitar>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Bass_guitar> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Bass_guitar> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>", "target_var": "?u_1"}], "id": "3792", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/instruments> <http://dbpedia.org/resource/Bass_guitar> . ?x <http://dbpedia.org/ontology/stylisticOrigin> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicGenre>}", "question": "Quantos g\u00eaneros deram origem a outros g\u00eaneros que enfatizam o baixo?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/Birmingham>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/Birmingham> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_0"}], "id": "3548", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/Birmingham>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Quantas bandas come\u00e7aram em Birmingham?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2942", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/sourcePlace> <http://dbpedia.org/resource/Richmond_Park> . ?x <http://dbpedia.org/property/mouthLocation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stream>}", "question": "Onde termina o rio que come\u00e7a no Richmond Park?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3527", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/citizenship> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", "question": "Quantas causas de morte foram associadas a cidad\u00e3os americanos?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3845", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/coach> <http://dbpedia.org/resource/Louis_Dunbar>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballTeam>}", "question": "Louis Dunbar \u00e9 o treinador de qual time de basquete?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Luxuria_(band)> <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/Noko>", "target_var": "?u_-1"}], "id": "1457", "query": "ASK WHERE { <http://dbpedia.org/resource/Luxuria_(band)> <http://dbpedia.org/ontology/formerBandMember> <http://dbpedia.org/resource/Noko> }", "question": "O Noko era um membro da banda Luxuria?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1395", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd> } ", "question": "Charles Willing Byrd foi o governador sob qual pol\u00edtico?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Asiana_Airlines> <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Jeju_International_Airport>", "target_var": "?u_-1"}], "id": "264", "query": "ASK WHERE { <http://dbpedia.org/resource/Asiana_Airlines> <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Jeju_International_Airport> }", "question": "As companhias a\u00e9reas asiana voam para o aeroporto de Jeju?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Czech_Extraliga>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/formerTeam> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Czech_Extraliga> .?u_1 <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Czech_Extraliga>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/league> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Czech_Extraliga> .?u_0 <http://dbpedia.org/property/league> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/league> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Czech_Extraliga>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Czech_Extraliga> .?u_0 <http://dbpedia.org/ontology/formerTeam> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Czech_Extraliga>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Czech_Extraliga> .?u_1 <http://dbpedia.org/property/league> ?u_0", "target_var": "?u_1"}], "id": "4095", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Czech_Extraliga> . ?x <http://dbpedia.org/ontology/formerTeam> ?uri  . }", "question": "Por quantas equipes os jogadores da liga da Extraliga Tcheca, anteriormente jogaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2692", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Baja_California_Peninsula> <http://dbpedia.org/ontology/location> ?uri. <http://dbpedia.org/resource/WEPG> <http://dbpedia.org/property/city> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Continent>}", "question": "Qual continente do mundo tem a pen\u00ednsula da Baja California e tamb\u00e9m WEPG em uma de suas cidades?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3589", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Laemmle_Theatres> <http://dbpedia.org/ontology/service> ?uri. <http://dbpedia.org/resource/Jos\u00e9_Rivera_(playwright)> <http://dbpedia.org/property/awards> ?uri} ", "question": "Qual \u00e9 o servi\u00e7o dos Teatros Laemmle e tamb\u00e9m \u00e9 o pr\u00eamio do Jos Rivera (dramaturgo)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1758", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Stoke_City_F.C.> } ", "question": "Quais jogadores de futebol atualmente t\u00eam contratos com o Stoke City FC?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_0 <http://dbpedia.org/ontology/restingPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}], "id": "2810", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/training> <http://dbpedia.org/resource/Art_Students_League_of_New_York> . ?x <http://dbpedia.org/ontology/restingPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "Artistas formados na liga de estudantes de arte de NY est\u00e3o enterrados onde?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Liberty_Bell> <http://dbpedia.org/ontology/municipality> ?u_0", "target_var": "?u_0"}], "id": "923", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liberty_Bell> <http://dbpedia.org/ontology/municipality> ?uri } ", "question": "Qual \u00e9 o munic\u00edpio de Liberty Bell?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2880", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bloomberg_L.P.> <http://dbpedia.org/property/owner> ?uri } ", "question": "Quem \u00e9 o dono da Bloomberg LP?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "268", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alpine_skiing_at_the_1964_Winter_Olympics_\u2013_Men's_slalom> <http://dbpedia.org/ontology/bronzeMedalist> ?x . ?x <http://dbpedia.org/property/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Skier>}", "question": "Qual \u00e9 o local da morte do esquiador que foi medalhista de bronze no esqui alpino no slalom masculino dos Jogos Ol\u00edmpicos de Inverno de 1964?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "669", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/highschool> <http://dbpedia.org/resource/North_Fort_Myers_High_School> . ?x <http://dbpedia.org/property/debutteam> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballPlayer>}", "question": "Qual \u00e9 o time de estreia do jogador de futebol americano que estudou na North Fort Myers High School?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4475", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mouse_Morris> <http://dbpedia.org/property/race> ?uri } ", "question": "Em que corridas Mouse Morris participou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1910", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Park:_The_Stick_of_Truth> <http://dbpedia.org/property/writer> ?uri } ", "question": "Quem s\u00e3o os escritores de South Park: The Stick of Truth?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0 .<http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?u_0", "target_var": "?u_0"}], "id": "2985", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?uri. <http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?uri} ", "question": "Qual \u00e9 o partido l\u00edder em Baraily ao qual Chandra Shekhar tamb\u00e9m est\u00e1 associado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1152", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Colin_Powell> . ?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Jaber_Al-Ahmad_Al-Sabah> . }", "question": "Cujos comandantes s\u00e3o Colin Powell e Jaber Al-Ahmad Al-Sabah?"}]