[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Royal_Thai_Army>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Royal_Thai_Army> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Royal_Thai_Army>", "target_var": "?u_1"}], "id": "685", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryBranch> <http://dbpedia.org/resource/Royal_Thai_Army> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Quantas religi\u00f5es s\u00e3o seguidas pelas pessoas no Ex\u00e9rcito Real da Tail\u00e2ndia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/T._S._Thakur>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/T._S._Thakur> .?u_1 <http://dbpedia.org/ontology/residence> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/T._S._Thakur>", "target_var": "?u_1"}], "id": "3169", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/T._S._Thakur> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }", "question": "Quais pol\u00edticos vivem em uma cidade liderada por TS Thakur?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "3926", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/On_Broadway_(Smash)> <http://dbpedia.org/property/guests> ?uri  . }", "question": "Quantos convidados estiveram na Broadway?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3434", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Government_Building,_Kiev> . ?x <http://dbpedia.org/ontology/significantBuilding> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>}", "question": "Liste os edif\u00edcios significativos do arco. De quem uma das obras importantes \u00e9 Edif\u00edcio do Governo, Kiev?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "2171", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/garrison> <http://dbpedia.org/resource/The_Pentagon>  . }", "question": "Contar tudo guarnecido no pent\u00e1gono?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3689", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?uri. <http://dbpedia.org/resource/Wickramabahu_Central_College_(National_School)> <http://dbpedia.org/property/religiousAffiliation> ?uri} ", "question": "Que afilia\u00e7\u00e3o de relegi\u00e3o comum existe para udit Raj e Wickramabahu Central College?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/opponent> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/opponent> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/opponent> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/opponent> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}], "id": "487", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/restingPlace> <http://dbpedia.org/resource/Tower_of_London> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quantas pessoas eram oponentes dos enterrados na torre de Londres?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> .?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario> .?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> .?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario> .?u_1 <http://dbpedia.org/ontology/locationCity> ?u_0", "target_var": "?u_1"}], "id": "1688", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }", "question": "Conte todos os locais onde operam empresas localizadas em Ont\u00e1rio."}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/North-Western_Province,_Zambia>", "target_var": "?u_0"}], "id": "2230", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/sourceRegion> <http://dbpedia.org/resource/North-Western_Province,_Zambia> } ", "question": "Qual \u00e9 o rio cuja origem \u00e9 a Prov\u00edncia Noroeste da Z\u00e2mbia?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3264", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Egushawa> . ?x <http://dbpedia.org/property/combatant> ?uri  . }", "question": "Quantas fac\u00e7\u00f5es lutaram quando Egushawa era comandante?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Everything_Will_Be_OK> <http://dbpedia.org/ontology/narrator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Everything_Will_Be_OK> <http://dbpedia.org/ontology/narrator> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Everything_Will_Be_OK> <http://dbpedia.org/ontology/narrator> ?u_1", "target_var": "?u_1"}], "id": "2320", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Everything_Will_Be_OK> <http://dbpedia.org/ontology/narrator> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Qual \u00e9 o t\u00edtulo honor\u00e1rio do narrador de Everything Will Be OK?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "782", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Olivier_Boulay> . ?x <http://dbpedia.org/ontology/layout> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Qual \u00e9 o layout dos autom\u00f3veis projetados por Olivier Boulay?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ridgewood,_New_Jersey>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ridgewood,_New_Jersey> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "521", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Ridgewood,_New_Jersey>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Que pessoas nasceram em Ridgewood, New Jersey?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "522", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MSX_BASIC> <http://dbpedia.org/property/license> ?uri. <http://dbpedia.org/resource/Laura_K._Ipsen> <http://dbpedia.org/ontology/occupation> ?uri} ", "question": "Qual licen\u00e7a de conte\u00fado do MSX BASIC tamb\u00e9m \u00e9 profiss\u00e3o de Laura K. Ipsen?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2837", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/PlayStation_4> <http://dbpedia.org/property/predecessor> ?uri. <http://dbpedia.org/resource/Oddworld:_Munch's_Oddysee> <http://dbpedia.org/ontology/developer> ?uri} ", "question": "Qual antecessor do PlayStation 4 tamb\u00e9m \u00e9 o desenvolvedor de Oddworld: Munch&#39;s Oddysee?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Charles_Goodell> <http://dbpedia.org/ontology/appointer> ?u_0", "target_var": "?u_0"}], "id": "4539", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_Goodell> <http://dbpedia.org/ontology/appointer> ?uri } ", "question": "Quem \u00e9 o apontador de Charles Goodell?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Hudson_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Lower_Manhattan>", "target_var": "?u_-1"}], "id": "2398", "query": "ASK WHERE { <http://dbpedia.org/resource/Hudson_River> <http://dbpedia.org/ontology/mouthMountain> <http://dbpedia.org/resource/Lower_Manhattan> }", "question": "O rio Hudson flui para a manhatten inferior?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2207", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Glover_(video_game)> <http://dbpedia.org/ontology/distributor> ?uri. <http://dbpedia.org/resource/Seattle_Mariners> <http://dbpedia.org/ontology/owner> ?uri} ", "question": "Qual distribuidor da Glover tamb\u00e9m \u00e9 o estoquista do Seattle Mariners?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3477", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Cedella_Booker> . ?uri <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Sharon_Marley>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Diga o nome da pessoa cujo nome de m\u00e3e \u00e9 Cedella Booker e tem um filho chamado Sharon Marley?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chris_Marve> <http://dbpedia.org/ontology/school> ?u_0", "target_var": "?u_0"}], "id": "3552", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chris_Marve> <http://dbpedia.org/ontology/school> ?uri } ", "question": "Qual \u00e9 a escola de Chris Marve?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4087", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tornado_(web_server)> <http://dbpedia.org/property/author> ?x . ?x <http://dbpedia.org/ontology/owner> ?uri  . }", "question": "Liste os sites que os autores do Tornado possuem?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Akira_Ifukube>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Akira_Ifukube> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>", "target_var": "?u_0"}], "id": "2822", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Akira_Ifukube>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cujo compositor \u00e9 Akira Ifukube?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1882", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/Maple_Leaf_Sports_&_Entertainment> . ?x <http://dbpedia.org/ontology/tenant> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem alugou o est\u00e1dio operado pela Maple Leaf S&amp;E?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/John_of_Damascus> <http://dbpedia.org/ontology/canonizedBy> ?u_0", "target_var": "?u_0"}], "id": "651", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_of_Damascus> <http://dbpedia.org/ontology/canonizedBy> ?uri } ", "question": "Quais coisas sagradas canonizaram Jo\u00e3o de Damasco?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locationTown> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locationTown> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locationTown> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locationTown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locationTown> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locationTown> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>", "target_var": "?u_1"}], "id": "4930", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Solon_Spencer_Beman> . ?x <http://dbpedia.org/property/locationTown> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City>}", "question": "Solon Spencer Beman arquitetou em quantas cidades?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3089", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Timothy_Morton> <http://dbpedia.org/property/mainInterests> ?uri } ", "question": "Quais s\u00e3o os principais interesses de Timothy Morton?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "369", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/battle> <http://dbpedia.org/resource/Occupation_of_Japan> . ?uri <http://dbpedia.org/property/knownFor> ?x  . }", "question": "Nomeie algu\u00e9m conhecido por um projeto envolvido na Ocupa\u00e7\u00e3o do Jap\u00e3o?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4997", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/field> <http://dbpedia.org/resource/Varsity_Stadium> . ?uri <http://dbpedia.org/ontology/formerTeam> ?x  . }", "question": "Contar todos aqueles que j\u00e1 jogaram por um time que \u00e9 dono do Est\u00e1dio Varsity?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "118", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Helsinki> . ?uri <http://dbpedia.org/property/outflow> <http://dbpedia.org/resource/Danish_straits>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>}", "question": "Nomeie o mar com Helsinque como uma das cidades costeiras e tamb\u00e9m uma sa\u00edda para os estreitos dinamarqueses?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens>", "target_var": "?u_1"}], "id": "3320", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Conte os pr\u00eamios ganhos pelas pessoas que se formaram na Universidade Nacional e Kapodistrian de Atenas."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3034", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/Shaun_the_Sheep> . ?x <http://dbpedia.org/ontology/award> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Que pr\u00eamios foram dados ao cara que fez Shaun, o Carneiro?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3542", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/screenplay> <http://dbpedia.org/resource/Daniel_Waters_(screenwriter)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes com Daniel Waters como roteirista?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1613", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm> . ?uri <http://dbpedia.org/ontology/presenter> ?x  . }", "question": "Quais pr\u00eamios s\u00e3o apresentados pelo comit\u00ea localizado em Estocolmo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3151", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Apple_Productivity_Experience_Group> <http://dbpedia.org/ontology/product> ?uri. <http://dbpedia.org/resource/21Vianet> <http://dbpedia.org/property/services> ?uri} ", "question": "Qual \u00e9 o produto comum do Apple Productivity Experience Group e os servi\u00e7os da 21Vianet?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?u_0", "target_var": "?u_0"}], "id": "962", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri } ", "question": "Quem s\u00e3o os locat\u00e1rios do MasterCard Center?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2510", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/area> <http://dbpedia.org/resource/South_Carolina> . ?x <http://dbpedia.org/property/area> ?uri }", "question": "Contar a \u00e1rea das esta\u00e7\u00f5es de r\u00e1dio que servem na Carolina do Sul?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning>", "target_var": "?u_1"}], "id": "3831", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Association_of_Southeast_Asian_Institutions_of_Higher_Learning> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Quantos jogos s\u00e3o disputados nas universidades afiliadas \u00e0 Associa\u00e7\u00e3o das Institui\u00e7\u00f5es de Ensino Superior do Sudeste Asi\u00e1tico?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Lawrence_F._Cafero> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Samuel_Keeler> <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Lawrence_F._Cafero> <http://dbpedia.org/ontology/region> ?u_0 .<http://dbpedia.org/resource/Samuel_Keeler> <http://dbpedia.org/ontology/restingPlace> ?u_0", "target_var": "?u_0"}], "id": "2823", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lawrence_F._Cafero> <http://dbpedia.org/ontology/region> ?uri. <http://dbpedia.org/resource/Samuel_Keeler> <http://dbpedia.org/ontology/restingPlace> ?uri} ", "question": "Qual regi\u00e3o administrativa de Lawrence F. Cafero \u00e9 tamb\u00e9m o local de descanso de Samuel Keeler?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Suburb>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Suburb> .?u_1 <http://dbpedia.org/property/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Suburb>", "target_var": "?u_1"}], "id": "4343", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Suburb> . ?uri <http://dbpedia.org/property/education> ?x  . }", "question": "Quem estudou em universidades localizadas nos sub\u00farbios?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3032", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mickey's_Mellerdrammer> <http://dbpedia.org/property/cinematography> ?uri } ", "question": "Listar os cineastas do Mellerdrammer de Mickey?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Tim_Nanai-Williams> <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_0"}], "id": "2415", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tim_Nanai-Williams> <http://dbpedia.org/ontology/relative> ?uri } ", "question": "Liste o parente de Tim Nanai-Williams?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4236", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/From_the_Earth_to_the_Moon_(miniseries)> <http://dbpedia.org/ontology/executiveProducer> ?uri. <http://dbpedia.org/resource/Nothing_in_Common> <http://dbpedia.org/property/starring> ?uri . }", "question": "Quem estrelou Nothing in Common e produziu From the Earth to the Moon?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2185", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/Wringer_(novel)> . ?uri <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/Maniac_Magee> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Wringer (romance) e Maniac Magee \u00e9 a obra not\u00e1vel de qual autor?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C_(programming_language)>", "target_var": "?u_0"}], "id": "3669", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C_(programming_language)> } ", "question": "O que todos s\u00e3o escritos na linguagem de programa\u00e7\u00e3o C?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2037", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Frampton's_Camel>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "Quais s\u00e3o os artistas que estiveram na banda Framptons camel?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Cirque_du_Soleil_discography> <http://dbpedia.org/property/artist> ?u_0", "target_var": "?u_0"}], "id": "4362", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Cirque_du_Soleil_discography> <http://dbpedia.org/property/artist> ?uri  . }", "question": "Contar o n\u00famero de artistas na discografia do Cirque du Soleil?"}]