[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1889", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Peter_Thorneycroft> . ?x <http://dbpedia.org/ontology/relation> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "Quais s\u00e3o os parentes do membro do parlamento cujo sucessor \u00e9 Peter Thorneycroft?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1591", "query": "ASK WHERE { <http://dbpedia.org/resource/Funky_Lab_Rat> <http://dbpedia.org/property/released> <http://dbpedia.org/resource/North_America> }", "question": "O Funky Lab Rat foi lan\u00e7ado na Am\u00e9rica do Norte?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1346", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Philip_Novak> <http://dbpedia.org/property/mainInterests> ?uri. <http://dbpedia.org/resource/Timothy_Morton> <http://dbpedia.org/property/mainInterests> ?uri . }", "question": "Quais s\u00e3o os principais interesses comuns de Philip Novak e Timothy Morton?"}]