[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_1 <http://dbpedia.org/ontology/owner> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/owner> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_1 <http://dbpedia.org/ontology/owner> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_0 <http://dbpedia.org/ontology/owner> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> .?u_0 <http://dbpedia.org/ontology/owner> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/owner> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>", "target_var": "?u_1"}], "id": "2381", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Alabama> . ?x <http://dbpedia.org/ontology/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>}", "question": "Quem \u00e9 o dono das esta\u00e7\u00f5es de r\u00e1dio no Alabama?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "939", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Ekstraliga_(speedway)> . ?x <http://dbpedia.org/property/nickname> ?uri  . }", "question": "quais s\u00e3o os apelidos das pessoas que est\u00e3o em Ekstraliga?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4198", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "Liste a alma mater da pessoa que est\u00e1 casada com Sissela Bok."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2799", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Fr._Almeida> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Quais esportes s\u00e3o praticados nas escolas fundadas pelo Pe. Almeida?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4540", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jerry_Tagge> <http://dbpedia.org/property/highSchool> ?uri. <http://dbpedia.org/resource/Tennie_and_Laura_(schooner)> <http://dbpedia.org/property/nearestCity> ?uri} ", "question": "Qual escola secund\u00e1ria de Jerry Tagge \u00e9 tamb\u00e9m a cidade mais pr\u00f3xima de Tennie Laura?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4216", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/operator> <http://dbpedia.org/resource/Starwood_Hotels_and_Resorts_Worldwide> . ?x <http://dbpedia.org/property/address> ?uri  . }", "question": "Em quantos lugares diferentes funcionam os hot\u00e9is e resorts Starwood em todo o mundo?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Fritz_Chess> <http://dbpedia.org/ontology/genre> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?u_0 .<http://dbpedia.org/resource/Fritz_Chess> <http://dbpedia.org/ontology/genre> ?u_0", "target_var": "?u_0"}], "id": "2068", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?uri. <http://dbpedia.org/resource/Fritz_Chess> <http://dbpedia.org/ontology/genre> ?uri} ", "question": "Qual atletismo de Jaimatu Muslim Mindano \u00e9 igual ao g\u00eanero do Fritz Chess?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Utopian_and_dystopian_fiction>", "target_var": "?u_0"}], "id": "529", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/literaryGenre> <http://dbpedia.org/resource/Utopian_and_dystopian_fiction>  . }", "question": "Quantos livros de fic\u00e7\u00e3o ut\u00f3pica e dist\u00f3pica existem?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "636", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/lieutenant> <http://dbpedia.org/resource/Richard_Winn> . ?x <http://dbpedia.org/property/appointer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Governor>}", "question": "Quem nomeou o governador sob o qual Richard Winn trabalha?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Vietnam_Airlines> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}], "id": "1269", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vietnam_Airlines> <http://dbpedia.org/ontology/location> ?uri } ", "question": "Onde est\u00e1 localizada a Vietnam Airlines?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/T.I._Ahmadiyya_Senior_High_School,_Kumasi> <http://dbpedia.org/ontology/denomination> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?u_0 .<http://dbpedia.org/resource/T.I._Ahmadiyya_Senior_High_School,_Kumasi> <http://dbpedia.org/ontology/denomination> ?u_0", "target_var": "?u_0"}], "id": "185", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/INKAS> <http://dbpedia.org/property/locations> ?uri. <http://dbpedia.org/resource/T.I._Ahmadiyya_Senior_High_School,_Kumasi> <http://dbpedia.org/ontology/denomination> ?uri} ", "question": "Em qual local da INKAS tamb\u00e9m fica a Escola de Ensino M\u00e9dio TI Ahmadiyya, Kumasi?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4349", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/Playtone> . ?uri <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Stephen_E._Ambrose>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Que empresa de programa de TV \u00e9 PlayTone e \u00e9 produzida por Stephen E. Ambrose?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/North\u2013South_Transport_Corridor> <http://dbpedia.org/ontology/routeEnd> ?u_0", "target_var": "?u_0"}], "id": "3179", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/North\u2013South_Transport_Corridor> <http://dbpedia.org/ontology/routeEnd> ?uri } ", "question": "Qual \u00e9 a rota final do Corredor de Transporte Norte-Sul?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1797", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alpine_skiing_at_the_1972_Winter_Olympics_\u2013_Women's_downhill> <http://dbpedia.org/ontology/bronzeMedalist> ?x . ?x <http://dbpedia.org/property/birthPlace> ?uri  . }", "question": "Qual \u00e9 a resid\u00eancia da medalhista de bronze do esqui alpino na competi\u00e7\u00e3o de downhill feminino nos Jogos Ol\u00edmpicos de Inverno de 1972?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2979", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jeep_Forward_Control> <http://dbpedia.org/property/engine> ?x . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . }", "question": "Quem \u00e9 o fabricante do motor do Jeep Forward Control?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1441", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/New_Mexico> . ?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/Microsoft_Visual_Studio>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual empresa fundada no Novo M\u00e9xico fabrica Visual Studio?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4874", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/Supachai_Somcharoen> . ?x <http://dbpedia.org/property/agencyName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GovernmentAgency>}", "question": "Qual ag\u00eancia governamental \u00e9 dirigida por Supachai Somcharoen?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ivanpah_Solar_Power_Facility> <http://dbpedia.org/ontology/owner> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ivanpah_Solar_Power_Facility> <http://dbpedia.org/ontology/owner> ?u_0 .<http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}], "id": "1535", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ivanpah_Solar_Power_Facility> <http://dbpedia.org/ontology/owner> ?uri. <http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/ontology/developer> ?uri} ", "question": "Qual \u00e9 o propriet\u00e1rio da Ivanpah Solar Power Facility e o desenvolvedor original do Dart?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Agaricus_bisporus>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Agaricus_bisporus> .?u_0 <http://dbpedia.org/ontology/ingredient> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Agaricus_bisporus>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Agaricus_bisporus> .?u_1 <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_0"}], "id": "3443", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Agaricus_bisporus> . ?x <http://dbpedia.org/ontology/ingredient> ?uri }", "question": "Encontre o n\u00famero total de ingredientes das receitas cujo ingrediente \u00e9 Cogumelo comum?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1273", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }", "question": "Liste todos os inquilinos do est\u00e1dio onde o WWF Summer Slam 2004 aconteceu."}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2467", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sea_Gayle_Music> <http://dbpedia.org/property/founder> ?uri } ", "question": "Quem foram os fundadores da Sea Gayle Music?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3513", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Dolores_del_R\u00edo> . ?uri <http://dbpedia.org/property/director> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quantos filmes s\u00e3o dirigidos pela esposa de Dolores del Ro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1712", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brian_Deegan_(rider)> <http://dbpedia.org/property/birthPlace> ?uri. <http://dbpedia.org/resource/Harold_Lloyd> <http://dbpedia.org/property/birthPlace> ?uri . }", "question": "Qual estado dos EUA nos deu Brian Deegan e Harold Lyold?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2199", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/Texarkana,_Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Quais s\u00e3o algumas das bandas que v\u00e3o para o Texas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/John_Tower> <http://dbpedia.org/ontology/militaryBranch> ?u_0", "target_var": "?u_0"}], "id": "955", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Tower> <http://dbpedia.org/ontology/militaryBranch> ?uri } ", "question": "Qual \u00e9 o ramo militar da John Tower?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2579", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Upper_Neretva> <http://dbpedia.org/ontology/mouthCountry> ?uri. <http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)> <http://dbpedia.org/property/firstAired> ?uri} ", "question": "Em que pa\u00eds a GM foi ao ar pela primeira vez, que \u00e9 tamb\u00e9m o pa\u00eds da foz do Alto Neretva?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3897", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/Taiwan> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}", "question": "Quantos aparelhos de informa\u00e7\u00e3o s\u00e3o fabricados por empresas localizadas em Taiwan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3685", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Egyptian_Open> <http://dbpedia.org/ontology/champion> ?x . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . }", "question": "Onde nasceu o atual campe\u00e3o do Aberto do Egito?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "403", "query": "ASK WHERE { <http://dbpedia.org/resource/Lahpet> <http://dbpedia.org/property/mainIngredient> <http://dbpedia.org/resource/Tea> }", "question": "O ch\u00e1 \u00e9 o principal ingrediente do Lahpet?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Park_Chung-hee>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Park_Chung-hee> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>", "target_var": "?u_0"}], "id": "2071", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/commander> <http://dbpedia.org/resource/Park_Chung-hee>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}", "question": "Em quais batalhas o presidente Park Chung-hee participou?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Rosie_Huntington-Whiteley> <http://dbpedia.org/ontology/partner> ?u_0", "target_var": "?u_0"}], "id": "4755", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rosie_Huntington-Whiteley> <http://dbpedia.org/ontology/partner> ?uri } ", "question": "quem \u00e9 o marido de Rosie Huntington Whiteley?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "158", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/routeEnd> <http://dbpedia.org/resource/Union_Station_(Washington,_D.C.)> . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RailwayLine>}", "question": "Quem possui a\u00e7\u00f5es nas linhas ferrovi\u00e1rias que terminam em Washington DC?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1748", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Church_and_Wellesley> <http://dbpedia.org/property/leaderName> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual religi\u00e3o o l\u00edder da Igreja e Wellesley segue?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?u_0", "target_var": "?u_0"}], "id": "2909", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Buckhurst_Hill_County_High_School> <http://dbpedia.org/ontology/localAuthority> ?uri } ", "question": "Quem s\u00e3o as autoridades locais da Buckhurst Hill County High School?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/WMDN> <http://dbpedia.org/ontology/formerBroadcastNetwork> ?u_0", "target_var": "?u_0"}], "id": "902", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WMDN> <http://dbpedia.org/ontology/formerBroadcastNetwork> ?uri } ", "question": "Listar todas as antigas redes de transmiss\u00e3o de WMDN?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "352", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)> } ", "question": "O fundador da empresa \u00e9 Jim Harris?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> .?u_0 <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> .?u_1 <http://dbpedia.org/property/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/India> <http://dbpedia.org/property/religion> ?u_1", "target_var": "?u_1"}], "id": "1230", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/property/religion> ?uri  . }", "question": "Quais religi\u00f5es s\u00e3o praticadas na \u00cdndia?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4670", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> . ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Los_Angeles_Clippers>  . }", "question": "Qual jogador atual do Chicago Bulls foi escolhido pelo Los Angeles Clippers?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Dominican_Republic>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Dominican_Republic> .?u_0 <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Dominican_Republic>", "target_var": "?u_1"}], "id": "444", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Dominican_Republic> . ?x <http://dbpedia.org/ontology/team> ?uri  . }", "question": "Qual time tem jogadores nascidos na Rep\u00fablica Dominicana?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Indira_Gandhi> <http://dbpedia.org/ontology/party> ?u_0", "target_var": "?u_0"}], "id": "4948", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Indira_Gandhi> <http://dbpedia.org/ontology/party> ?uri } ", "question": "Qual \u00e9 a festa de Indira Gandhi?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Robert_Carr,_1st_Earl_of_Somerset> <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_0"}], "id": "754", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Carr,_1st_Earl_of_Somerset> <http://dbpedia.org/ontology/opponent> ?uri } ", "question": "Quem foi o advers\u00e1rio de Robert Carr, primeiro conde de Somerset?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Balaton_wine_region> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?u_0 .<http://dbpedia.org/resource/Balaton_wine_region> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}], "id": "1737", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?uri. <http://dbpedia.org/resource/Balaton_wine_region> <http://dbpedia.org/ontology/location> ?uri} ", "question": "Qual \u00e9 o pa\u00eds comum da regi\u00e3o vin\u00edcola de Ganz UV e Balaton?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2971", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Celal_Bayar_University> <http://dbpedia.org/property/mascot> ?uri } ", "question": "Qual \u00e9 o mascote da Universidade Celal Bayar?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4979", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/William_Henry_Harrison_Tomb_State_Memorial> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/John_Scott_Harrison>  . }", "question": "Cujo lugar de descanso \u00e9 William Henry Harrison Tomb State Memorial e tem filhos chamados John Scott Harrison?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2920", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Letitia_MacTavish_Hargrave> <http://dbpedia.org/ontology/deathCause> ?uri. <http://dbpedia.org/resource/Sextus_Barbour> <http://dbpedia.org/property/deathCause> ?uri} ", "question": "Por que Letita McTavish Hargrave e Sextus Barbour morreram?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "311", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Domenico_Modugno> <http://dbpedia.org/property/constituency> ?uri } ", "question": "Qual \u00e9 o distrito eleitoral de Domenico Modugno?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Persian_Boy> <http://dbpedia.org/ontology/illustrator> <http://dbpedia.org/resource/Michelangelo>", "target_var": "?u_-1"}], "id": "548", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Persian_Boy> <http://dbpedia.org/ontology/illustrator> <http://dbpedia.org/resource/Michelangelo> }", "question": "Michelangelo \u00e9 o pintor de O Menino Persa?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4052", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Clinton_family> . ?uri <http://dbpedia.org/ontology/lieutenant> <http://dbpedia.org/resource/Joe_Purcell>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}", "question": "Diga o nome do presidente cujos parentes na fam\u00edlia Clinton e tenente chamado Joe Purcell?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4761", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Chess_Monthly> <http://dbpedia.org/property/discipline> ?uri } ", "question": "De que disciplina tratava-se o The Chess Monthly?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_0"}], "id": "1989", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Islam>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Quais santos foram os mensageiros do Isl\u00e3?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "306", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Tonl\u00e9_Sap> } ", "question": "tonle sap flui para qual rio?"}]