[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>", "target_var": "?u_1"}], "id": "1239", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boeing_Field> <http://dbpedia.org/ontology/operator> ?x . ?x <http://dbpedia.org/ontology/countySeat> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Region>}", "question": "Quais s\u00e3o as sedes de condado da regi\u00e3o que opera o Boeing Field?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/A._Bartlett_Giamatti> <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_0"}], "id": "2289", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A._Bartlett_Giamatti> <http://dbpedia.org/ontology/hometown> ?uri } ", "question": "Onde fica a cidade natal de A Bartlett Giamatti?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2740", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Frederick_Frelinghuysen_(general)> <http://dbpedia.org/property/occupation> ?uri } ", "question": "Quais s\u00e3o as profiss\u00f5es de Frederick Frelinghuysen (general)?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Model_C> <http://dbpedia.org/ontology/designCompany> <http://dbpedia.org/resource/Henry_Ford>", "target_var": "?u_-1"}], "id": "275", "query": "ASK WHERE { <http://dbpedia.org/resource/Ford_Model_C> <http://dbpedia.org/ontology/designCompany> <http://dbpedia.org/resource/Henry_Ford> }", "question": "Henry Ford projetou o Modelo C?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Southwest_African_lion> <http://dbpedia.org/ontology/species> ?u_0", "target_var": "?u_0"}], "id": "489", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Southwest_African_lion> <http://dbpedia.org/ontology/species> ?uri } ", "question": "Nomeie a esp\u00e9cie de le\u00e3o do sudoeste africano?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Urban_area>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Urban_area> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Urban_area>", "target_var": "?u_1"}], "id": "1035", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/campus> <http://dbpedia.org/resource/Urban_area> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Contar os esportes praticados em universidades localizadas em \u00e1reas urbanas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1229", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/parentMountainPeak> <http://dbpedia.org/resource/Nevado_de_Toluca>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain>}", "question": "Qual \u00e9 a montanha cujo pico principal \u00e9 o Nevado de Toluca?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Just_Another_Day...> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Queen_Latifah>", "target_var": "?u_-1"}], "id": "4585", "query": "ASK WHERE { <http://dbpedia.org/resource/Just_Another_Day...> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Queen_Latifah> }", "question": "Foi apenas mais um dia feito por Queen Latifah?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1008", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Point!> <http://dbpedia.org/property/narrated> ?uri } ", "question": "Quem foi o narrador no ponto?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_0 .?u_0 <http://dbpedia.org/ontology/hometown> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_0 .?u_0 <http://dbpedia.org/ontology/hometown> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_1 .?u_1 <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?u_1 .?u_1 <http://dbpedia.org/ontology/hometown> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Sammy_Hagar_&_Friends>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Sammy_Hagar_&_Friends> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Sammy_Hagar_&_Friends>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/previousWork> <http://dbpedia.org/resource/Sammy_Hagar_&_Friends> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>", "target_var": "?u_1"}], "id": "4026", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sammy_Hagar_&_Friends> <http://dbpedia.org/ontology/previousWork> ?x . ?x <http://dbpedia.org/ontology/hometown> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Qual \u00e9 a cidade natal da banda que \u00e9 o trabalho anterior de Sammy Hagar &amp; Friends?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Carolyn_Heinrich> <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Vanderbilt_University>", "target_var": "?u_-1"}], "id": "3182", "query": "ASK WHERE { <http://dbpedia.org/resource/Carolyn_Heinrich> <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Vanderbilt_University> }", "question": "Carolyn Heinrich estudou na Vanderbilt?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2532", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Darren_Brass> <http://dbpedia.org/ontology/residence> ?uri. <http://dbpedia.org/resource/Belvin_Perry> <http://dbpedia.org/ontology/residence> ?uri . }", "question": "Em que estado vivem Darren Brass e Belvin Perry?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4169", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/school> <http://dbpedia.org/resource/Michaelhouse> . ?x <http://dbpedia.org/property/school> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RugbyPlayer>}", "question": "Liste toda a escola do jogador de rugby de quem uma da escola \u00e9 Michael House?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2166", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Focke-Wulf_Fw_260> <http://dbpedia.org/property/nationalOrigin> ?uri } ", "question": "Qual \u00e9 a origem nacional do Focke-Wulf Fw 260?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4578", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/founder> <http://dbpedia.org/resource/Akio_Morita> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", "question": "O que \u00e9 fabricado por uma empresa fundada por Akio Morita?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "281", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Downtown_Athletic_Club> . ?uri <http://dbpedia.org/property/presenter> <http://dbpedia.org/resource/Yale_Club_of_New_York_City> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}", "question": "Qual \u00e9 o pr\u00eamio apresentado pelo Downtown Athletic Club e Yale Club NYCity?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1316", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fergie_Sutherland> <http://dbpedia.org/property/race> ?uri } ", "question": "Liste as ra\u00e7as de Fergie Sutherland?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "968", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gold_Coast_Football_Club> <http://dbpedia.org/property/location> ?uri } ", "question": "Onde est\u00e1 localizado o clube de futebol da costa do ouro?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3920", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/G\u00e9rard_Larcher>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Qual \u00e9 o pa\u00eds cujo nome de l\u00edder \u00e9 Grard Larcher?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Dave_Attell>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Adi\u00f3s_Amigo> <http://dbpedia.org/ontology/starring> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Dave_Attell> <http://dbpedia.org/ontology/influencedBy> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dave_Attell> <http://dbpedia.org/ontology/influencedBy> ?u_0 .<http://dbpedia.org/resource/Adi\u00f3s_Amigo> <http://dbpedia.org/ontology/starring> ?u_0", "target_var": "?u_0"}], "id": "3166", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dave_Attell> <http://dbpedia.org/ontology/influencedBy> ?uri. <http://dbpedia.org/resource/Adi\u00f3s_Amigo> <http://dbpedia.org/ontology/starring> ?uri . }", "question": "Quem foi o influenciador de Dave Attel que tamb\u00e9m estrelou em Adios Amigo?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Baco_noir> <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_0"}], "id": "3519", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Baco_noir> <http://dbpedia.org/ontology/wineRegion> ?uri } ", "question": "Nomeie as regi\u00f5es vin\u00edcolas do Baco noir?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "619", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/From_the_Life_of_the_Marionettes> <http://dbpedia.org/ontology/producer> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais s\u00e3o os pr\u00eamios ganhos pelo produtor de Da Vida das Marionetes?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1742", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harry_Harlow> <http://dbpedia.org/property/doctoralStudents> ?uri } ", "question": "Liste os alunos de doutorado de Harry Harlow?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1390", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/majorShrine> <http://dbpedia.org/resource/St._Takla_Haymanot's_Church_(Alexandria)> . ?x <http://dbpedia.org/ontology/majorShrine> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Liste os principais santu\u00e1rios dos santos cujo um dos santu\u00e1rios \u00e9 a Igreja de St. Takla Haymanot?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4050", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Way_to_Your_Heart> <http://dbpedia.org/ontology/recordLabel> ?x . ?x <http://dbpedia.org/property/currency> ?uri  . }", "question": "Que moeda \u00e9 usada pela gravadora Way to Your Heart?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1847", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Raymond_E._Baldwin> <http://dbpedia.org/property/branch> ?uri } ", "question": "Em que departamento trabalha Raymond Baldwin?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1579", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Stony_Brook_University_Hospital> . ?x <http://dbpedia.org/property/education> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FashionDesigner>}", "question": "Onde estudou o estilista que morreu no Stony Brook University Hospital?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1655", "query": "ASK WHERE { <http://dbpedia.org/resource/Mother_Teresa> <http://dbpedia.org/property/beatifiedBy> <http://dbpedia.org/resource/Pope_John_Paul_II> }", "question": "Madre Teresa foi beatificada por Jo\u00e3o Paulo II?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2352", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Kansas_City_Assembly_Plant> <http://dbpedia.org/ontology/owningOrganisation> ?uri. <http://dbpedia.org/resource/Ford_Theatre> <http://dbpedia.org/property/company> ?uri} ", "question": "Qual empresa do Ford Theatre \u00e9 a organiza\u00e7\u00e3o propriet\u00e1ria da f\u00e1brica de montagem da cidade de F0ord Kansa?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Ananda_Weerasekara>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Ananda_Weerasekara> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Ananda_Weerasekara>", "target_var": "?u_1"}], "id": "2212", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Ananda_Weerasekara> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual \u00e9 a religi\u00e3o dos parentes de Ananda Weerasekara?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_1 .<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?u_0 .<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}], "id": "2020", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Anupong_Paochinda> <http://dbpedia.org/ontology/religion> ?uri. <http://dbpedia.org/resource/Udit_Raj> <http://dbpedia.org/ontology/religion> ?uri . }", "question": "Qual religi\u00e3o anupong paochinda e udit raj seguiram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4972", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alexa_Scimeca> <http://dbpedia.org/ontology/currentPartner> ?x . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . }", "question": "Quem s\u00e3o todas as pessoas que costumavam patinar com a atual s\u00f3cia da Alexa Scimeca?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1956", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Isaac_Hayes>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Isaac Hayes j\u00e1 atuou em quais filmes?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4455", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/os> <http://dbpedia.org/resource/Windows_RT> . ?uri <http://dbpedia.org/ontology/product> ?x  . }", "question": "Qual \u00e9 a empresa que possui produtos com o Windows RT como sistema operacional?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_1 <http://dbpedia.org/property/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/location> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_1 <http://dbpedia.org/property/location> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/location> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_1 <http://dbpedia.org/property/location> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_0 <http://dbpedia.org/property/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_0 <http://dbpedia.org/property/location> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> .?u_0 <http://dbpedia.org/property/location> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/location> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>", "target_var": "?u_1"}], "id": "575", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/John_Tory> . ?uri <http://dbpedia.org/property/location> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Quantos edif\u00edcios est\u00e3o localizados na jurisdi\u00e7\u00e3o de John Tory?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4319", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rain_Is_a_Good_Thing> <http://dbpedia.org/property/writer> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }", "question": "Liste o artista musical associado do escritor de Rain Is a Good Thing?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4436", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/champion> <http://dbpedia.org/resource/Joe_McKeehen> . ?x <http://dbpedia.org/property/founded> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsLeague>}", "question": "Quem fundou a liga vencida por Joe McKeehen?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3742", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/European_Broadcasting_Union> . ?uri <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Te_Deum_(Charpentier)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Que programa de TV da European Broadcasting Union tem como tema de abertura Te Deum?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Written_in_the_Stars_(Elton_John_and_LeAnn_Rimes_song)> <http://dbpedia.org/ontology/musicalBand> ?u_0", "target_var": "?u_0"}], "id": "1280", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Written_in_the_Stars_(Elton_John_and_LeAnn_Rimes_song)> <http://dbpedia.org/ontology/musicalBand> ?uri } ", "question": "Qual \u00e9 a banda musical de Written in the Stars?"}]