[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_0 .<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_0 .?u_1 <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0 .?u_1 <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_0 .<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0 .?u_1 <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_1 .<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_1 .?u_0 <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?u_0 .<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?u_1 .?u_0 <http://dbpedia.org/ontology/race> ?u_1", "target_var": "?u_1"}], "id": "2848", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bobby_Beasley> <http://dbpedia.org/ontology/race> ?uri. <http://dbpedia.org/resource/Martin_Molony> <http://dbpedia.org/ontology/race> ?uri . }", "question": "Em quais campeonatos de corrida Bobby Beasley e Martin Molony participaram?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_0 <http://dbpedia.org/ontology/origin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/origin> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_0 <http://dbpedia.org/ontology/origin> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/origin> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/origin> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_1 <http://dbpedia.org/ontology/origin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/origin> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> .?u_1 <http://dbpedia.org/ontology/origin> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>", "target_var": "?u_0"}], "id": "4537", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Troodos_Mountains> . ?x <http://dbpedia.org/ontology/origin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Grape>}", "question": "Qual \u00e9 a origem da uva cuja regi\u00e3o vin\u00edcola \u00e9 a Serra de Troodos?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Brad_Paisley_discography> <http://dbpedia.org/property/artist> ?u_0", "target_var": "?u_0"}], "id": "3813", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brad_Paisley_discography> <http://dbpedia.org/property/artist> ?uri } ", "question": "Diga o nome do artista da discografia de Brad Paisley?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "1567", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/doctoralAdvisor> <http://dbpedia.org/resource/Ernest_Rutherford>  . }", "question": "Ernest Rutherford foi o conselheiro de quantas pessoas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "165", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/composer> <http://dbpedia.org/resource/Judy_Hart_Angelo> . ?uri <http://dbpedia.org/property/company> <http://dbpedia.org/resource/Paramount_Television>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Nomeie o programa de TV cujo compositor \u00e9 Judy Hart Angelo e a companhia como Paramount Television?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4714", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vancouver_Whitecaps_FC> <http://dbpedia.org/property/chairman> ?uri } ", "question": "lista todos os presidentes do Vancouver Whitecaps FC?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/University_of_California,_Santa_Cruz>", "target_var": "?u_0"}], "id": "4272", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/University_of_California,_Santa_Cruz>  . }", "question": "Quais s\u00e3o alguns funcion\u00e1rios da Uni of California, santa cruz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4926", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brown's_Corners,_Toronto> <http://dbpedia.org/ontology/municipality> ?uri. <http://dbpedia.org/resource/Krista_Kelly> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Qual munic\u00edpio de Brown&#39;s Corners, toronto tamb\u00e9m local de nascimento de Krista Kelly?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jill_Krementz>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jill_Krementz> .?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jill_Krementz> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jill_Krementz> .?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>", "target_var": "?u_0"}], "id": "1343", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Jill_Krementz> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Edith_Vonnegut>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Qual escritor famoso foi casado com Jill Krementz e teve um filho chamado Edith Vonnegut?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2013", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tennie_and_Laura_(schooner)> <http://dbpedia.org/property/nearestCity> ?uri } ", "question": "Diga o nome da cidade mais pr\u00f3xima de Tennie e Laura?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "273", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Simon_Fuller>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos programas de TV foram criados por Simon Fuller?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "71", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Witherspoon> <http://dbpedia.org/ontology/governor> ?x . ?x <http://dbpedia.org/property/appointer> ?uri  . }", "question": "Quem nomeou o governador sob o qual Robert Witherspoon trabalhou?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3887", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/ITV_(Thailand)> <http://dbpedia.org/property/area> ?uri } ", "question": "Qual \u00e9 a \u00e1rea de ITV (Tail\u00e2ndia)?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "394", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/children> <http://dbpedia.org/resource/Lori_Black> . ?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Henry_E._Catto,_Jr.>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o titular do cargo cuja filha \u00e9 Lori Black e o predecessor \u00e9 Henry E. Catto Jr?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "583", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Ron_Grainer> . ?uri <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/BBC_HD>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual m\u00fasica tema do programa de televis\u00e3o foi dada por Ron Grainer e \u00e9 transmitida pela BBC HD?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1367", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Humes_High_School>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Diga o nome de uma pessoa que foi educada na Humes High School?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4987", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/Weber_Thompson> . ?x <http://dbpedia.org/property/address> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}", "question": "Onde encontro pr\u00e9dios alugados pela Weber Thompson?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4088", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Henri_Maspero> <http://dbpedia.org/ontology/academicAdvisor> ?x . ?x <http://dbpedia.org/property/fields> ?uri  . }", "question": "Qual \u00e9 a \u00e1rea de interesse do assessor de Henri Maspero?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Miami>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/cities> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/cities> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Miami> .?u_0 <http://dbpedia.org/property/cities> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Miami>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Miami> .?u_1 <http://dbpedia.org/property/cities> ?u_0", "target_var": "?u_0"}], "id": "1013", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Miami> . ?x <http://dbpedia.org/property/cities> ?uri }", "question": "Contar as cidades que est\u00e3o no mesmo mar que Miami?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3003", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/FWD.us> <http://dbpedia.org/property/keyPeople> ?uri } ", "question": "Quem s\u00e3o as pessoas-chave do FWD.us?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4788", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Into_the_Dalek> <http://dbpedia.org/property/executiveProducer> ?uri } ", "question": "Quem \u00e9 o produtor executivo de Into the Dalek?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Robert_Nederlander> <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Gary_S\u00e1nchez> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Nederlander> <http://dbpedia.org/ontology/knownFor> ?u_0 .<http://dbpedia.org/resource/Gary_S\u00e1nchez> <http://dbpedia.org/ontology/debutTeam> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Nederlander> <http://dbpedia.org/ontology/knownFor> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Gary_S\u00e1nchez> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Nederlander> <http://dbpedia.org/ontology/knownFor> ?u_0 .<http://dbpedia.org/resource/Gary_S\u00e1nchez> <http://dbpedia.org/ontology/debutTeam> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}], "id": "4407", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Nederlander> <http://dbpedia.org/ontology/knownFor> ?uri. <http://dbpedia.org/resource/Gary_S\u00e1nchez> <http://dbpedia.org/ontology/debutTeam> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Qual time \u00e9 famoso por Robert Nederlander e tamb\u00e9m o time de estreia de Gary Sanchez?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3532", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/California> . ?uri <http://dbpedia.org/property/training> ?x  . }", "question": "Liste todos os que receberam treinamento na cidade da Calif\u00f3rnia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1763", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Fran\u00e7ois_Burgers> <http://dbpedia.org/property/restingplace> ?uri. <http://dbpedia.org/resource/Johannes_Gerhardus_Strijdom> <http://dbpedia.org/property/restingplace> ?uri . }", "question": "Onde est\u00e3o enterrados Thomas Franois Burgers e Johannes Gerhardus Strijdom?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4530", "query": "ASK WHERE { <http://dbpedia.org/resource/Richard_Marx> <http://dbpedia.org/property/instrument> <http://dbpedia.org/resource/Guitar> }", "question": "Richard Marx toca guitarra?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Sony_Corporation_shareholders_and_subsidiaries>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Sony_Corporation_shareholders_and_subsidiaries> .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Sony_Corporation_shareholders_and_subsidiaries>", "target_var": "?u_1"}], "id": "2253", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Sony_Corporation_shareholders_and_subsidiaries> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", "question": "Quantas coisas s\u00e3o fabricadas pela empresa cuja subsidi\u00e1ria s\u00e3o acionistas e subsidi\u00e1rias da Sony Corporation?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/successor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/successor> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/successor> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/successor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/successor> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/successor> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_1"}], "id": "2781", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/president> <http://dbpedia.org/resource/Bill_Clinton> . ?uri <http://dbpedia.org/property/successor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o n\u00famero total de detentores de cargos que precederam as pessoas que trabalharam sob o presidente Bill Clinton?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> .?u_0 <http://dbpedia.org/property/locations> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario> .?u_0 <http://dbpedia.org/ontology/locationCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> .?u_1 <http://dbpedia.org/property/locations> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/locations> <http://dbpedia.org/resource/Ontario> .?u_1 <http://dbpedia.org/ontology/locationCity> ?u_0", "target_var": "?u_1"}], "id": "3592", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }", "question": "Em que outros locais existem empresas que tamb\u00e9m est\u00e3o em Ont\u00e1rio?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "526", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/P\u014dmare_I> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/ontology/deathPlace> ?uri  . }", "question": "Qual \u00e9 o POD do sucessor do Pmare I?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_0 .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://dbpedia.org/ontology/board> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?u_1 .?u_0 <http://dbpedia.org/ontology/board> ?u_1", "target_var": "?u_1"}], "id": "4263", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wiktionary> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/board> ?uri  . }", "question": "A quais conselhos de empresas pertencem os redatores do Wikcion\u00e1rio?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "377", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/governor> <http://dbpedia.org/resource/Charles_Willing_Byrd> . ?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/North_Bend,_Ohio>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "O governador de qual titular \u00e9 Charles Willing Byrd e tem lugar de descanso final em North Bend, Ohio?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1559", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jason_Carter_(actor)> . ?uri <http://dbpedia.org/property/network> <http://dbpedia.org/resource/TNT_(TV_channel)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o que tem como membros do elenco Jason Carter e a rede TNT (canal de TV)?"}]