[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Thomas_Bryan_Martin> <http://dbpedia.org/ontology/associate> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Thomas_Bryan_Martin> <http://dbpedia.org/ontology/associate> ?u_0 .<http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?u_0", "target_var": "?u_0"}], "id": "4153", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Bryan_Martin> <http://dbpedia.org/ontology/associate> ?uri. <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri} ", "question": "Quem \u00e9 associado de THomas Bryan Martin tamb\u00e9m \u00e9 o fundador de Pittsburgh?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "468", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WXXV-DT2> <http://dbpedia.org/property/licensee> ?uri } ", "question": "Quem concede a licen\u00e7a do WXXV-DT2?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Hockey>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Hockey> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1 .?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Hockey>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Hockey> .?u_1 <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "157", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/sport> <http://dbpedia.org/resource/Hockey> . ?x <http://dbpedia.org/ontology/sport> ?uri }", "question": "Contar o n\u00famero de esportes praticados por escolas que praticam h\u00f3quei?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1295", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBurial> <http://dbpedia.org/resource/Little_Easton> . ?x <http://dbpedia.org/property/placeOfBurial> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Liste o t\u00famulo dos membros da realeza cujo cemit\u00e9rio \u00e9 Little Easton?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/occupation> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/occupation> <http://dbpedia.org/resource/Screenwriter> .?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/occupation> <http://dbpedia.org/resource/Screenwriter>", "target_var": "?u_1"}], "id": "4740", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/occupation> <http://dbpedia.org/resource/Screenwriter> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quantos pr\u00eamios foram dados aos roteiristas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2940", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Estadio_Nacional_de_Costa_Rica_(2011)> <http://dbpedia.org/ontology/builder> ?uri } ", "question": "Quem \u00e9 o construtor do Estadio Nacional de Costa Rica (2011)?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Microsoft_Windows>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Microsoft_Windows> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>", "target_var": "?u_0"}], "id": "3456", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Microsoft_Windows>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quantos softwares rodam no sistema operacional o Microsoft Windows?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "373", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Counterpoint_(horse)> <http://dbpedia.org/property/grandsire> ?x . ?x <http://dbpedia.org/ontology/honours> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Horse>}", "question": "Quais s\u00e3o os pr\u00eamios dados ao cavalo cujo neto \u00e9 o famoso contraponto?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Swedish_Covenant_Hospital> <http://dbpedia.org/ontology/location> ?u_0", "target_var": "?u_0"}], "id": "79", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Swedish_Covenant_Hospital> <http://dbpedia.org/ontology/location> ?uri } ", "question": "Onde fica o hospital da alian\u00e7a sueca?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1553", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Norbert_Wiener_Award_for_Social_and_Professional_Responsibility>  . }", "question": "Quem ganhou o Pr\u00eamio Norbert Wiener por Responsabilidade Social e Profissional?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2131", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/U.S._Route_165> . ?x <http://dbpedia.org/property/office> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "O pessoal de qual escrit\u00f3rio morreu na rota 165 dos EUA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4439", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Tillingdale> . ?x <http://dbpedia.org/property/race> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Horse>}", "question": "Em quais corridas os cavalos de Tillingdale participaram?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "248", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cadillac_Fleetwood> <http://dbpedia.org/property/related> ?x . ?x <http://dbpedia.org/ontology/predecessor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Qual \u00e9 o antecessor do autom\u00f3vel que \u00e9 o parente de Cadillac Fleetwood?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Lima>", "target_var": "?u_0"}], "id": "931", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Lima> } ", "question": "A maior cidade de que pa\u00eds \u00e9 Lima?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> .?u_0 <http://dbpedia.org/ontology/opponent> ?u_1", "target_var": "?u_1"}], "id": "1335", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Ike_Clanton> . ?uri <http://dbpedia.org/ontology/opponent> <http://dbpedia.org/resource/Billy_Clanton> . }", "question": "Cujos oponentes s\u00e3o Ike Clanton e Billy Clanton?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}], "id": "4524", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?uri } ", "question": "Liste o instituto de Robert Hall?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/South_Thailand_insurgency> <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/South_Thailand_insurgency> <http://dbpedia.org/ontology/commander> ?u_0 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/South_Thailand_insurgency> <http://dbpedia.org/ontology/commander> ?u_1", "target_var": "?u_1"}], "id": "1338", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/South_Thailand_insurgency> <http://dbpedia.org/ontology/commander> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "A qual religi\u00e3o pertence o comandante da insurg\u00eancia da Tail\u00e2ndia do Sul?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1406", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/notableworks> <http://dbpedia.org/resource/Maniac_Magee>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Quem foi o escritor do romance Maniac Magee?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Emmett_Hughes> <http://dbpedia.org/ontology/nationality> ?u_0", "target_var": "?u_0"}], "id": "1090", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Emmett_Hughes> <http://dbpedia.org/ontology/nationality> ?uri  . }", "question": "De onde \u00e9 Emmett Hughes?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4209", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Laurie_Johnson>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Quais s\u00e3o os filmes cuja m\u00fasica \u00e9 dada por Laurie Johnson?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "742", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> . ?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/PlayStation_2>  . }", "question": "Qual aparelho a Sony fez ap\u00f3s o sucesso do PlayStation 2?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2323", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/class> <http://dbpedia.org/resource/Luxury_vehicle> . ?x <http://dbpedia.org/property/related> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Quais s\u00e3o alguns carros semelhantes aos carros de luxo?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3601", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/judges> <http://dbpedia.org/resource/Harry_Connick,_Jr.>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual programa de televis\u00e3o \u00e9 magistrado por Harry Connick Jr.?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2123", "query": "ASK WHERE { <http://dbpedia.org/resource/Behave_Yourself!> <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Paul_Weatherwax> }", "question": "Paul Weatherwax era editor da Behave Yourself?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2094", "query": "ASK WHERE { <http://dbpedia.org/resource/Journal_of_Cancer> <http://dbpedia.org/property/license> <http://dbpedia.org/resource/Creative_Commons_license> }", "question": "o jornal do c\u00e2ncer tem a licen\u00e7a de creative commons?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "240", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/developer> <http://dbpedia.org/resource/Blizzard_Entertainment> . ?x <http://dbpedia.org/property/genre> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Que g\u00eanero de jogos s\u00e3o feitos pelos est\u00fadios da Blizzard Entertainment?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Doctor_Who:_Evacuation_Earth> <http://dbpedia.org/ontology/series> ?u_0", "target_var": "?u_0"}], "id": "2351", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Doctor_Who:_Evacuation_Earth> <http://dbpedia.org/ontology/series> ?uri } ", "question": "Diga o nome da s\u00e9rie de Doctor Who: Evacuation Earth?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1370", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Face_to_Face_(1976_film)> <http://dbpedia.org/property/writer> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Liste os pr\u00eamios ganhos pelo roteirista de Face to Face?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Govinda_(actor)> <http://dbpedia.org/ontology/party> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?u_0 .<http://dbpedia.org/resource/Govinda_(actor)> <http://dbpedia.org/ontology/party> ?u_0", "target_var": "?u_0"}], "id": "1057", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chandra_Shekhar> <http://dbpedia.org/ontology/otherParty> ?uri. <http://dbpedia.org/resource/Govinda_(actor)> <http://dbpedia.org/ontology/party> ?uri} ", "question": "Qual \u00e9 a festa comum de Chandra Shekhar e Govinda?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4816", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Motorcycle_Diaries_(film)> <http://dbpedia.org/property/screenplay> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Que pr\u00eamios foram dados ao roteiro de Di\u00e1rios de Motocicleta?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "199", "query": "ASK WHERE { <http://dbpedia.org/resource/Jack_Ryan_(politician)> <http://dbpedia.org/ontology/nominee> <http://dbpedia.org/resource/United_States_Senate> }", "question": "Jack Ryan foi nomeado para o Senado dos Estados Unidos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2280", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Entertainment_One_Music> . ?x <http://dbpedia.org/ontology/bandMember> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Quais s\u00e3o alguns artistas musicais cujas bandas assinaram contrato com a Entertainment One Music?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4749", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dan_Daoust> <http://dbpedia.org/ontology/formerTeam> ?uri. <http://dbpedia.org/resource/Don_Ashby> <http://dbpedia.org/property/playedFor> ?uri . }", "question": "Para qual time Dan Daoust e Don Ashby jogaram?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2220", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Radio_Philippines_Network> <http://dbpedia.org/property/area> ?uri } ", "question": "Nomeie a \u00e1rea de transmiss\u00e3o da Rede R\u00e1dio Filipinas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4771", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fort_Heath_radar_station> <http://dbpedia.org/property/district> ?uri. <http://dbpedia.org/resource/Joseph_Story> <http://dbpedia.org/property/state> ?uri} ", "question": "Em qual distrito da esta\u00e7\u00e3o de radar de Fort Heath \u00e9 tamb\u00e9m o estado de Joesph Story?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2819", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Gulf_of_Mexico> . ?uri <http://dbpedia.org/property/sourceLocation> <http://dbpedia.org/resource/Itasca_State_Park>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "A foz de qual rio est\u00e1 localizada no Golfo do M\u00e9xico e seu local de origem \u00e9 o Parque Estadual de Itasca?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/My_Truly,_Truly_Fair> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Mitch_Miller>", "target_var": "?u_-1"}], "id": "3150", "query": "ASK WHERE { <http://dbpedia.org/resource/My_Truly,_Truly_Fair> <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Mitch_Miller> }", "question": "\u00c9 meu verdadeiro e verdadeiramente justo o bando de Mitch Miller?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3107", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Instituts_d'\u00e9tudes_politiques> . ?uri <http://dbpedia.org/property/successor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Que pol\u00edtico foi sucedido por algu\u00e9m que se formou nos Instituts d&#39;tudes politiques?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1973", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?x <http://dbpedia.org/property/mascot> ?uri  . }", "question": "Quantos mascotes diferentes existem nas equipes da NCAA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1375", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Digit-Alb> <http://dbpedia.org/ontology/regionServed> ?uri. <http://dbpedia.org/resource/Christine_Rolfes> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Em qual dos continentes em que Digitalb atuou, Christine Rolfes nasceu?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3968", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WTA_Tour_Championships> <http://dbpedia.org/property/country> ?uri } ", "question": "Qual na\u00e7\u00e3o hospeda o WTA Tour Championships?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4062", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Julian_Gingell> . ?uri <http://dbpedia.org/property/channel> <http://dbpedia.org/resource/Fox_Broadcasting_Company>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de televis\u00e3o cuja m\u00fasica-tema foi composta por Julian Gingell e transmitida pela FOX?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4445", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Postman_(film)> <http://dbpedia.org/property/screenplay> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Qual \u00e9 o pr\u00eamio recebido por quem escreveu o roteiro de The Postman?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Laemmle_Theatres> <http://dbpedia.org/ontology/service> ?u_0", "target_var": "?u_0"}], "id": "3557", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Laemmle_Theatres> <http://dbpedia.org/ontology/service> ?uri } ", "question": "Quais s\u00e3o os pr\u00eamios conquistados pelo Laemmle Theatres?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "964", "query": "ASK WHERE { <http://dbpedia.org/resource/Nintendo> <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Video_game> }", "question": "A nintendo est\u00e1 na ind\u00fastria de videogames?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "179", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Henry_E._Catto,_Jr.> . ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Screen_Actors_Guild_Life_Achievement_Award>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o titular do cargo cujo antecessor \u00e9 Henry E. Catto, Jr. e ganhou o pr\u00eamio Screen Actors Guild Life Achievement Award?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3698", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Army_Group_Oberrhein_(Germany)> <http://dbpedia.org/property/notableCommanders> ?uri. <http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?uri} ", "question": "Que comandantes not\u00e1veis do Grupo de Ex\u00e9rcitos Oberrhein (Alemanha) \u00e9 o l\u00edder da Kriminalpolizei?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3821", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Soccer_Bowl_'76> <http://dbpedia.org/ontology/city> ?uri. <http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?uri} ", "question": "Qual mantenedor do Cheasty Boulevard South tamb\u00e9m \u00e9 a cidade do Soccer Bowl &#39;76?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3899", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1993_European_Grand_Prix> <http://dbpedia.org/property/firstDriver> ?uri } ", "question": "Qual piloto ficou em primeiro lugar no Grande Pr\u00eamio da Europa de 1993?"}]