[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_0 .?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_0 .?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_1 .?u_0 <http://dbpedia.org/ontology/spouse> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?u_1 .?u_1 <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_0"}], "id": "1432", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kimberly_Stewart> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/ontology/spouse> ?uri  . }", "question": "Quem s\u00e3o os c\u00f4njuges dos pais de Kimberly Stewart?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathCause> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> .?u_0 <http://dbpedia.org/ontology/deathCause> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathCause> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> .?u_1 <http://dbpedia.org/ontology/deathCause> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> .?u_0 <http://dbpedia.org/ontology/deathCause> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> .?u_1 <http://dbpedia.org/ontology/deathCause> ?u_0", "target_var": "?u_0"}], "id": "4200", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", "question": "Do que morreram alguns crist\u00e3os famosos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3095", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Zora_Singh_Maan> <http://dbpedia.org/property/constituency> ?x . ?x <http://dbpedia.org/ontology/leaderName> ?uri  . }", "question": "Quem \u00e9 o prefeito da cidade sob a qual \u00e9 o eleitorado de Zora Singh Maan?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2922", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Breann_McGregor> <http://dbpedia.org/property/knownFor> ?uri. <http://dbpedia.org/resource/Anika_Knudsen> <http://dbpedia.org/property/knownFor> ?uri . }", "question": "Quais s\u00e3o Breann McGregor e Anika Knudsen, ambos conhecidos?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "644", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/prizes> <http://dbpedia.org/resource/Gold_Medal_of_the_Royal_Astronomical_Society> . ?uri <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Cape_Town>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Diga o nome de um cientista cuja resid\u00eancia oficial \u00e9 a Cidade do Cabo e que tamb\u00e9m ganhou uma medalha de ouro na Royal Astronomical Society?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1049", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/Norwalk_Trainband> . ?x <http://dbpedia.org/property/restingplace> ?uri  . }", "question": "Em quantos lugares posso encontrar tumbas de pessoas que lutaram na faixa ferrovi\u00e1ria de Norwalk?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3745", "query": "ASK WHERE { <http://dbpedia.org/resource/GeneWeb> <http://dbpedia.org/property/license> <http://dbpedia.org/resource/GNU_General_Public_License> }", "question": "O GeneWeb tem licen\u00e7a GPL?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4093", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dad's_Root_Beer> <http://dbpedia.org/property/locationCity> ?uri } ", "question": "Qual \u00e9 a localiza\u00e7\u00e3o de Dad&#39;s Root Beer no Google Maps?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Darcs> <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/GNU>", "target_var": "?u_-1"}], "id": "4403", "query": "ASK WHERE { <http://dbpedia.org/resource/Darcs> <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/GNU> }", "question": "O Darcs \u00e9 lan\u00e7ado com uma licen\u00e7a GNU?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "120", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fort_Heath_radar_station> <http://dbpedia.org/property/district> ?uri } ", "question": "Qual \u00e9 a esta\u00e7\u00e3o de radar do distrito de Fort Heath?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>", "target_var": "?u_0"}], "id": "2052", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/veneratedIn> <http://dbpedia.org/resource/Judaism>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Saint>}", "question": "Quantos santos foram venerados no Juda\u00edsmo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4258", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/'03_Bonnie_&_Clyde> <http://dbpedia.org/ontology/writer> ?x . ?x <http://dbpedia.org/ontology/associatedBand> ?uri  . }", "question": "Liste todas as bandas \u00e0s quais os escritores de 03 Bonnie &amp; Clyde est\u00e3o associados?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_Les_Paul>", "target_var": "?u_0"}], "id": "4888", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/notableInstruments> <http://dbpedia.org/resource/Gibson_Les_Paul>  . }", "question": "Quantas pessoas s\u00e3o famosas pela Gibson Les Paul?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4334", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/neighboringMunicipalities> <http://dbpedia.org/resource/Ch\u00eane-Bougeries>  . }", "question": "Quais s\u00e3o os munic\u00edpios adjacentes a Chne-Bougeries?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4691", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oprah_Winfrey_Network_(U.S._TV_channel)> <http://dbpedia.org/property/founder> ?uri } ", "question": "Quem \u00e9 o fundador da Oprah Winfrey Network (canal de TV dos EUA)?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_0 .<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_0 .?u_1 <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_0 .?u_1 <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_0 .<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_0 .?u_1 <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_1 .<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_0 .<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?u_1 .?u_0 <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?u_1 .?u_0 <http://dbpedia.org/ontology/almaMater> ?u_1", "target_var": "?u_1"}], "id": "134", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Angela_Trusty> <http://dbpedia.org/ontology/almaMater> ?uri. <http://dbpedia.org/resource/Charles_Ayres> <http://dbpedia.org/ontology/almaMater> ?uri . }", "question": "Qual \u00e9 a alma mater de Angela Trusty e Charles Ayres?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "184", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Azam_F.C.> <http://dbpedia.org/property/name> ?x . ?x <http://dbpedia.org/ontology/team> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer>}", "question": "Em que clubes jogam os jogadores do Azam FC?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/phylum> <http://dbpedia.org/resource/Chordate>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/phylum> <http://dbpedia.org/resource/Chordate> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}], "id": "1392", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/phylum> <http://dbpedia.org/resource/Chordate>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "Quais s\u00e3o os mam\u00edferos cujo filo \u00e9 Chordate?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2276", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lee_Si-Chen> <http://dbpedia.org/property/almaMater> ?uri. <http://dbpedia.org/resource/Doug_Walgren> <http://dbpedia.org/ontology/almaMater> ?uri . }", "question": "Onde Doug Walgren e Lee Si Chen estudaram?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR> .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/MTR> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/MTR> <http://dbpedia.org/ontology/operator> ?u_1", "target_var": "?u_1"}], "id": "511", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/MTR> . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . }", "question": "D\u00ea-me uma estimativa do n\u00famero de fabricantes cujos produtos s\u00e3o gerenciados pela MTR?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Rickenbacker>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Rickenbacker> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_0"}], "id": "4729", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Rickenbacker>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "Quantos artistas tocam como Rickenbacker?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Carolyn_Dennis> <http://dbpedia.org/ontology/associatedMusicalArtist> ?u_0", "target_var": "?u_0"}], "id": "4054", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carolyn_Dennis> <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri } ", "question": "Quem s\u00e3o os artistas musicais associados de Carolyn Dennis?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Anne_Hidalgo>", "target_var": "?u_0"}], "id": "3137", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/mayor> <http://dbpedia.org/resource/Anne_Hidalgo>  . }", "question": "A prefeita de quais cidades \u00e9 anne hidalgo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2669", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/river> <http://dbpedia.org/resource/Pequea_Creek> . ?x <http://dbpedia.org/ontology/state> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Em quais estados existem pontes sobre o riacho Pequea?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ragout_fin> <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_0"}], "id": "4773", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Ragout_fin> <http://dbpedia.org/ontology/ingredient> ?uri  . }", "question": "Quantos ingredientes s\u00e3o necess\u00e1rios para fazer o Ragout Fin?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://dbpedia.org/property/writer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/writer> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> .?u_0 <http://dbpedia.org/property/writer> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>", "target_var": "?u_1"}], "id": "2117", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/recordedIn> <http://dbpedia.org/resource/Criteria_Studios> . ?x <http://dbpedia.org/property/writer> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist>}", "question": "Diga-me o n\u00famero de escritores cujas obras foram gravadas no Criteria Studios?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "251", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/archipelago> <http://dbpedia.org/resource/Canary_Islands> } ", "question": "Em que arquip\u00e9lago est\u00e3o as Ilhas Can\u00e1rias?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?u_0", "target_var": "?u_0"}], "id": "3526", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } ", "question": "o nome do est\u00e1dio do FC Spartak Moscou, temporada 2011-12"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3559", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull> . ?uri <http://dbpedia.org/property/products> <http://dbpedia.org/resource/RenderMan_(software)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Nomeie uma empresa com uma das pessoas-chave como Edwin Catmull e produz o RenderMan?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4011", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/routeStart> <http://dbpedia.org/resource/South_Station> . ?x <http://dbpedia.org/property/owner> ?uri  . }", "question": "Quantos propriet\u00e1rios existem de linhas que come\u00e7am na Esta\u00e7\u00e3o Sul?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1507", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Dean_Ambrose>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Quais s\u00e3o alguns m\u00fasicos que trabalharam com Dean Ambrose?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "122", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", "question": "Conte todos aqueles que jogaram pelo clube juvenil dono do est\u00e1dio Ros\u00e1rio, Santa Fe."}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/Playtone>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/Playtone> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "4259", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/Playtone>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de televis\u00e3o cuja empresa \u00e9 a Playtone?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3333", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/district> <http://dbpedia.org/resource/Mumbai_Suburban_district> . ?x <http://dbpedia.org/ontology/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Em que cidade est\u00e3o as escolas cujo distrito \u00e9 Mumbai Suburban?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "1871", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/Stoke_City_F.C.>  . }", "question": "Quantas pessoas atualmente jogam pelo Stoke City FC?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia> .?u_0 <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}], "id": "3692", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/capital> <http://dbpedia.org/resource/Nicomedia> . ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Aureus>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Entre os pa\u00edses que usam o Aureus como moeda, qual teve a Nicom\u00e9dia como um lugar importante?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "567", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/outflow> <http://dbpedia.org/resource/Congo_River> . ?x <http://dbpedia.org/ontology/outflow> ?uri  . }", "question": "Quais s\u00e3o as vaz\u00f5es dos lagos que tamb\u00e9m tem uma das vaz\u00f5es como o rio Congo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1371", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/territory> <http://dbpedia.org/resource/Dane_County,_Wisconsin> . ?uri <http://dbpedia.org/ontology/restingPlace> ?x  . }", "question": "Cuja tumba est\u00e1 em cidades sob o condado de Dane, em Wisconsin?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/related> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/related> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/related> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Cadillac_Fleetwood> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/related> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/related> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/related> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>", "target_var": "?u_1"}], "id": "3185", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Cadillac_Fleetwood> <http://dbpedia.org/property/related> ?x . ?x <http://dbpedia.org/ontology/predecessor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Automobile>}", "question": "Quantos carros sucederam aos carros semelhantes ao Cadillac Fleetwood?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Elsie_Paroubek> <http://dbpedia.org/ontology/bodyDiscovered> <http://dbpedia.org/resource/Chicago>", "target_var": "?u_-1"}], "id": "3955", "query": "ASK WHERE { <http://dbpedia.org/resource/Elsie_Paroubek> <http://dbpedia.org/ontology/bodyDiscovered> <http://dbpedia.org/resource/Chicago> }", "question": "O corpo de Elsie Paroubek foi descoberto em Chicago?"}]