[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/homeStadium> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/homeStadium> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/homeStadium> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_1 <http://dbpedia.org/ontology/homeStadium> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/homeStadium> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> .?u_1 <http://dbpedia.org/ontology/homeStadium> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>", "target_var": "?u_0"}], "id": "1188", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Merritt_Paulson> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClubSeason>}", "question": "Onde est\u00e3o os homestadiums das temporadas presididos por Merritt Paulson?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2989", "query": "ASK WHERE { <http://dbpedia.org/resource/Elizabeth_Ann_Seton> <http://dbpedia.org/property/beatifiedBy> <http://dbpedia.org/resource/Pope_John_XXIII> }", "question": "Elizabeth ann seton foi beatificada pelo Papa Jo\u00e3o XXIII?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/First_National_Bank_and_Trust_Building_(Lima,_Ohio)> <http://dbpedia.org/ontology/architecturalStyle> ?u_0", "target_var": "?u_0"}], "id": "2080", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/First_National_Bank_and_Trust_Building_(Lima,_Ohio)> <http://dbpedia.org/ontology/architecturalStyle> ?uri } ", "question": "Qual \u00e9 a arquitetura do First National Bank and Trust Building (Lima, Ohio)?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Italic_languages>", "target_var": "?u_0"}], "id": "4983", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Italic_languages> } ", "question": "Quais s\u00e3o alguns idiomas da fam\u00edlia de idiomas it\u00e1lico?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/presenter> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/presenter> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_1 <http://dbpedia.org/ontology/presenter> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/presenter> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_1 <http://dbpedia.org/ontology/presenter> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_0 <http://dbpedia.org/ontology/presenter> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> .?u_0 <http://dbpedia.org/ontology/presenter> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}], "id": "3437", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> . ?uri <http://dbpedia.org/ontology/presenter> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}", "question": "Conte todos os pr\u00eamios que foram entregues por algo localizado na Calif\u00f3rnia."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "108", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kim_Sawchuk> <http://dbpedia.org/property/region> ?uri. <http://dbpedia.org/resource/Airtours_International_Airways> <http://dbpedia.org/property/destinations> ?uri} ", "question": "Qual \u00e9 a regi\u00e3o de Kim Sawchuk que tamb\u00e9m \u00e9 servida pela Airtours International Airways?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Gough_Whitlam>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Gough_Whitlam> <http://dbpedia.org/ontology/primeMinister> ?u_0", "target_var": "?u_0"}], "id": "4698", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/primeMinister> <http://dbpedia.org/resource/Gough_Whitlam> } ", "question": "Quem ocupava um cargo quando Gough Whitlam era o primeiro-ministro?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2827", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kim_Sawchuk> <http://dbpedia.org/property/region> ?uri. <http://dbpedia.org/resource/Vuelta_Mexico_Telmex> <http://dbpedia.org/property/region> ?uri . }", "question": "Em que parte do mundo vou encontrar Kim Sawchuk e Vuelta Mexico Telmex?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4747", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/Turkish_Handball_Super_League> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Quais s\u00e3o os mascotes das equipes participantes da Superliga de Handebol da Turquia?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "58", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri} ", "question": "Quais inquilinos do centro Master Card tamb\u00e9m s\u00e3o a equipe de recrutamento de Sam Carrrick"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_0 .<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_0 .?u_1 <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_0 .?u_1 <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_0 .<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_0 .?u_1 <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_1 .<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_0 .<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?u_1 .?u_0 <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?u_1 .?u_0 <http://dbpedia.org/ontology/citizenship> ?u_1", "target_var": "?u_1"}], "id": "76", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/ontology/citizenship> ?uri. <http://dbpedia.org/resource/Edmund_John> <http://dbpedia.org/ontology/citizenship> ?uri . }", "question": "Que pa\u00eds concedeu cidadania a saima chowdhury e edmund john?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "796", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/illustrator> <http://dbpedia.org/resource/Tamon_Ohta> . ?x <http://dbpedia.org/property/author> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Manga>}", "question": "Quem originalmente escreveu o mang\u00e1 que mais tarde foi ilustrado por Tamon Ohta?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "368", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richard_H._Immerman> <http://dbpedia.org/property/education> ?uri. <http://dbpedia.org/resource/Franklin_W._Olin> <http://dbpedia.org/property/education> ?uri . }", "question": "Qual universidade foi frequentada por Richard H Immerman e Franklin W Olin?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Cherokee>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/ethnicity> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/ethnicity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/ethnicity> <http://dbpedia.org/resource/Cherokee>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ethnicity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ethnicity> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Cherokee>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/ethnicity> <http://dbpedia.org/resource/Cherokee>", "target_var": "?u_0"}], "id": "4905", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/ethnicity> <http://dbpedia.org/resource/Cherokee> . ?x <http://dbpedia.org/property/ethnicity> ?uri }", "question": "Quantas outras ra\u00e7as existem de atores adultos (pornogr\u00e1ficos) cuja etnia \u00e9 Cherokee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "785", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Politics_of_Brunei> . ?x <http://dbpedia.org/ontology/maintainedBy> ?uri  . }", "question": "Quem mant\u00e9m o material projetado pelo governo de Brunei?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm>", "target_var": "?u_0"}], "id": "2088", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm>  . }", "question": "Estocolmo \u00e9 o HQ de quantas coisas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_0"}], "id": "2314", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ", "question": "O que \u00e9 um salthill?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3384", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Oulu> . ?uri <http://dbpedia.org/property/cities> <http://dbpedia.org/resource/Turku> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Sea>}", "question": "Qual \u00e9 o mar conectado a Oulu e Turku?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3605", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/homeTown> <http://dbpedia.org/resource/Great_Missenden> . ?x <http://dbpedia.org/ontology/parent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}", "question": "Liste todos os pais de escritores vindos do Grande Missenden?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Baco_noir> <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_0"}], "id": "4111", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Baco_noir> <http://dbpedia.org/ontology/wineRegion> ?uri  . }", "question": "Em quantas regi\u00f5es \u00e9 feito o Baco Noir?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1902", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Water_resources_management_in_El_Salvador> <http://dbpedia.org/property/sourceCountry> ?uri. <http://dbpedia.org/resource/Jos\u00e9_Mar\u00eda_Orellana> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Qual \u00e9 o pa\u00eds de origem da gest\u00e3o dos recursos h\u00eddricos em EL Salvador \u00e9 tamb\u00e9m a terra de Jos MAra Orellana?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Jerusalem_Institute_of_Justice> <http://dbpedia.org/ontology/service> ?u_0", "target_var": "?u_0"}], "id": "1703", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jerusalem_Institute_of_Justice> <http://dbpedia.org/ontology/service> ?uri } ", "question": "Onde o Instituto de Justi\u00e7a de Jerusal\u00e9m presta seus servi\u00e7os?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "121", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harding_Academy_(Memphis)> <http://dbpedia.org/property/nickname> ?uri. <http://dbpedia.org/resource/Lyons_Township_High_School> <http://dbpedia.org/property/nickname> ?uri . }", "question": "Qual \u00e9 o apelido comum dado tanto \u00e0 Harding Academy quanto \u00e0 Lyons Township High School?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}], "id": "1844", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Siberia> <http://dbpedia.org/ontology/border> ?uri } ", "question": "O que faz fronteira com a Sib\u00e9ria?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2369", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfDeath> <http://dbpedia.org/resource/Delhi> . ?x <http://dbpedia.org/property/party> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "A que partido pertencem os pol\u00edticos que morreram em Delhi?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3728", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/tenant> <http://dbpedia.org/resource/Boston_Red_Sox> . ?x <http://dbpedia.org/property/architect> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Stadium>}", "question": "Quem criou os est\u00e1dios que foram alugados pelo Boston Red Sox?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/successor> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?u_0 .?u_0 <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?u_1 .?u_1 <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}], "id": "910", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jerome_B._Chaffee> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/region> ?uri  . }", "question": "Qual \u00e9 a regi\u00e3o do sucessor do Sr. Jerome B. Chaffee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "124", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chris_Myers_(New_Jersey)> <http://dbpedia.org/ontology/profession> ?uri. <http://dbpedia.org/resource/Oahu_Railway_and_Land_Company> <http://dbpedia.org/property/governingBody> ?uri} ", "question": "Qual \u00e9 a profiss\u00e3o de Chris Myers (New Jersey), que \u00e9 o \u00f3rg\u00e3o dirigente da Oahu Railway and Land Company?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> .?u_1 <http://dbpedia.org/ontology/religion> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "1586", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Bharatiya_Janata_Party> . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual religi\u00e3o \u00e9 membro do BJP?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Battle_of_Fort_Stephenson> <http://dbpedia.org/ontology/commander> ?u_0", "target_var": "?u_0"}], "id": "1257", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Battle_of_Fort_Stephenson> <http://dbpedia.org/ontology/commander> ?uri } ", "question": "Listar os comandantes da Batalha de Fort stephenson?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3441", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Prodigal_Son_(play)> <http://dbpedia.org/property/subject> ?uri } ", "question": "Qual \u00e9 o assunto do filho pr\u00f3digo?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture>", "target_var": "?u_0"}], "id": "3480", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/computingPlatform> <http://dbpedia.org/resource/ARM_architecture>  . }", "question": "A ARM Architecture atua como uma plataforma de jogo para quantas coisas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4108", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Andrew_Schally> <http://dbpedia.org/property/workInstitutions> ?uri } ", "question": "Nomeie as institui\u00e7\u00f5es de trabalho de Andrew Schally?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1178", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Clan_McDuck> . ?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Ludwig_Von_Drake> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Qual \u00e9 o personagem fict\u00edcio que tem o cl\u00e3 McDuck e Ludwig Von Draken como parentes?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3463", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Creatures_(company)> . ?uri <http://dbpedia.org/property/composer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}", "question": "Quantos jogos tem um compositor que trabalhou para o The Creatures?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3469", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/EXXV-TV> <http://dbpedia.org/property/licensee> ?uri. <http://dbpedia.org/resource/WXXV-DT2> <http://dbpedia.org/property/licensee> ?uri . }", "question": "Qual licenciado da EXXV-TV tamb\u00e9m \u00e9 licenciado do WXXV-DT2?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3467", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }", "question": "Em qual estado \u00e9 o local de nascimento de Ann Monroe Gilchrist Strong?"}]