[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4324", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Benelux> <http://dbpedia.org/property/currency> ?uri. <http://dbpedia.org/resource/Republic_of_Montenegro_(1992\u20132006)> <http://dbpedia.org/property/currency> ?uri . }", "question": "Qual \u00e9 a moeda base do Benelux que pode ser usada na Rep\u00fablica do Montenegro?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4760", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Julian_Leow_Beng_Kim> <http://dbpedia.org/property/almaMater> ?uri } ", "question": "Qual \u00e9 a alma mater de Julian Leow Beng Kim?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo>", "target_var": "?u_-1"}], "id": "3676", "query": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }", "question": "Eddie Bravo \u00e9 o treinador de Alan Jouban?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3464", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/race> <http://dbpedia.org/resource/Lawrence_Realization_Stakes> . ?x <http://dbpedia.org/ontology/honours> ?uri  . }", "question": "Quantos pr\u00eamios foram dados aos participantes das Estacas de Realiza\u00e7\u00e3o Lawrence?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Defense_Security_Command> <http://dbpedia.org/ontology/notableCommander> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Defense_Security_Command> <http://dbpedia.org/ontology/notableCommander> ?u_0 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Defense_Security_Command> <http://dbpedia.org/ontology/notableCommander> ?u_1", "target_var": "?u_1"}], "id": "3103", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Defense_Security_Command> <http://dbpedia.org/ontology/notableCommander> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual religi\u00e3o \u00e9 seguida pelo comandante do Comando de Seguran\u00e7a de Defesa?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2295", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Mark_Stevens_(film_editor)> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Joel_Schumacher>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>}", "question": "Liste a obra editada por Mark Stevens e dirigida por Joel Schumacher?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Dolley_Madison>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/William_Eustis> <http://dbpedia.org/property/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Dolley_Madison> .<http://dbpedia.org/resource/William_Eustis> <http://dbpedia.org/property/president> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dolley_Madison> <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Dolley_Madison> <http://dbpedia.org/ontology/spouse> ?u_0 .<http://dbpedia.org/resource/William_Eustis> <http://dbpedia.org/property/president> ?u_0", "target_var": "?u_0"}], "id": "3708", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dolley_Madison> <http://dbpedia.org/ontology/spouse> ?uri. <http://dbpedia.org/resource/William_Eustis> <http://dbpedia.org/property/president> ?uri} ", "question": "Qual presidente de William Eustus tamb\u00e9m se casou com Dolley Madison?"}, {"answer": "correct", "features": ["count", "multivar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Flatbread>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Flatbread> <http://dbpedia.org/ontology/type> ?u_0", "target_var": "?u_0"}], "id": "3018", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Flatbread>  . }", "question": "Conte os diferentes tipos de p\u00e3o achatado?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_1 <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_1 <http://dbpedia.org/ontology/birthPlace> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/birthPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_0 <http://dbpedia.org/ontology/birthPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/birthPlace> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_0 <http://dbpedia.org/ontology/birthPlace> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "4252", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Conte os locais de nascimento dos destinat\u00e1rios do Museu Nacional de Corrida e Hall da Fama."}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_0"}], "id": "803", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Daund_Junction_railway_station> <http://dbpedia.org/ontology/servingRailwayLine> ?uri } ", "question": "Qual \u00e9 a linha de servi\u00e7o da esta\u00e7\u00e3o ferrovi\u00e1ria de Daund Junction?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_1 .?u_1 <http://dbpedia.org/ontology/countySeat> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>", "target_var": "?u_1"}], "id": "4190", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Beckler_River> <http://dbpedia.org/ontology/district> ?x . ?x <http://dbpedia.org/ontology/countySeat> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AdministrativeRegion>}", "question": "Qual \u00e9 a sede do condado do distrito atrav\u00e9s do qual flui o rio Beckler?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3705", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/judges> <http://dbpedia.org/resource/Randy_Jackson>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Qual \u00e9 o programa de televis\u00e3o cujos ju\u00edzes s\u00e3o Randy Jackson?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Australia>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Australia> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "751", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/regionServed> <http://dbpedia.org/resource/Australia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Quantas empresas atendem a regi\u00e3o australiana?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Garry_Unger> <http://dbpedia.org/ontology/formerTeam> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Garry_Unger> <http://dbpedia.org/ontology/formerTeam> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}], "id": "4644", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Garry_Unger> <http://dbpedia.org/ontology/formerTeam> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Em quantas equipes Garry Unger participou, anteriormente?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Main_Course>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Main_Course> .?u_0 <http://dbpedia.org/property/writer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Main_Course>", "target_var": "?u_1"}], "id": "621", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/album> <http://dbpedia.org/resource/Main_Course> . ?x <http://dbpedia.org/property/writer> ?uri  . }", "question": "Quantos escritores trabalharam no \u00e1lbum Main Course?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2297", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Luther:_The_Calling> <http://dbpedia.org/property/author> ?x . ?x <http://dbpedia.org/ontology/notableWork> ?uri  . }", "question": "Liste as obras populares do autor de Luther: The Calling?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3828", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mainInterests> <http://dbpedia.org/resource/Natural_philosophy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Philosopher>}", "question": "Quais foram os fil\u00f3sofos cujo principal interesse era a filosofia natural?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "566", "query": "ASK WHERE { <http://dbpedia.org/resource/FIS_Alpine_World_Ski_Championships_1950> <http://dbpedia.org/property/hostCity> <http://dbpedia.org/resource/Colorado> }", "question": "O Campeonato Mundial de Esqui Alpino da FIS de 1950 foi realizado no Colorado?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Bogdanu\u0161a> <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Croatian_Inline_Hockey_League> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Bogdanu\u0161a> <http://dbpedia.org/ontology/wineRegion> ?u_0 .<http://dbpedia.org/resource/Croatian_Inline_Hockey_League> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}], "id": "1135", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bogdanu\u0161a> <http://dbpedia.org/ontology/wineRegion> ?uri. <http://dbpedia.org/resource/Croatian_Inline_Hockey_League> <http://dbpedia.org/ontology/country> ?uri} ", "question": "De que regi\u00e3o vin\u00edcola de Bogdanua faz parte a equipe de h\u00f3quei Croata Inline?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1204", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Adam_Ludwik_Czartoryski> . ?x <http://dbpedia.org/property/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Qual \u00e9 o local da morte dos royalties um de cujos pais foi Adam Ludwik Czartoryski?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1047", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chapelle_Saint-Louis_de_Carthage> <http://dbpedia.org/ontology/location> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }", "question": "Em que pa\u00eds est\u00e1 localizada a Chapelle Saint-Louis de Carthage?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "51", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Elmer_Burkett> . ?x <http://dbpedia.org/property/deathPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "onde morreu o titular do cargo que \u00e9 o sucessor de Elmer Burkett?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1044", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Geoffrey_Rush> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Laemmle_Theatres> <http://dbpedia.org/ontology/service> ?uri} ", "question": "Qual \u00e9 o pr\u00eamio comum ganho pelos teatros geoffrey Rush e Laemmle?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/East_Norwalk_Historical_Cemetery>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/restingplace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/restingplace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/East_Norwalk_Historical_Cemetery> .?u_0 <http://dbpedia.org/property/restingplace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/East_Norwalk_Historical_Cemetery>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/East_Norwalk_Historical_Cemetery> .?u_1 <http://dbpedia.org/property/restingplace> ?u_0", "target_var": "?u_0"}], "id": "2181", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/East_Norwalk_Historical_Cemetery> . ?x <http://dbpedia.org/property/restingplace> ?uri }", "question": "Qual \u00e9 o n\u00famero total de outros locais de descanso dos pol\u00edticos cujo um dos locais de descanso \u00e9 o Cemit\u00e9rio Hist\u00f3rico de East Norwalk?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>", "target_var": "?u_1"}], "id": "534", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Victor_Entertainment>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album>}", "question": "Quantos \u00e1lbuns foram lan\u00e7ados pelo selo Victor Entertainment?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Michael_Dell>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Michael_Dell> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "3184", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Michael_Dell>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Para qual empresa Michael Dell \u00e9 uma empresa-pai?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3857", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thornton_Creek> <http://dbpedia.org/property/sourceLocation> ?uri } ", "question": "Qual \u00e9 a localiza\u00e7\u00e3o de origem do Thornton Creek?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "443", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/keyPeople> <http://dbpedia.org/resource/Raymond_Conner>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Para qual empresa Raymond Conner \u00e9 fundamental?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/source> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_0 <http://dbpedia.org/ontology/source> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/source> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_0 <http://dbpedia.org/ontology/source> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/source> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/source> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/source> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_1 <http://dbpedia.org/ontology/source> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/source> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> .?u_1 <http://dbpedia.org/ontology/source> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "3604", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Conowingo_Dam> . ?x <http://dbpedia.org/ontology/source> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "De onde nasce o rio que des\u00e1gua na barragem de Conowingo?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "195", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_Pinckney_(governor)> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/property/appointer> ?uri  . }", "question": "Quem nomeou o sucessor de Charles Pinckney?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1115", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Trumpet_Kings_Meet_Joe_Turner> <http://dbpedia.org/property/producer> ?x . ?x <http://dbpedia.org/ontology/associatedBand> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "Qual \u00e9 a banda associada do artista musical que \u00e9 o produtor de The Trumpet Kings Meet Joe Turner?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/C\u00e9line_Buckens> <http://dbpedia.org/ontology/hometown> ?u_0", "target_var": "?u_0"}], "id": "765", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/C\u00e9line_Buckens> <http://dbpedia.org/ontology/hometown> ?uri } ", "question": "Qual \u00e9 a cidade natal de Cline Buckens?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1945", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Colonel_(The_Americans)> <http://dbpedia.org/ontology/subsequentWork> ?x . ?x <http://dbpedia.org/property/music> ?uri  . }", "question": "Liste a m\u00fasica tocada no epis\u00f3dio de televis\u00e3o que veio depois de The Colonel (The Americans)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3247", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WRVU> <http://dbpedia.org/property/licensee> ?uri } ", "question": "Qual universidade fornece licen\u00e7a para WRVU?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3002", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Phoenix_Suns> . ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Los_Angeles_Clippers>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer>}", "question": "Diga o nome do jogador de basquete que jogou pelo Phoenix Suns e Los Angeles Clippers como seu time de recrutamento?"}]