[{"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Terminator_(franchise)>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Terminator_(franchise)> .?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Terminator_(franchise)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Terminator_(franchise)> .?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}], "id": "4817", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Terminator_(franchise)> . ?uri <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_2:_Judgment_Day>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Diga o nome do personagem fict\u00edcio que estava em Terminator e o retratador \u00e9 Terminator 2: Dia do Julgamento?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Shinya_Aoki> <http://dbpedia.org/ontology/trainer> ?u_0", "target_var": "?u_0"}], "id": "3455", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Shinya_Aoki> <http://dbpedia.org/ontology/trainer> ?uri } ", "question": "Listar os treinadores de Shinya Aoki?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/purpose> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization> .?u_0 <http://dbpedia.org/property/purpose> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization>", "target_var": "?u_1"}], "id": "4241", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Non-governmental_organization> . ?x <http://dbpedia.org/property/purpose> ?uri  . }", "question": "Para que normalmente trabalham as ONGs?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/border> <http://dbpedia.org/resource/Bjela\u0161nica>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/border> <http://dbpedia.org/resource/Bjela\u0161nica> .?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/border> <http://dbpedia.org/resource/Bjela\u0161nica>", "target_var": "?u_1"}], "id": "4549", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/border> <http://dbpedia.org/resource/Bjela\u0161nica> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }", "question": "O que \u00e9 que termina o rio em cuja fronteira encontramos em Bjelasnica?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2172", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Reading,_Berkshire>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Liste algumas escolas situadas em Reading, Berkshire?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Lucius_Cornelius_Lentulus_Crus>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Lucius_Cornelius_Lentulus_Crus> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}], "id": "4515", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Lucius_Cornelius_Lentulus_Crus>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quem precedeu Lucius Crus como titular de um cargo?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1915", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/NCAA_Division_I_Football_Bowl_Subdivision>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}", "question": "Quantas universidades participam da subdivis\u00e3o do Football Bowl da Divis\u00e3o I da NCAA?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "612", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/James_B._Belford> . ?x <http://dbpedia.org/ontology/region> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Senator>}", "question": "Onde est\u00e1 o senador de cujo sucessor James Belford?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Thomas_Pfyl> <http://dbpedia.org/ontology/stateOfOrigin> ?u_0", "target_var": "?u_0"}], "id": "2406", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Pfyl> <http://dbpedia.org/ontology/stateOfOrigin> ?uri } ", "question": "Qual \u00e9 o estado de origem de Thomas Pfyl?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4205", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nii_Okaija_Adamafio> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/ontology/nationality> ?uri  . }", "question": "Qual \u00e9 a nacionalidade do sucessor de Nii Okaidja Adamafio?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Stone_Canoe> <http://dbpedia.org/ontology/publisher> ?u_0", "target_var": "?u_0"}], "id": "1898", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Stone_Canoe> <http://dbpedia.org/ontology/publisher> ?uri } ", "question": "Por qual universidade \u00e9 publicada a revista liter\u00e1ria Stone Canoe?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Plymouth_High_School_for_Girls> <http://dbpedia.org/ontology/county> <http://dbpedia.org/resource/Devon>", "target_var": "?u_-1"}], "id": "1649", "query": "ASK WHERE { <http://dbpedia.org/resource/Plymouth_High_School_for_Girls> <http://dbpedia.org/ontology/county> <http://dbpedia.org/resource/Devon> }", "question": "A Plymouth High School for Girls fica no condado de Devon?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "2607", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Texas>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "D\u00ea-me uma contagem de empresas localizadas no Texas?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer> .?u_0 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer> .?u_0 <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "258", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Pixar_Image_Computer> . ?uri <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Edwin_Catmull>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 o nome da empresa cujo produto \u00e9 Pixar Image Computer e tem uma das pessoas-chave como Edwin Catmull?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "847", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Doctor_Mirabilis_(novel)> <http://dbpedia.org/property/coverArtist> ?uri } ", "question": "Quem \u00e9 o artista da capa do Doutor Mirabilis (romance)?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4251", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Shawnee> } ", "question": "lista algumas pessoas shawnee?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1233", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Henry_E._Catto,_Jr.> . ?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Adrian_A._Basora>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Qual \u00e9 o titular do cargo cujo antecessor \u00e9 Henry E. Catto, Jr. e o sucessor \u00e9 Adrian A. Basora?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1127", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Deane> <http://dbpedia.org/ontology/primeMinister> ?uri. <http://dbpedia.org/resource/Mark_Latham> <http://dbpedia.org/property/primeminister> ?uri} ", "question": "Quem \u00e9 o primeiro-ministro comum de William Deaner e Mark Latham?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1967", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sony_Bank> <http://dbpedia.org/property/parent> ?x . ?x <http://dbpedia.org/ontology/parentCompany> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a empresa-m\u00e3e da empresa propriet\u00e1ria do Sony Bank?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "558", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Metro_Manila> . ?x <http://dbpedia.org/property/athletics> ?uri  . }", "question": "Quantos jogos s\u00e3o disputados nas universidades de Metro Manilla?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> .?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "3905", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/musicalBand> <http://dbpedia.org/resource/Miley_Cyrus> . ?uri <http://dbpedia.org/ontology/openingTheme> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Nomeie todas as sitcoms cuja m\u00fasica tema \u00e9 feita por Miley Cyrus?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "484", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/coach> <http://dbpedia.org/resource/Dalilah_Sappenfield> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . }", "question": "Quem \u00e9 o ex-companheiro do aluno de Dalilah Sappenfield?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1320", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1992_Canadian_Grand_Prix> <http://dbpedia.org/property/poleDriver> ?uri } ", "question": "Quem \u00e9 o piloto polon\u00eas do Grande Pr\u00eamio do Canad\u00e1 de 1992?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3404", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/neighboringMunicipalities> <http://dbpedia.org/resource/Lancy> . ?uri <http://dbpedia.org/ontology/neighboringMunicipality> <http://dbpedia.org/resource/Pregny-Chamb\u00e9sy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Location>}", "question": "Os munic\u00edpios vizinhos de que cidade s\u00e3o Lancy e Pregny-Chambsy?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "7", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pavel_Moroz> <http://dbpedia.org/property/hometown> ?uri. <http://dbpedia.org/resource/Yakov_Estrin> <http://dbpedia.org/ontology/deathPlace> ?uri} ", "question": "Em que cidade natal de PAvel Moroz \u00e9 o local da morte do Yakov Estrin?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3279", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Pandikar_Amin_Mulia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "Qual \u00e9 o pa\u00eds cujo porta-voz do Dewan Rakyat \u00e9 Pandikar Amin Mulia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?u_0 .<http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?u_0", "target_var": "?u_0"}], "id": "3189", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?uri. <http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?uri} ", "question": "Qual mainter de Cheasty Boulevard South tamb\u00e9m \u00e9 a sede do condado de King County, Washingtonsu?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1450", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/race> <http://dbpedia.org/resource/Excelsior_Stakes> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . }", "question": "De quais pa\u00edses as pessoas participaram das Estacas Excelsior?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/TranStar_Airlines> <http://dbpedia.org/ontology/destination> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/TranStar_Airlines> <http://dbpedia.org/ontology/destination> ?u_0 .?u_0 <http://dbpedia.org/ontology/largestCity> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/TranStar_Airlines> <http://dbpedia.org/ontology/destination> ?u_1", "target_var": "?u_1"}], "id": "3980", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/TranStar_Airlines> <http://dbpedia.org/ontology/destination> ?x . ?x <http://dbpedia.org/ontology/largestCity> ?uri  . }", "question": "Quais s\u00e3o as maiores cidades em cada um dos destinos da TranStar Airlines?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1814", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/writers> <http://dbpedia.org/resource/Neil_Gaiman> . ?uri <http://dbpedia.org/ontology/notableWork> ?x  . }", "question": "Qual escritor \u00e9 famoso pelas obras de Neil Gaiman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "773", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paud> . ?x <http://dbpedia.org/property/president> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/EducationalInstitution>}", "question": "Quem foi presidente de institutos educacionais em Paud?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1011", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/King's_Quest_VI> <http://dbpedia.org/ontology/computingPlatform> ?x . ?x <http://dbpedia.org/property/developer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quem \u00e9 o desenvolvedor do software que serve a plataforma para King&#39;s Quest VI?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "2818", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/youthclubs> <http://dbpedia.org/resource/FC_Barcelona> . ?uri <http://dbpedia.org/property/youthclubs> <http://dbpedia.org/resource/Newell's_Old_Boys> . }", "question": "Quem participou dos clubes juvenis do FC Barcelona e do Newell&#39;s Old Boys?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1991", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/James_Hartness> . ?x <http://dbpedia.org/property/occupation> ?uri  . }", "question": "O que os parentes de James Hartness fazem?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1277", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri } ", "question": "Quem \u00e9 o apontador de William Cushing?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Chris_Knierim> <http://dbpedia.org/ontology/formerPartner> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/formerPartner> <http://dbpedia.org/resource/Chris_Knierim>", "target_var": "?u_0"}], "id": "1783", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chris_Knierim> <http://dbpedia.org/ontology/formerPartner> ?uri } ", "question": "Quem \u00e9 o ex-parceiro de Chris Knierim?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3105", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Duboce_Triangle,_San_Francisco> . ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Noe_Valley,_San_Francisco> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Quem \u00e9 o titular dos c\u00edrculos eleitorais de Duboce Triangle e Noe Valley?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "446", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/knownFor> <http://dbpedia.org/resource/Olin_Corporation> . ?x <http://dbpedia.org/property/education> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BaseballPlayer>}", "question": "Qual \u00e9 a universidade frequentada pelo jogador de beisebol conhecido pela Olin Corporation?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/property/license> <http://dbpedia.org/resource/GNU_General_Public_License>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/genre> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/license> <http://dbpedia.org/resource/GNU_General_Public_License> .?u_0 <http://dbpedia.org/ontology/genre> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/license> <http://dbpedia.org/resource/GNU_General_Public_License>", "target_var": "?u_1"}], "id": "880", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/license> <http://dbpedia.org/resource/GNU_General_Public_License> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }", "question": "Quantos tipos diferentes de softwares foram lan\u00e7ados sob a licen\u00e7a GPL?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Carmela_Soprano>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Carmela_Soprano>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Carmela_Soprano> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?u_0 .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Carmela_Soprano>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Carmela_Soprano> .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?u_1 .?u_1 <http://dbpedia.org/ontology/religion> ?u_0", "target_var": "?u_0"}], "id": "4459", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Carmela_Soprano> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", "question": "Qual \u00e9 a religi\u00e3o dos parentes de Carmela Soprano?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "781", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/firstTeam> <http://dbpedia.org/resource/Scuderia_Ferrari> . ?x <http://dbpedia.org/property/poleDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}", "question": "Em todos os grandes pr\u00eamios em que a primeira equipe foi a Scuderia Ferrari, quem foram os pilotos da pole?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Erastus_Wiman> <http://dbpedia.org/ontology/citizenship> ?u_0", "target_var": "?u_0"}], "id": "1749", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Erastus_Wiman> <http://dbpedia.org/ontology/citizenship> ?uri } ", "question": "Qual \u00e9 a cidadania de Erastus Wiman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3388", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/French_people> . ?x <http://dbpedia.org/property/awards> ?uri  . }", "question": "Quais s\u00e3o alguns pr\u00eamios dados aos franceses?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4881", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterStations> <http://dbpedia.org/resource/CFRB> . ?x <http://dbpedia.org/ontology/broadcastArea> ?uri  . }", "question": "onde s\u00e3o transmitidas as esta\u00e7\u00f5es irm\u00e3s do CFRB?"}]