[{"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3990", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Smerinthus_saliceti> <http://dbpedia.org/ontology/binomialAuthority> ?x . ?x <http://dbpedia.org/ontology/citizenship> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Entomologist>}", "question": "Qual \u00e9 a nacionalidade do entomologista que \u00e9 uma autoridade reconhecida de Smerinthus saliceti?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ground> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_0 .?u_0 <http://dbpedia.org/ontology/ground> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ground> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_0 .?u_0 <http://dbpedia.org/ontology/ground> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/ground> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ground> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ground> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_1 .?u_1 <http://dbpedia.org/ontology/ground> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/ground> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?u_1 .?u_1 <http://dbpedia.org/ontology/ground> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>", "target_var": "?u_0"}], "id": "1766", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alan_Kusov__11> <http://dbpedia.org/ontology/team> ?x . ?x <http://dbpedia.org/ontology/ground> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>}", "question": "Onde fica o terreno do clube de futebol, que tem Alan Kusov como integrante da equipe?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4473", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gustavo_Rojas_Pinilla> <http://dbpedia.org/ontology/child> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", "question": "De onde se formou o filho de Gustavo Rojas Pinilla?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_0"}], "id": "2877", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Delta_III> <http://dbpedia.org/ontology/manufacturer> ?uri } ", "question": "Qual empresa fabricou Delta III?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3815", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/academicAdvisor> <http://dbpedia.org/resource/\u00c9douard_Chavannes> . ?x <http://dbpedia.org/property/fields> ?uri  . }", "question": "Em que \u00e1reas trabalham os alunos de Edouard Chavannes?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4016", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Theme_Time_Radio_Hour> <http://dbpedia.org/property/creator> ?uri } ", "question": "Quem \u00e9 o artista do Time Radio hour?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4677", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robin_Kovacs> <http://dbpedia.org/property/prospectTeam> ?uri } ", "question": "Liste a equipe potencial de Robin Kovacs?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_0 .?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_0 .?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_1 .?u_1 <http://dbpedia.org/ontology/stylisticOrigin> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?u_1 .?u_0 <http://dbpedia.org/ontology/stylisticOrigin> ?u_1", "target_var": "?u_1"}], "id": "3679", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Harry_and_the_Potters_(album)> <http://dbpedia.org/ontology/genre> ?x . ?x <http://dbpedia.org/ontology/stylisticOrigin> ?uri  . }", "question": "De onde se originaram os g\u00eaneros, que estavam no \u00e1lbum Harry and the Potters?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/New_York>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/themeMusicComposer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/New_York> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/themeMusicComposer> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/New_York>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/New_York> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "1271", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/New_York> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantas sitcoms existem cujo tema musical \u00e9 composto por um nova-iorquino?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)> <http://dbpedia.org/ontology/musicalBand> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Blayse> <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)> <http://dbpedia.org/ontology/musicalBand> ?u_0 .<http://dbpedia.org/resource/Blayse> <http://dbpedia.org/ontology/associatedBand> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Blayse>", "target_var": "?u_0"}], "id": "3077", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Take_Me_There_(Blackstreet_&_M\u00fda_song)> <http://dbpedia.org/ontology/musicalBand> ?uri. <http://dbpedia.org/resource/Blayse> <http://dbpedia.org/ontology/associatedBand> ?uri} ", "question": "Qual banda fez a m\u00fasica Take me There e j\u00e1 colaborou com Blayse no passado?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4501", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Art\u00far_G\u00f6rgei>  . }", "question": "Quem foi sucedido por Arthur Gegei como o propriet\u00e1rio do escrit\u00f3rio?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3094", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Robert_P._Smith> . ?uri <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Adrian_A._Basora> . }", "question": "Cujos sucessores s\u00e3o Robert P. Smith e Adrian A. Basora?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4653", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/editing> <http://dbpedia.org/resource/Mark_Stevens_(film_editor)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "D\u00ea-me uma contagem de filmes cujo editor \u00e9 Mark Stevens?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/awards> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/awards> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/awards> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/awards> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>", "target_var": "?u_1"}], "id": "347", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Golden_Globe_Award> . ?x <http://dbpedia.org/property/awards> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}", "question": "Quantos outros pr\u00eamios foram dados \u00e0s pessoas que ganharam o Globo de Ouro?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>", "target_var": "?u_0"}], "id": "4623", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/employer> <http://dbpedia.org/resource/The_American_Magazine>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Quem trabalha na American Magazine?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2562", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/Cockroach_Labs> . ?uri <http://dbpedia.org/property/author> ?x  . }", "question": "O que foi desenvolvido por algu\u00e9m que trabalha no Cockroach Labs?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4590", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/highschool> <http://dbpedia.org/resource/Palm_City,_Florida> . ?x <http://dbpedia.org/ontology/college> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "As pessoas que fizeram o ensino m\u00e9dio em Palm City, Fl\u00f3rida, fizeram a faculdade onde?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "656", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/currentclub> <http://dbpedia.org/resource/New_York_City_FC> . ?uri <http://dbpedia.org/property/nationalteam> <http://dbpedia.org/resource/Spain_national_football_team>  . }", "question": "Listar o jogador de futebol espanhol no NYC FC?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Texas>", "target_var": "?u_-1"}], "id": "2102", "query": "ASK WHERE { <http://dbpedia.org/resource/San_Marcos_River> <http://dbpedia.org/ontology/sourceMountain> <http://dbpedia.org/resource/Texas> }", "question": "O Rio San Macros come\u00e7a no Texas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "632", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Pepsi_Center> . ?uri <http://dbpedia.org/ontology/operator> ?x  . }", "question": "Qual operadora de est\u00e1dio trabalha no Pepsi Center?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2892", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Journal_of_Cerebral_Blood_Flow_&_Metabolism> <http://dbpedia.org/ontology/academicDiscipline> ?uri. <http://dbpedia.org/resource/Ragout_fin> <http://dbpedia.org/ontology/ingredient> ?uri} ", "question": "Qual \u00e9 a disciplina acad\u00eamica do Journal of Cerebral Blood Flow &amp; Metabolism e tamb\u00e9m um ingrediente da barbatana de Ragout?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Mauritius> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Motherland_(anthem)>", "target_var": "?u_-1"}], "id": "2493", "query": "ASK WHERE { <http://dbpedia.org/resource/Mauritius> <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Motherland_(anthem)> }", "question": "\u00c9 o hino nacional da p\u00e1tria das Maur\u00edcias?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jason_Carter_(actor)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jason_Carter_(actor)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "2665", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jason_Carter_(actor)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Em que programas de TV Jason Carter atuou?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> .?u_0 <http://dbpedia.org/ontology/mouthCountry> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka>", "target_var": "?u_1"}], "id": "4015", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }", "question": "Onde fica a foz do rio cujo afluente \u00e9 Bjelimi\u0107ka Rijeka?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3307", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ronald_Wilson> <http://dbpedia.org/property/branch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }", "question": "Qual \u00e9 o mascote da unidade militar em que Ronald Wilson serviu?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3096", "query": "ASK WHERE { <http://dbpedia.org/resource/Lois_Lane> <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Jerry_Siegel> }", "question": "Jerry Siegel criou Lois Lane?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3919", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Truman_McGill_Hobbs> <http://dbpedia.org/property/residence> ?uri } ", "question": "Onde mora Truman McGill Hobbs, juiz distrital dos Estados Unidos?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Pennsylvania>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballTeam>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Pennsylvania> <http://dbpedia.org/property/city> ?u_0", "target_var": "?u_1"}], "id": "2500", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Pennsylvania>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AmericanFootballTeam>}", "question": "A Pensilv\u00e2nia tem quantos times de futebol americano?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1465", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mascot> <http://dbpedia.org/resource/Aubie>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Para qual time de esportes Aubie \u00e9 o mascote?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2833", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hong_Kong_Taoist_Association_Tang_Hin_Memorial_Secondary_School> <http://dbpedia.org/property/religiousAffiliation> ?uri } ", "question": "Qual \u00e9 a afilia\u00e7\u00e3o religiosa da Escola Secund\u00e1ria Tang Hin Memorial da Associa\u00e7\u00e3o Tao\u00edsta de Hong Kong?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/battle> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_0 <http://dbpedia.org/ontology/battle> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>", "target_var": "?u_1"}], "id": "115", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Gales_Ferry,_Connecticut> . ?x <http://dbpedia.org/ontology/battle> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}", "question": "Quais foram as principais a\u00e7\u00f5es tomadas pelos pol\u00edticos que vivem em Gales Ferry, Connecticut?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1494", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/pastMembers> <http://dbpedia.org/resource/Nick_Jonas> . ?uri <http://dbpedia.org/property/pastMembers> <http://dbpedia.org/resource/Kevin_Jonas> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band>}", "question": "Que banda tinha Nick Jonas e Kevin Jonas como ex-membros?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/property/placeOfBurial> <http://dbpedia.org/resource/Rome>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/property/placeOfBurial> <http://dbpedia.org/resource/Rome> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>", "target_var": "?u_0"}], "id": "2401", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/placeOfBurial> <http://dbpedia.org/resource/Rome>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>}", "question": "Quais pessoas reais est\u00e3o enterradas em Roma?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/The_Bare_Necessities> <http://dbpedia.org/ontology/artist> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Rock-a-Doodle> <http://dbpedia.org/ontology/starring> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Bare_Necessities> <http://dbpedia.org/ontology/artist> ?u_0 .<http://dbpedia.org/resource/Rock-a-Doodle> <http://dbpedia.org/ontology/starring> ?u_0", "target_var": "?u_0"}], "id": "2661", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Bare_Necessities> <http://dbpedia.org/ontology/artist> ?uri. <http://dbpedia.org/resource/Rock-a-Doodle> <http://dbpedia.org/ontology/starring> ?uri} ", "question": "Qual artista foi associado de perto com as necessidades b\u00e1sicas e rock a doodle?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Cornell_University_Press> <http://dbpedia.org/ontology/parentCompany> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Mario_Garc\u00eda_Menocal> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Cornell_University_Press> <http://dbpedia.org/ontology/parentCompany> ?u_0 .<http://dbpedia.org/resource/Mario_Garc\u00eda_Menocal> <http://dbpedia.org/ontology/almaMater> ?u_0", "target_var": "?u_0"}], "id": "4100", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cornell_University_Press> <http://dbpedia.org/ontology/parentCompany> ?uri. <http://dbpedia.org/resource/Mario_Garc\u00eda_Menocal> <http://dbpedia.org/ontology/almaMater> ?uri} ", "question": "Qual empresa-m\u00e3e da Cornell University Press tamb\u00e9m \u00e9 a alma mater do Mario Garca Menocal?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1153", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MacKenzie_Miller> <http://dbpedia.org/property/birthPlace> ?uri } ", "question": "Onde nasceu MacKenzie Miller?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3848", "query": "ASK WHERE { <http://dbpedia.org/resource/United_States_Navy> <http://dbpedia.org/property/garrison> <http://dbpedia.org/resource/Arlington_County,_Virginia> }", "question": "A Marinha dos EUA est\u00e1 guarnecida no condado de Arlington, Virg\u00ednia?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Arthur_D._Levinson> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Sherlock_(software)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Arthur_D._Levinson> <http://dbpedia.org/ontology/occupation> ?u_0 .<http://dbpedia.org/resource/Sherlock_(software)> <http://dbpedia.org/ontology/developer> ?u_0", "target_var": "?u_0"}], "id": "57", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Arthur_D._Levinson> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/Sherlock_(software)> <http://dbpedia.org/ontology/developer> ?uri} ", "question": "Para qual empresa envolvida no desenvolvimento de Sherlock Arthur Levinson trabalhou?"}]