[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_0 <http://dbpedia.org/ontology/religion> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>", "target_var": "?u_1"}], "id": "3558", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Kalutara_Electoral_District> . ?x <http://dbpedia.org/ontology/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "Pessoas de que religi\u00e3o foram membros do parlamento e s\u00e3o do distrito eleitoral de Kalutara?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_1 <http://dbpedia.org/ontology/significantBuilding> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_0 <http://dbpedia.org/ontology/significantBuilding> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_0 <http://dbpedia.org/ontology/significantBuilding> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> .?u_1 <http://dbpedia.org/ontology/significantBuilding> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>", "target_var": "?u_0"}], "id": "4110", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/significantBuilding> <http://dbpedia.org/resource/Krasnye_Vorota_(Moscow_Metro)> . ?x <http://dbpedia.org/ontology/significantBuilding> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Architect>}", "question": "Quais s\u00e3o os edif\u00edcios importantes do arquiteto cujo um dos edif\u00edcios significativos \u00e9 Krasnye Vorota?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_1 .<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_1 .?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1 .?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}], "id": "3497", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_Hall_(economist)> <http://dbpedia.org/ontology/institution> ?uri. <http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?uri . }", "question": "Nomeie o instituto comum de Robert Hall e Erica Frank?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Martino_Martini> <http://dbpedia.org/ontology/deathCause> ?u_0", "target_var": "?u_0"}], "id": "3765", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martino_Martini> <http://dbpedia.org/ontology/deathCause> ?uri } ", "question": "Qual \u00e9 a causa da morte de Martino Martini?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "4484", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/fields> <http://dbpedia.org/resource/Sanskrit> . ?x <http://dbpedia.org/property/fields> ?uri }", "question": "Contar o n\u00famero de campos dos cientistas cujo um dos campos \u00e9 s\u00e2nscrito?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)>", "target_var": "?u_-1"}], "id": "2321", "query": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }", "question": "O rio branco flui para o rio connecticut {u&#39;_id &#39;: u&#39;97e02dcf44aa43c1b7cc7a7c155b118f&#39;,"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/San_Diego_Surf_(film)> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Andy_Warhol>", "target_var": "?u_-1"}], "id": "1366", "query": "ASK WHERE { <http://dbpedia.org/resource/San_Diego_Surf_(film)> <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Andy_Warhol> }", "question": "Andy Worhol era o diretor do surf san diego?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1992", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/\u00c1ngel_Escobar> <http://dbpedia.org/property/debutteam> ?uri } ", "question": "Qual \u00e9 a equipe de estreia do ngel Escobar?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3528", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Pablo_Records> . ?uri <http://dbpedia.org/ontology/spouse> ?x  . }", "question": "D\u00ea-me uma lista de todos que se casaram com os m\u00fasicos e se inscreveram na Pablo Records?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> .?u_0 <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> .?u_0 <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/The_Sarah_Jane_Adventures> <http://dbpedia.org/ontology/related> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> .<http://dbpedia.org/resource/The_Sarah_Jane_Adventures> <http://dbpedia.org/ontology/related> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/The_Sarah_Jane_Adventures> <http://dbpedia.org/ontology/related> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> .<http://dbpedia.org/resource/The_Sarah_Jane_Adventures> <http://dbpedia.org/ontology/related> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "1476", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Companion_(Doctor_Who)> . ?uri <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/The_Sarah_Jane_Adventures>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Diga o nome do programa de TV cujo membro do elenco \u00e9 Companion (Doctor Who) e est\u00e1 relacionado a The Sarah Jane Adventures?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/If_We_Were_a_Movie> <http://dbpedia.org/ontology/subsequentWork> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/If_We_Were_a_Movie> <http://dbpedia.org/ontology/subsequentWork> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/If_We_Were_a_Movie> <http://dbpedia.org/ontology/subsequentWork> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/If_We_Were_a_Movie> <http://dbpedia.org/ontology/subsequentWork> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_0 <http://dbpedia.org/ontology/openingTheme> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> .?u_1 <http://dbpedia.org/ontology/openingTheme> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "3740", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/subsequentWork> <http://dbpedia.org/resource/If_We_Were_a_Movie> . ?uri <http://dbpedia.org/ontology/openingTheme> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais temas de abertura foram usados para fazer If We Were a Movie?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2045", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/BMW_M43> . ?x <http://dbpedia.org/property/predecessor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Engine>}", "question": "Qual \u00e9 o antecessor do motor do carro que foi sucedido pelo BMW M43?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/David_Johnston>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/David_Johnston> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>", "target_var": "?u_0"}], "id": "102", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/David_Johnston>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "O l\u00edder de qual pa\u00eds \u00e9 David Johnston?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Waylon_Jennings>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Waylon_Jennings> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>", "target_var": "?u_0"}], "id": "4331", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Waylon_Jennings>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist>}", "question": "D\u00ea-me uma contagem de artistas musicais que colaboraram com Waylon Jennings?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "2992", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/commandStructure> <http://dbpedia.org/resource/Marine_Aircraft_Group_13> . ?uri <http://dbpedia.org/ontology/militaryUnit> ?x  . }", "question": "Contar todos os que estiveram na unidade militar estruturada como o Grupo de Aeronaves da Marinha 13?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1263", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/order> <http://dbpedia.org/resource/Provisional_Government_of_Saskatchewan>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MemberOfParliament>}", "question": "Por qual membro do parlamento foi liderado o governo provis\u00f3rio de Saskatchewan?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "2881", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Parliament_of_India> <http://dbpedia.org/property/houses> ?uri } ", "question": "Listar as casas do Parlamento da \u00cdndia?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3138", "query": " SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/distributor> <http://dbpedia.org/resource/RKO_Pictures> . ?uri <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Gregg_Toland> } ", "question": "Contar o n\u00famero de filmes cujo distribuidor \u00e9 a RKO Pictures e o diretor de fotografia \u00e9 Gregg Toland?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> .?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> .?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> .?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> .?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_0"}], "id": "3622", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> . ?x <http://dbpedia.org/ontology/wineRegion> ?uri  . }", "question": "Em quantos lugares posso encontrar vinho feito de uvas Vitis vinifera?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3203", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/New_Taipei_City> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", "question": "Quais aparelhos s\u00e3o feitos por empresas da cidade de New Taipei?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4278", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Toronto> . ?uri <http://dbpedia.org/property/headCoach> <http://dbpedia.org/resource/Mike_Babcock>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HockeyTeam>}", "question": "Nomeie o time de h\u00f3quei cujo t\u00e9cnico principal \u00e9 Mike babcock e est\u00e1 baseado em Toronto?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3299", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wan_Air> <http://dbpedia.org/property/hubs> ?uri } ", "question": "Qual \u00e9 o hub da Wan Air?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4993", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Amstelveen> . ?x <http://dbpedia.org/property/membership> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}", "question": "Quem s\u00e3o os membros das organiza\u00e7\u00f5es sediadas em Amstelveen?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> <http://dbpedia.org/resource/Walt_Disney>", "target_var": "?u_-1"}], "id": "3633", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Skeleton_Dance> <http://dbpedia.org/ontology/animator> <http://dbpedia.org/resource/Walt_Disney> }", "question": "A dan\u00e7a do esqueleto foi animada por Walt Disney?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1643", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Moondog_Matinee> <http://dbpedia.org/ontology/subsequentWork> ?uri. <http://dbpedia.org/resource/Theme_Time_Radio_Hour> <http://dbpedia.org/property/creator> ?uri} ", "question": "Quem criou o Theme Time Radio Hour tamb\u00e9m criou o trabalho subsequente de Moondoc Matinee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4505", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/operatedBy> <http://dbpedia.org/resource/Massachusetts_Department_of_Transportation> . ?x <http://dbpedia.org/property/owner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RoadTunnel>}", "question": "Quem \u00e9 o dono dos t\u00faneis operados pelo Departamento de Transporte de Massachusetts?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>", "target_var": "?u_0"}], "id": "0", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Bill_Finger>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>}", "question": "Quais personagens de quadrinhos s\u00e3o pintados por Bill Finger?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}], "id": "1580", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/presenter> <http://dbpedia.org/resource/Ryan_Seacrest>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Cite alguns programas de televis\u00e3o ancorados por Ryan Seacrest?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1356", "query": "ASK WHERE { <http://dbpedia.org/resource/Hopje> <http://dbpedia.org/property/mainIngredient> <http://dbpedia.org/resource/Coffee> }", "question": "O caf\u00e9 \u00e9 o ingrediente principal do Hopje?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4201", "query": "ASK WHERE { <http://dbpedia.org/resource/KOMC_(AM)> <http://dbpedia.org/ontology/programmeFormat> <http://dbpedia.org/resource/Gospel_music> }", "question": "KOMC toca m\u00fasica gospel?"}]