[{"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Chicken_Little_(1943_film)> <http://dbpedia.org/ontology/producer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Chicken_Little_(1943_film)> <http://dbpedia.org/ontology/producer> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Chicken_Little_(1943_film)> <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}], "id": "2335", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chicken_Little_(1943_film)> <http://dbpedia.org/ontology/producer> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", "question": "Que pr\u00eamios foram dados ao produtor de Chicken Little?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "694", "query": "ASK WHERE { <http://dbpedia.org/resource/G\u00fcm\u00fc\u015f_(TV_series)> <http://dbpedia.org/property/firstAired> <http://dbpedia.org/resource/Albania> }", "question": "GM foi ao ar pela primeira vez na Alb\u00e2nia?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Kemijoki>", "target_var": "?u_0"}], "id": "2356", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Kemijoki> } ", "question": "Quais corpos d&#39;\u00e1gua t\u00eam fluxos prim\u00e1rios em Kemijoki?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1927", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/WiZeefa> <http://dbpedia.org/property/foundation> ?uri } ", "question": "Onde a WiZeefa foi fundada?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0 .<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0 .?u_1 <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_0 .?u_1 <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0 .<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_0 .?u_1 <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_1 .<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_1 .?u_0 <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?u_0 .<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?u_1 .?u_0 <http://dbpedia.org/ontology/education> ?u_1", "target_var": "?u_1"}], "id": "684", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jack_McGregor> <http://dbpedia.org/ontology/education> ?uri. <http://dbpedia.org/resource/Donn_Barber> <http://dbpedia.org/ontology/education> ?uri . }", "question": "Qual institui\u00e7\u00e3o educacional de Jack Mcgregor tamb\u00e9m \u00e9 a alma mater de Donn Barber?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Richard_Stites> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}], "id": "749", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Richard_Stites> <http://dbpedia.org/ontology/birthPlace> ?uri } ", "question": "Onde est\u00e1 localizado Richard Stites?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4008", "query": "ASK WHERE { <http://dbpedia.org/resource/James_Watt> <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Mechanical_engineering> }", "question": "era James Watt um engenheiro mec\u00e2nico?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1266", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/locationCity> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}", "question": "Quais bebidas surgiram nos Estados Unidos?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3285", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Holler_If_Ya_Hear_Me_(musical)> <http://dbpedia.org/property/lyrics> ?uri } ", "question": "Quem comp\u00f4s as letras de Holler If Ya Hear Me?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Miss_Potential> <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Bluebird>", "target_var": "?u_-1"}], "id": "3529", "query": "ASK WHERE { <http://dbpedia.org/resource/Miss_Potential> <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Bluebird> }", "question": "Bluebird \u00e9 o av\u00f4 de Miss Potential?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4423", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bottineau_LRT> <http://dbpedia.org/property/system> ?x . ?x <http://dbpedia.org/property/headquarters> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/PublicTransitSystem>}", "question": "Qual \u00e9 a sede do sistema de transporte p\u00fablico que \u00e9 o sistema de Bottineau LRT?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3083", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_Speraw> <http://dbpedia.org/property/hometown> ?uri } ", "question": "Qual \u00e9 a cidade natal de John Speraw?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3025", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/doctoralStudents> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>}", "question": "Qual cientista aconselhou um aluno de doutorado chamado Erban Ieica?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "970", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/club> <http://dbpedia.org/resource/Dinamo_Krasnodar> . ?x <http://dbpedia.org/property/placeOfBirth> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Onde nasceram os jogadores do Dinamo Krasnodar?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "873", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/beatifiedBy> <http://dbpedia.org/resource/Pope_Pius_XI> . ?x <http://dbpedia.org/ontology/majorShrine> ?uri  . }", "question": "Quantos santu\u00e1rios maiores existem, dos santos beatificados pelo Papa Pio XI?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Journal_of_Cerebral_Blood_Flow_&_Metabolism> <http://dbpedia.org/ontology/academicDiscipline> ?u_0", "target_var": "?u_0"}], "id": "3198", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Journal_of_Cerebral_Blood_Flow_&_Metabolism> <http://dbpedia.org/ontology/academicDiscipline> ?uri } ", "question": "Qual \u00e9 a disciplina acad\u00eamica do Journal of Cerebral Blood Flow &amp; Metabolism?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "514", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ministry_of_Information_and_Communication_Technology_(Thailand)> <http://dbpedia.org/property/agencyName> ?uri. <http://dbpedia.org/resource/Channel_9_MCOT_HD> <http://dbpedia.org/property/city> ?uri} ", "question": "Qual \u00e9 o nome da ag\u00eancia do Minist\u00e9rio de Tecnologia da Informa\u00e7\u00e3o e Comunica\u00e7\u00e3o (Tail\u00e2ndia) e regi\u00e3o de distribui\u00e7\u00e3o do Canal 9 MCOT HD?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4472", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/cpu> <http://dbpedia.org/resource/Cell_(microprocessor)> . ?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }", "question": "Unidade de processamento central de qual console de jogos \u00e9 microprocessado e fabricado pela Sony?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "409", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/league> <http://dbpedia.org/resource/2011\u201312_Russian_Premier_League> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }", "question": "Listar os est\u00e1dios das equipes da Premier League russa?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/race> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/race> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/race> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/race> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/race> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/race> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>", "target_var": "?u_1"}], "id": "3408", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/grandsire> <http://dbpedia.org/resource/Wild_Risk> . ?x <http://dbpedia.org/property/race> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/HorseRace>}", "question": "D\u00ea-me uma estimativa do n\u00famero de corridas em que os cavalos av\u00f3s do Wild Risk correram?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)> .?u_0 <http://dbpedia.org/ontology/firstAscentPerson> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)>", "target_var": "?u_1"}], "id": "4342", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/mountainRange> <http://dbpedia.org/resource/Sierra_Nevada_(U.S.)> . ?x <http://dbpedia.org/ontology/firstAscentPerson> ?uri  . }", "question": "D\u00ea-me a lista de pessoas que escalaram montanhas em Sierra Nevada?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "207", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth> . ?uri <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Vangelis>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Qual \u00e9 o nome do filme cujo diretor de fotografia foi Jordan Cronenweth e o compositor musical foi Vangelis?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?u_0 .<http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "3691", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?uri. <http://dbpedia.org/resource/Polytechnic_University_of_the_Philippines_Taguig> <http://dbpedia.org/ontology/sport> ?uri} ", "question": "Quais s\u00e3o os esportes comuns praticados pelo jamiatu Muslim mindanao e pela Universidade Polit\u00e9cnica das Filipinas em Taguig?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3471", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Allal> <http://dbpedia.org/ontology/publisher> ?uri. <http://dbpedia.org/resource/Peter_Bergman_(comedian)> <http://dbpedia.org/ontology/employer> ?uri} ", "question": "Qual revista publicou Allal e \u00e9 o empregador de Peter Bergman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2430", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Justina_Machado> <http://dbpedia.org/property/birthPlace> ?uri. <http://dbpedia.org/resource/John_Englehart> <http://dbpedia.org/ontology/birthPlace> ?uri . }", "question": "Onde nasceram Justina Machado e John Englehard?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3657", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Dolley_Madison> . ?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/Montpelier_(Orange,_Virginia)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Nomeie o titular do cargo que foi casado com Dolley Madison e tem lugar em repouso como Montpelier?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Sean_Young>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/series> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Sean_Young> .?u_0 <http://dbpedia.org/ontology/series> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Sean_Young>", "target_var": "?u_1"}], "id": "4589", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Sean_Young> . ?x <http://dbpedia.org/ontology/series> ?uri  . }", "question": "Em que s\u00e9rie Sean Young retratou algu\u00e9m?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1883", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Boy_Is_Mine_(song)> <http://dbpedia.org/property/recorded> <http://dbpedia.org/resource/Atlanta> }", "question": "A m\u00fasica The Boy is Mine foi gravada em Atlanta?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?u_0", "target_var": "?u_0"}], "id": "1713", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Loretta_Ucelli> <http://dbpedia.org/ontology/president> ?uri } ", "question": "Quem \u00e9 o presidente quando Loretta Ucelli trabalhava para o Partido Democrata?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3399", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Robert_William_Wilcox> <http://dbpedia.org/property/district> ?uri. <http://dbpedia.org/resource/Kamaloohua> <http://dbpedia.org/property/placeOfBirth> ?uri} ", "question": "Qual distrito de Robert William Wilcox \u00e9 o local de nascimento de Kamaloohua?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Kelsey_Creek> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Kelsey_Creek> <http://dbpedia.org/ontology/region> ?u_0 .?u_0 <http://dbpedia.org/ontology/countySeat> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Kelsey_Creek> <http://dbpedia.org/ontology/region> ?u_1", "target_var": "?u_1"}], "id": "552", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kelsey_Creek> <http://dbpedia.org/ontology/region> ?x . ?x <http://dbpedia.org/ontology/countySeat> ?uri  . }", "question": "Onde est\u00e1 localizada a capital Kelsey Creek?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_1 <http://dbpedia.org/ontology/border> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/border> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/border> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_1 <http://dbpedia.org/ontology/border> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/border> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_0 <http://dbpedia.org/ontology/border> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/border> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> .?u_0 <http://dbpedia.org/ontology/border> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>", "target_var": "?u_1"}], "id": "1439", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/municipality> <http://dbpedia.org/resource/Lake_County,_Oregon> . ?x <http://dbpedia.org/ontology/border> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Valley>}", "question": "O que faz fronteira com o vale que fica sob o Condado de Lake, Oregon?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Wayne_Allard> <http://dbpedia.org/ontology/region> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Juli_Ashton> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Wayne_Allard> <http://dbpedia.org/ontology/region> ?u_0 .<http://dbpedia.org/resource/Juli_Ashton> <http://dbpedia.org/ontology/birthPlace> ?u_0", "target_var": "?u_0"}], "id": "2270", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wayne_Allard> <http://dbpedia.org/ontology/region> ?uri. <http://dbpedia.org/resource/Juli_Ashton> <http://dbpedia.org/ontology/birthPlace> ?uri} ", "question": "Que cidade \u00e9 onde Wayne Allard governa e Juli Ashton nasceu?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Murray_Gleeson> <http://dbpedia.org/ontology/appointer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/primeMinister> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Murray_Gleeson> <http://dbpedia.org/ontology/appointer> ?u_0 .?u_0 <http://dbpedia.org/ontology/primeMinister> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Murray_Gleeson> <http://dbpedia.org/ontology/appointer> ?u_1", "target_var": "?u_1"}], "id": "2821", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Murray_Gleeson> <http://dbpedia.org/ontology/appointer> ?x . ?x <http://dbpedia.org/ontology/primeMinister> ?uri  . }", "question": "Quais primeiros-ministros foram servidos pelo governador que nomeou Murray Gleeson?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Josh_Friedman>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_Genisys>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Josh_Friedman> .?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_Genisys>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Josh_Friedman> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_Genisys> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Josh_Friedman> .?u_0 <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_Genisys> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>", "target_var": "?u_0"}], "id": "4781", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Josh_Friedman> . ?uri <http://dbpedia.org/ontology/portrayer> <http://dbpedia.org/resource/Terminator_Genisys>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}", "question": "Diga o nome do personagem fict\u00edcio pintado por Josh Friedman e retratado em Terminator Genisys?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1925", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tetsugen_Bernard_Glassman> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/stateOfOrigin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Qual \u00e9 o estado de origem da pessoa que \u00e9 o sucessor de Tetsugen Bernard Glassman?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "634", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_H._Smith_(Connecticut)> <http://dbpedia.org/ontology/restingPlace> ?uri. <http://dbpedia.org/resource/Alfred_N._Phillips> <http://dbpedia.org/property/birthPlace> ?uri . }", "question": "Em que cidade dos EUA Alfred Phillips nasceu e \u00e9 o local de descanso de William Smith?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4805", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/Chaeng_Watthana_Government_Complex> . ?x <http://dbpedia.org/property/agencyName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}", "question": "D\u00ea-me o nome da organiza\u00e7\u00e3o com sede no Complexo Chaeng Watthana Govt?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "316", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/producer> <http://dbpedia.org/resource/Peter-John_Vettese> . ?x <http://dbpedia.org/ontology/writer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>}", "question": "Quem \u00e9 o escritor dos singles cujo produtor \u00e9 Peter-John Vettese?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Writing>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Writing> .?u_0 <http://dbpedia.org/ontology/field> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/field> ?u_1 .?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Writing>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Writing> .?u_1 <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}], "id": "4217", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Writing> . ?x <http://dbpedia.org/ontology/field> ?uri }", "question": "Contar o n\u00famero de artistas cuja \u00e1rea de atua\u00e7\u00e3o \u00e9 a escrita?"}]