[{"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Marcus_Floyd> <http://dbpedia.org/ontology/occupation> ?u_0", "target_var": "?u_0"}], "id": "3277", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marcus_Floyd> <http://dbpedia.org/ontology/occupation> ?uri } ", "question": "Quais eram as ocupa\u00e7\u00f5es de Marcus Floyd?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1859", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/David_Charles_(physician)> <http://dbpedia.org/property/workInstitutions> ?x . ?x <http://dbpedia.org/property/affiliation> ?uri  . }", "question": "A quem est\u00e1 afiliada a institui\u00e7\u00e3o de David Charles?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "208", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Klang_Valley> . ?x <http://dbpedia.org/property/country> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}", "question": "De quantos pa\u00edses v\u00eam as empresas sediadas no Vale do Klang?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0 .<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0 .?u_1 <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_0 .?u_1 <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0 .<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_0 .?u_1 <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_1 .<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_1 .?u_0 <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?u_0 .<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?u_1 .?u_0 <http://dbpedia.org/ontology/leaderName> ?u_1", "target_var": "?u_1"}], "id": "293", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Baraily> <http://dbpedia.org/ontology/leaderName> ?uri. <http://dbpedia.org/resource/Jowai> <http://dbpedia.org/ontology/leaderName> ?uri . }", "question": "Que partido pol\u00edtico governou em Baraily, MP e Jowai?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1119", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Tabriz> . ?x <http://dbpedia.org/ontology/builder> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge>}", "question": "Quem \u00e9 o construtor da ponte de Tabriz?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "2213", "query": "ASK WHERE { <http://dbpedia.org/resource/Only_the_Good_Die_Young> <http://dbpedia.org/property/fromAlbum> <http://dbpedia.org/resource/The_Stranger_(album)> }", "question": "\u00c9 a m\u00fasica Only the Good Die Young de The Stranger?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Arizona_State_Sun_Devils>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GolfPlayer>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Arizona_State_Sun_Devils> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GolfPlayer>", "target_var": "?u_0"}], "id": "1609", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/college> <http://dbpedia.org/resource/Arizona_State_Sun_Devils>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GolfPlayer>}", "question": "Quem s\u00e3o os jogadores de golfe cuja faculdade \u00e9 o Arizona State Sun Devils?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1264", "query": "ASK WHERE { <http://dbpedia.org/resource/The_Farmer_Wants_a_Wife_(Australian_TV_series)> <http://dbpedia.org/property/opentheme> <http://dbpedia.org/resource/Taylor_Swift> }", "question": "Taylor Swift fez a m\u00fasica tema de The Farmer Wants a Wife?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/gender> <http://dbpedia.org/resource/Mixed-sex_education>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/localAuthority> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/gender> <http://dbpedia.org/resource/Mixed-sex_education> .?u_0 <http://dbpedia.org/ontology/localAuthority> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/gender> <http://dbpedia.org/resource/Mixed-sex_education>", "target_var": "?u_1"}], "id": "990", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/gender> <http://dbpedia.org/resource/Mixed-sex_education> . ?x <http://dbpedia.org/ontology/localAuthority> ?uri  . }", "question": "Quantas autoridades locais administram escolas de g\u00eanero misto?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4197", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", "question": "Qual \u00e9 a almamater do sucessor de FA Little, Jr.?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1616", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }", "question": "Liste tudo em que saxofonistas foram escalados."}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "353", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Corringham_railway_station> <http://dbpedia.org/property/borough> ?uri } ", "question": "Em que cidade est\u00e1 localizada a esta\u00e7\u00e3o ferrovi\u00e1ria de Corringham?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4557", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1984_in_fine_arts_of_the_Soviet_Union> <http://dbpedia.org/property/title> ?uri } ", "question": "Que monumento foi inaugurado em 1984 de belas artes da Uni\u00e3o Sovi\u00e9tica?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2022", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/trainer> <http://dbpedia.org/resource/Ring_of_Honor> . ?x <http://dbpedia.org/property/billed> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Athlete>}", "question": "Onde o lutador treinado pelo Ring of Honor foi cobrado?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3690", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/PlayStation_4> . ?uri <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/PlayStation_2>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}", "question": "Nomeie o console cujo sucessor \u00e9 o PlayStation 4 e o predecessor \u00e9 o PlayStation 2?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2555", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/garrison> <http://dbpedia.org/resource/Tennessee> . ?uri <http://dbpedia.org/property/knownFor> ?x  . }", "question": "Liste o nome daqueles que se tornaram famosos por algo guarnecido no Tennessee?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3048", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Arlington_Heights,_Illinois> . ?x <http://dbpedia.org/property/teamName> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Quais equipes escolares existem nas escolas de Arlington Heights, Illinois?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Newman_Haynes_Clanton>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Newman_Haynes_Clanton> .?u_1 <http://dbpedia.org/ontology/opponent> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Newman_Haynes_Clanton>", "target_var": "?u_1"}], "id": "1228", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Newman_Haynes_Clanton> . ?uri <http://dbpedia.org/ontology/opponent> ?x  . }", "question": "Quem \u00e9 a pessoa cujo pai do oponente \u00e9 Newman Haynes Clanton?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "259", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Beverly_Hills,_California> . ?uri <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Colts_Neck_Township,_New_Jersey> . }", "question": "Quem tem resid\u00eancias oficiais em Beverly Hills e Colts Neck Township?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1519", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/schooltype> <http://dbpedia.org/resource/Protestantism> . ?x <http://dbpedia.org/ontology/sport> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/School>}", "question": "Que jogos s\u00e3o jogados nas escolas protestantes?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_0 .<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_0 .?u_1 <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0 .?u_1 <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_0 .<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0 .?u_1 <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_1 .<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_0 .<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?u_1 .?u_0 <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?u_1 .?u_0 <http://dbpedia.org/ontology/river> ?u_1", "target_var": "?u_1"}], "id": "1777", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eastern_Washington> <http://dbpedia.org/ontology/river> ?uri. <http://dbpedia.org/resource/Central_Washington> <http://dbpedia.org/ontology/river> ?uri . }", "question": "Qual rio flui atrav\u00e9s de Washington oriental e ocidental?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4739", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bombay_Sapphire> <http://dbpedia.org/property/distributor> ?uri } ", "question": "Qual empresa \u00e9 a distribuidora de Bombay Sapphire?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1770", "query": "ASK WHERE { <http://dbpedia.org/resource/Christina_Crawford_(wrestler)> <http://dbpedia.org/property/trainer> <http://dbpedia.org/resource/Trish_Stratus> }", "question": "Trish Stratus treinou Christina Crawford?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4353", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Anthony_(artist)> <http://dbpedia.org/ontology/training> ?uri. <http://dbpedia.org/resource/Yale_Repertory_Theatre> <http://dbpedia.org/property/owner> ?uri} ", "question": "Qual acionista do Yale Repertory Theatre era o centro de treinamento de William Anthony?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "52", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Steve_Ontiveros_(infielder)> <http://dbpedia.org/property/debutteam> ?uri. <http://dbpedia.org/resource/Hensley_Meulens> <http://dbpedia.org/ontology/team> ?uri} ", "question": "Diga o nome do time pelo qual Hensley Meulens jogou, qual foi tamb\u00e9m o time de estreia de Steve Ontiveros?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_0 .?u_1 <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1 .<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_1 .?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?u_0 .<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?u_1 .?u_0 <http://dbpedia.org/ontology/institution> ?u_1", "target_var": "?u_1"}], "id": "3473", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Erica_Frank> <http://dbpedia.org/ontology/institution> ?uri. <http://dbpedia.org/resource/Douglass_North> <http://dbpedia.org/ontology/institution> ?uri . }", "question": "Nomeie a institui\u00e7\u00e3o comum de Erica Frank e Douglass North?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Edward_Douglass_White>", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Charles_Phelps_Taft_II> <http://dbpedia.org/ontology/child> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Edward_Douglass_White> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Charles_Phelps_Taft_II>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Edward_Douglass_White> .?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Charles_Phelps_Taft_II>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Charles_Phelps_Taft_II> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Edward_Douglass_White> .?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Charles_Phelps_Taft_II> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>", "target_var": "?u_0"}], "id": "4683", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/Edward_Douglass_White> . ?uri <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Charles_Phelps_Taft_II>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Diga o nome de um titular de cargo cujo antecessor \u00e9 Edward Douglass White e tem um filho chamado Charles Phelps Taft II?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Kaszanka> <http://dbpedia.org/ontology/ingredient> ?u_0", "target_var": "?u_0"}], "id": "4411", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kaszanka> <http://dbpedia.org/ontology/ingredient> ?uri } ", "question": "Liste os ingredientes da Kaszanka?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/KUNSTEN_Museum_of_Modern_Art_Aalborg> <http://dbpedia.org/ontology/language> ?u_0", "target_var": "?u_0"}], "id": "2409", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/KUNSTEN_Museum_of_Modern_Art_Aalborg> <http://dbpedia.org/ontology/language> ?uri } ", "question": "Listar o idioma do Kunsten Museum of moder art Aalborg?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Wizard_rock> <http://dbpedia.org/ontology/stylisticOrigin> <http://dbpedia.org/resource/Harry_Potter>", "target_var": "?u_-1"}], "id": "2787", "query": "ASK WHERE { <http://dbpedia.org/resource/Wizard_rock> <http://dbpedia.org/ontology/stylisticOrigin> <http://dbpedia.org/resource/Harry_Potter> }", "question": "O rock m\u00e1gico \u00e9 inspirado no Harry Potter?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2344", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abraham> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/property/religion> ?uri} ", "question": "O que \u00e9 venerado por Abra\u00e3o e religi\u00e3o de Saima Chowdhury"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0 .<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0 .?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0 .?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0 .<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0 .?u_1 <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_1 .<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_1 .?u_0 <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?u_0 .<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?u_1 .?u_0 <http://dbpedia.org/ontology/director> ?u_1", "target_var": "?u_1"}], "id": "1033", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alice's_Wonderland> <http://dbpedia.org/ontology/director> ?uri. <http://dbpedia.org/resource/The_Haunted_House_(1929_film)> <http://dbpedia.org/ontology/director> ?uri . }", "question": "Quem dirigiu a casa mal-assombrada e Alice no pa\u00eds das maravilhas?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1097", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/province> <http://dbpedia.org/resource/Metropolitan_City_of_Venice> . ?uri <http://dbpedia.org/ontology/leaderName> <http://dbpedia.org/resource/Luigi_Brugnaro>  . }", "question": "Nomeie a cidade cuja prov\u00edncia \u00e9 Cidade Metropolitana de Veneza e cujo l\u00edder \u00e9 Luigi Brugnaro?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Panki_block> <http://dbpedia.org/ontology/leaderName> ?u_0", "target_var": "?u_0"}], "id": "543", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Panki_block> <http://dbpedia.org/ontology/leaderName> ?uri } ", "question": "Quem \u00e9 o l\u00edder do bloco Panki?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "1046", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Ron_Cyrus>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "De quais pessoas Ron Cyrus \u00e9 parente?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1894", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Web_hosting_service> . ?x <http://dbpedia.org/property/services> ?uri }", "question": "Quantos servi\u00e7os existem das empresas cujos servi\u00e7os s\u00e3o servi\u00e7os de hospedagem na Web?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4376", "query": "ASK WHERE { <http://dbpedia.org/resource/Neungin_High_School> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Buddhism> }", "question": "A Neungin High School \u00e9 uma escola budista?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "30", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }", "question": "Diga o nome do mascote do ramo militar de William Harper."}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4961", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boga_(soft_drink)> <http://dbpedia.org/property/origin> ?uri. <http://dbpedia.org/resource/Ennejma_Ezzahra> <http://dbpedia.org/property/locationCountry> ?uri} ", "question": "Que pa\u00eds de localiza\u00e7\u00e3o do Ennejma Ezzahra tamb\u00e9m \u00e9 a origem do Boga?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4718", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Denver>  . }", "question": "Qual \u00e9 o estado cuja maior cidade \u00e9 Denver?"}]