[{"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1684", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Manu_Cornet> <http://dbpedia.org/property/employer> ?uri  . }", "question": "Onde funciona a corneta Manu?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://dbpedia.org/ontology/award> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://dbpedia.org/ontology/award> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://dbpedia.org/ontology/award> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>", "target_var": "?u_1"}], "id": "4660", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/A_Barrel_of_Laughs,_a_Vale_of_Tears> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCreator>}", "question": "Quais pr\u00eamios o criador de A Barrel of Laughs, a Vale of Tears ganhou?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_1 <http://dbpedia.org/property/birthPlace> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/birthPlace> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> .?u_0 <http://dbpedia.org/property/birthPlace> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/birthPlace> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>", "target_var": "?u_1"}], "id": "1514", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> . ?x <http://dbpedia.org/property/birthPlace> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}", "question": "Em quantos lugares diferentes nasceram as pessoas que s\u00e3o membros do National Museum of Racing e do Hall of Fame?"}, {"answer": "correct", "features": ["singlevar", "boolean", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Alfred_Kleiner> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/Albert_Einstein>", "target_var": "?u_-1"}], "id": "2404", "query": "ASK WHERE { <http://dbpedia.org/resource/Alfred_Kleiner> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/Albert_Einstein> }", "question": "Einstein era aluno de doutorado de Alfred Kleiner?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/\u00dc\u00fcreg_Lake> <http://dbpedia.org/ontology/sourceCountry> ?u_0", "target_var": "?u_0"}], "id": "2021", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/\u00dc\u00fcreg_Lake> <http://dbpedia.org/ontology/sourceCountry> ?uri } ", "question": "Qual \u00e9 o pa\u00eds de origem do reg Lake?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4553", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/position> <http://dbpedia.org/resource/Defenceman> . ?x <http://dbpedia.org/property/playedFor> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/IceHockeyPlayer>}", "question": "Quais times de h\u00f3quei tiveram pessoas jogando como Defensor?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1767", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Joseph_Stiglitz> <http://dbpedia.org/property/president> ?uri } ", "question": "qual presidente foi servido por Joseph Stiglitz?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "174", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dan_Shamash> <http://dbpedia.org/ontology/team> ?uri. <http://dbpedia.org/resource/EverBank_Field> <http://dbpedia.org/ontology/tenant> ?uri} ", "question": "Diga o nome do inquilino do campo do banco Ever, que tamb\u00e9m tem um jogador chamado Dan Shamash?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "1554", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Transit> <http://dbpedia.org/property/engine> ?x . ?x <http://dbpedia.org/ontology/manufacturer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Engine>}", "question": "Quem \u00e9 o mfr. do motor usado no Ford Transit?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4215", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/workInstitutions> <http://dbpedia.org/resource/American_College_of_Surgeons> . ?x <http://dbpedia.org/ontology/education> ?uri  . }", "question": "Onde os funcion\u00e1rios do American College of Surgeons estudaram?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4461", "query": "ASK WHERE { <http://dbpedia.org/resource/Jean_Grey> <http://dbpedia.org/property/creators> <http://dbpedia.org/resource/Stan_Lee> }", "question": "Stan Lee criou Jean Gray?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Zhorstoke_nebo> <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/influencedBy> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Zhorstoke_nebo> <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://dbpedia.org/ontology/influencedBy> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Zhorstoke_nebo> <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}], "id": "217", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Zhorstoke_nebo> <http://dbpedia.org/ontology/author> ?x . ?x <http://dbpedia.org/ontology/influencedBy> ?uri  . }", "question": "Os autores de Zhorstoke nebo foram influenciados por quem?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> .?u_0 <http://dbpedia.org/ontology/manufacturer> ?u_1", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> .?u_1 <http://dbpedia.org/ontology/manufacturer> ?u_0", "target_var": "?u_1"}], "id": "3914", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony> . ?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Foxconn> . }", "question": "Qual produto \u00e9 feito pela Sony e pela Foxconn juntos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3720", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/format> <http://dbpedia.org/resource/Religion> . ?x <http://dbpedia.org/property/city> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RadioStation>}", "question": "Qual cidade tem esta\u00e7\u00f5es de r\u00e1dio religiosas?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/White_Plum_Asanga>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/stateOfOrigin> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/White_Plum_Asanga> .?u_0 <http://dbpedia.org/ontology/stateOfOrigin> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/White_Plum_Asanga>", "target_var": "?u_1"}], "id": "690", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/White_Plum_Asanga> . ?x <http://dbpedia.org/ontology/stateOfOrigin> ?uri  . }", "question": "De qual estado v\u00eam os White Plum Asangas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?u_0", "target_var": "?u_0"}], "id": "2577", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ganz_UV> <http://dbpedia.org/ontology/operator> ?uri } ", "question": "Quem opera o Ganz UV?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2233", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/James_K._Kelly> <http://dbpedia.org/property/state> ?uri. <http://dbpedia.org/resource/Umatilla_language> <http://dbpedia.org/property/region> ?uri} ", "question": "Qual \u00e9 o estado da l\u00edngua Umatilla que tamb\u00e9m \u00e9 o estado de James K. Kelly?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_1 <http://dbpedia.org/ontology/recordedIn> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/recordedIn> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_1 <http://dbpedia.org/ontology/recordedIn> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> .?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/recordedIn> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>", "target_var": "?u_1"}], "id": "2238", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Garbage_(band)> . ?x <http://dbpedia.org/ontology/recordedIn> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Single>}", "question": "Onde o GARAGE gravou seus singles?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "1106", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/2004\u201305_FC_Barcelona_season> <http://dbpedia.org/property/name> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer>}", "question": "Quantos jogadores participaram da temporada 2004-05 do FC Barcelona?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1789", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/mother> <http://dbpedia.org/resource/Bertrada_of_Laon> } ", "question": "De quem \u00e9 a m\u00e3e Bertrada de Laon?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3188", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/firstTeam> <http://dbpedia.org/resource/Renault_in_Formula_One> . ?x <http://dbpedia.org/ontology/poleDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}", "question": "D\u00ea-me uma lista de todas as pessoas que pilotaram nas pole position nos Grand Prixes em que a Renault foi a primeira equipe?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2436", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Batman:_Arkham_City_Lockdown> <http://dbpedia.org/property/distributor> ?x . ?x <http://dbpedia.org/property/developer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}", "question": "Quem \u00e9 o desenvolvedor do software que distribui Batman: Arkham City Lockdown?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "611", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Terry_Pratchett> . ?x <http://dbpedia.org/ontology/nonFictionSubject> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Quais s\u00e3o os t\u00f3picos de n\u00e3o fic\u00e7\u00e3o nos livros cujo autor \u00e9 Terry Pratchett?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "3660", "query": "ASK WHERE { <http://dbpedia.org/resource/Nokia_Lumia_830> <http://dbpedia.org/property/os> <http://dbpedia.org/resource/Windows_Phone_8.1> }", "question": "O WP 8.1 \u00e9 o sistema operacional do Lumia 830?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "3711", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Momoko_K\u014dchi> . ?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Akira_Ifukube>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}", "question": "Nomeie um filme com o ator Momoko Kchi e m\u00fasica de Akira Ifukube?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/servingRailwayLine> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> .?u_1 <http://dbpedia.org/ontology/servingRailwayLine> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>", "target_var": "?u_0"}], "id": "576", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/North_Caucasus_Railway> . ?x <http://dbpedia.org/ontology/servingRailwayLine> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Station>}", "question": "Qual linha ferrovi\u00e1ria passa pelas esta\u00e7\u00f5es que fazem parte da ferrovia do C\u00e1ucaso do Norte?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2063", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/1502nd_Infantry_Brigade_(Ready_Reserve)> <http://dbpedia.org/property/mascot> ?uri. <http://dbpedia.org/resource/Galatasaray_Handball_Team> <http://dbpedia.org/property/mascot> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Animal>}", "question": "Qual animal \u00e9 o mascote da 1502\u00aa Brigada de Infantaria (Reserva Pronta) e Equipe de Handebol do Galatasaray?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4435", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Gemini_8> . ?uri <http://dbpedia.org/property/mission> <http://dbpedia.org/resource/Apollo_11> . }", "question": "Quem esteve nas miss\u00f5es de G\u00eameos 8 e Apolo 11?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Island_Bayou_(Oklahoma)> <http://dbpedia.org/ontology/source> ?u_0", "target_var": "?u_0"}], "id": "1180", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Island_Bayou_(Oklahoma)> <http://dbpedia.org/ontology/source> ?uri } ", "question": "Nomeie a fonte como Ilha de Bayou?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Malaysia_Junior_Hockey_League> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?u_0 .<http://dbpedia.org/resource/Malaysia_Junior_Hockey_League> <http://dbpedia.org/ontology/country> ?u_0", "target_var": "?u_0"}], "id": "888", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/AH141> <http://dbpedia.org/ontology/county> ?uri. <http://dbpedia.org/resource/Malaysia_Junior_Hockey_League> <http://dbpedia.org/ontology/country> ?uri} ", "question": "Em que pa\u00eds onde fica o AH141 \u00e9 tamb\u00e9m a na\u00e7\u00e3o da Malaysia Junior hockey league?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3128", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Luke_List_(golfer)> <http://dbpedia.org/property/college> ?uri. <http://dbpedia.org/resource/Park_Trammell> <http://dbpedia.org/ontology/almaMater> ?uri} ", "question": "Qual faculdade de Luke List (jogador de golfe) \u00e9 a alma mater do Park Trammell?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0", "target_var": "?u_0"}, {"correct": false, "query": "<http://dbpedia.org/resource/Islamic_Azad_University_Central_Tehran_Branch> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}, {"correct": true, "query": "<http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?u_0 .<http://dbpedia.org/resource/Islamic_Azad_University_Central_Tehran_Branch> <http://dbpedia.org/ontology/sport> ?u_0", "target_var": "?u_0"}], "id": "1732", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Speelman> <http://dbpedia.org/ontology/field> ?uri. <http://dbpedia.org/resource/Islamic_Azad_University_Central_Tehran_Branch> <http://dbpedia.org/ontology/sport> ?uri} ", "question": "Dos esportes comumente praticados em Islamic Azad Uni, teer\u00e3, qual deles Jon Speelman joga?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "2663", "query": "SELECT COUNT(DISTINCT ?uri) WHERE {?uri <http://dbpedia.org/property/label> <http://dbpedia.org/resource/Celluloid_Records>  . }", "question": "Quantos artistas est\u00e3o inscritos na Celluloid Records?"}]