[{"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Lewis_Hamilton>", "target_var": "?u_0"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/creator> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Lewis_Hamilton> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/creator> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Lewis_Hamilton>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Lewis_Hamilton> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/creator> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/creator> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/creator> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/creator> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>", "target_var": "?u_1"}], "id": "88", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/Lewis_Hamilton> . ?uri <http://dbpedia.org/property/creator> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quantos programas de TV foram feitos por algu\u00e9m associado a Lewis Hamilton?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Boston_Bruins>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/playedFor> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/property/playedFor> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Boston_Bruins>", "target_var": "?u_0"}, {"correct": true, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>", "target_var": "?u_0"}], "id": "457", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/formerTeam> <http://dbpedia.org/resource/Boston_Bruins> . ?x <http://dbpedia.org/property/playedFor> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}", "question": "Por quantas outras equipes os ex-jogadores do Boston Bruins jogaram?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Midhurst>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/creator> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Midhurst> .?u_1 <http://dbpedia.org/ontology/creator> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Midhurst>", "target_var": "?u_1"}], "id": "1305", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Midhurst> . ?uri <http://dbpedia.org/ontology/creator> ?x  . }", "question": "Quais coisas foram feitas por artistas que morreram em Midhurst?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2925", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/The_CW> . ?uri <http://dbpedia.org/property/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}", "question": "Quais s\u00e3o os programas de TV cuja rede tamb\u00e9m \u00e9 conhecida como CW?"}, {"answer": "-without_path", "features": ["compound", "multivar", "count"], "generated_queries": [], "id": "3270", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/The_Sarah_Jane_Adventures> <http://dbpedia.org/property/creator> ?x . ?x <http://dbpedia.org/ontology/notableWork> ?uri  . }", "question": "Quantas outras coisas importantes a pintora de Sarah Jane Adventures fez?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3227", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sea_Gayle_Music> <http://dbpedia.org/property/founder> ?uri. <http://dbpedia.org/resource/Rising_Star_(U.S._TV_series)> <http://dbpedia.org/property/judges> ?uri} ", "question": "Que fundador da Sea Gayle Music tamb\u00e9m \u00e9 o juiz da Rising Star?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Ford_Kansas_City_Assembly_Plant> <http://dbpedia.org/ontology/owningOrganisation> ?u_0", "target_var": "?u_0"}], "id": "1988", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ford_Kansas_City_Assembly_Plant> <http://dbpedia.org/ontology/owningOrganisation> ?uri } ", "question": "Quem \u00e9 o dono da f\u00e1brica de montagem do Ford Kansas?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "3754", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/I_Pray_on_Christmas> <http://dbpedia.org/property/label> ?uri } ", "question": "Qual \u00e9 o r\u00f3tulo de I Pray on Christmas?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/ontology/destination> ?u_0", "target_var": "?u_0"}], "id": "3646", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Novair_International_Airways> <http://dbpedia.org/ontology/destination> ?uri } ", "question": "Lista de destinos da Novair International Airways?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/William_Menelaus> <http://dbpedia.org/ontology/spouse> ?u_0", "target_var": "?u_0"}], "id": "831", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Menelaus> <http://dbpedia.org/ontology/spouse> ?uri } ", "question": "Quem \u00e9 a esposa de Willian Menalaus?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "239", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }", "question": "Conte o n\u00famero de atores em Lucy Sullivan Is Getting Married."}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Diprotodontia>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Diprotodontia> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>", "target_var": "?u_0"}], "id": "4681", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Diprotodontia>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mammal>}", "question": "Quais mam\u00edferos s\u00e3o classificados em Diprotodontia?"}, {"answer": "-without_path", "features": ["count", "multivar", "single"], "generated_queries": [], "id": "3022", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { <http://dbpedia.org/resource/The_Other_Side_(The_Outer_Limits)> <http://dbpedia.org/property/guests> ?uri  . }", "question": "O Outro Lado j\u00e1 recebeu quantos convidados?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon> .?u_0 <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon> .?u_0 <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>", "target_var": "?u_0"}], "id": "3148", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Clatsop_County,_Oregon> . ?uri <http://dbpedia.org/ontology/source> <http://dbpedia.org/resource/Columbia_Lake>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}", "question": "Nomeie o rio com a origem como Columbia Lake e a foz do rio est\u00e1 localizada em Clatsop Country?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "1946", "query": "ASK WHERE { <http://dbpedia.org/resource/Berlin_(band)> <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Dave_Schulz_(musician)> }", "question": "Dave Schulz \u00e9 um membro da banda de Berlim?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/hubAirport> <http://dbpedia.org/resource/Los_Angeles_International_Airport>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/hubAirport> <http://dbpedia.org/resource/Los_Angeles_International_Airport> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>", "target_var": "?u_0"}], "id": "2775", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/hubAirport> <http://dbpedia.org/resource/Los_Angeles_International_Airport>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline>}", "question": "Quais s\u00e3o as companhias a\u00e9reas cujo hub \u00e9 o Aeroporto Internacional de Los Angeles?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/Filipinos>", "target_var": "?u_0"}], "id": "192", "query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/stateOfOrigin> <http://dbpedia.org/resource/Filipinos> } ", "question": "quais s\u00e3o algumas pessoas famosas dos filipinos?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4849", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Paradise_Place> <http://dbpedia.org/property/producer> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}", "question": "Que pr\u00eamios foram entregues \u00e0 pessoa que produziu Paradise Place?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4939", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Seattle_Great_Wheel> <http://dbpedia.org/property/locationTown> ?uri } ", "question": "Qual \u00e9 a localiza\u00e7\u00e3o da cidade de Seattle Great Wheel?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "944", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Vadodara_Junction_railway_station> <http://dbpedia.org/property/line> ?uri } ", "question": "Listar toda a linha da esta\u00e7\u00e3o ferrovi\u00e1ria de Vadodara Junction?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "1268", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Jon_Curran> <http://dbpedia.org/property/college> ?uri } ", "question": "Nomeie a faculdade de Jon Curran?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4231", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/screenplay> <http://dbpedia.org/resource/Daniel_Waters_(screenwriter)> . ?uri <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Tim_Burton>  . }", "question": "Qual filme de Tim Birton tem roteiro de Daniel Waters?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Scott_Haran> <http://dbpedia.org/ontology/knownFor> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Scott_Haran> <http://dbpedia.org/ontology/knownFor> ?u_0 .?u_0 <http://dbpedia.org/ontology/producer> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Scott_Haran> <http://dbpedia.org/ontology/knownFor> ?u_1", "target_var": "?u_1"}], "id": "2307", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Scott_Haran> <http://dbpedia.org/ontology/knownFor> ?x . ?x <http://dbpedia.org/ontology/producer> ?uri  . }", "question": "Quem produz a s\u00e9rie de TV que tornou Scott Haran famoso?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4424", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/De_La_Rose> <http://dbpedia.org/ontology/breeder> ?x . ?x <http://dbpedia.org/property/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Jockey>}", "question": "Qual \u00e9 o local de nascimento do j\u00f3quei que criou De La Rose?"}, {"answer": "-no_answer", "features": ["singlevar", "single"], "generated_queries": [], "id": "4711", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Madagascar:_Operation_Penguin> <http://dbpedia.org/property/artist> ?uri } ", "question": "Nomeie o Artista de Madagascar: Opera\u00e7\u00e3o Pinguim?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "2313", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/Taiwan> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Device>}", "question": "Quais s\u00e3o alguns dispositivos feitos por empresas taiwanesas?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3214", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harry_Huston> <http://dbpedia.org/property/debutteam> ?uri. <http://dbpedia.org/resource/Dick_Spalding> <http://dbpedia.org/property/debutteam> ?uri . }", "question": "Harry Huston e Dick Spalding jogaram sua primeira partida por qual time?"}, {"answer": "correct", "features": ["singlevar", "single"], "generated_queries": [{"correct": true, "query": "<http://dbpedia.org/resource/Subaru_Legacy_(second_generation)> <http://dbpedia.org/ontology/layout> ?u_0", "target_var": "?u_0"}], "id": "2732", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Subaru_Legacy_(second_generation)> <http://dbpedia.org/ontology/layout> ?uri } ", "question": "Qual \u00e9 o layout do Subaru Legacy (segunda gera\u00e7\u00e3o)?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Michigan>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Michigan> .?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/wineRegion> ?u_1 .?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Michigan>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Michigan> .?u_1 <http://dbpedia.org/ontology/wineRegion> ?u_0", "target_var": "?u_0"}], "id": "1926", "query": " SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/wineRegion> <http://dbpedia.org/resource/Michigan> . ?x <http://dbpedia.org/ontology/wineRegion> ?uri }", "question": "Quantas outras regi\u00f5es vin\u00edcolas existem das uvas cuja regi\u00e3o vin\u00edcola seja Michigan?"}, {"answer": "-no_answer", "features": ["compound", "singlevar"], "generated_queries": [], "id": "4227", "query": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Duboce_Triangle,_San_Francisco> . ?uri <http://dbpedia.org/property/constituency> <http://dbpedia.org/resource/Haight-Ashbury> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>}", "question": "Nome do titular do cargo cujo eleitorado \u00e9 Duboce Triangle e Haight-Ashbury?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> .?u_0 <http://dbpedia.org/ontology/sport> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities>", "target_var": "?u_1"}], "id": "4676", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", "question": "Estime o n\u00famero de divis\u00f5es esportivas nas universidades sob associa\u00e7\u00e3o internacional de universidades."}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "<http://dbpedia.org/resource/Erich_Kempka> <http://dbpedia.org/ontology/militaryUnit> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "<http://dbpedia.org/resource/Erich_Kempka> <http://dbpedia.org/ontology/militaryUnit> ?u_0 .?u_0 <http://dbpedia.org/ontology/leader> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "<http://dbpedia.org/resource/Erich_Kempka> <http://dbpedia.org/ontology/militaryUnit> ?u_1", "target_var": "?u_1"}], "id": "800", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Erich_Kempka> <http://dbpedia.org/ontology/militaryUnit> ?x . ?x <http://dbpedia.org/ontology/leader> ?uri  . }", "question": "Qual \u00e9 o l\u00edder da ag\u00eancia governamental que \u00e9 a unidade militar de Erich Kempka?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "3671", "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Warren_Magnuson> <http://dbpedia.org/property/successor> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Senator>}", "question": "Qual \u00e9 a alma mater do senador que \u00e9 o sucessor de Warren Magnuson?"}, {"answer": "-without_path", "features": ["singlevar", "boolean", "single"], "generated_queries": [], "id": "4193", "query": "ASK WHERE { <http://dbpedia.org/resource/Shinya_Aoki> <http://dbpedia.org/property/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }", "question": "Eddie Bravo \u00e9 o treinador de Shinya Aoki?"}, {"answer": "correct", "features": ["compound", "multivar"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/United_States_Army_Command_and_General_Staff_College>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/property/battles> ?u_1", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/United_States_Army_Command_and_General_Staff_College> .?u_0 <http://dbpedia.org/property/battles> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/United_States_Army_Command_and_General_Staff_College>", "target_var": "?u_1"}], "id": "2968", "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/United_States_Army_Command_and_General_Staff_College> . ?x <http://dbpedia.org/property/battles> ?uri  . }", "question": "Liste as batalhas em que lutaram ex-alunos do Comando do Ex\u00e9rcito dos EUA e da Escola de Estado-Maior Geral?"}, {"answer": "-no_answer", "features": ["compound", "multivar"], "generated_queries": [], "id": "4793", "query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alan_Freeman_Days> <http://dbpedia.org/ontology/writer> ?uri. <http://dbpedia.org/resource/Come_On_Over_(Bee_Gees_song)> <http://dbpedia.org/property/writer> ?uri} ", "question": "Qual escritor de Alan Freeman Days tamb\u00e9m \u00e9 o escritor de Come On over?"}, {"answer": "correct", "features": ["compound", "singlevar"], "generated_queries": [{"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)>", "target_var": "?u_0"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> .?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> .?u_0 <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>", "target_var": "?u_0"}], "id": "4368", "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Tandem_Computers> . ?uri <http://dbpedia.org/ontology/foundedBy> <http://dbpedia.org/resource/Jim_Harris_(entrepreneur)>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}", "question": "Qual \u00e9 a subsidi\u00e1ria da Tandem Computers que foi fundada por Jim Harris?"}, {"answer": "correct", "features": ["compound", "multivar", "count"], "generated_queries": [{"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_1 <http://dbpedia.org/ontology/author> ?u_0", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> ?u_0 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/author> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_0 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_1 <http://dbpedia.org/ontology/author> ?u_0 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": false, "query": "?u_1 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_0 <http://dbpedia.org/ontology/author> ?u_1", "target_var": "?u_1"}, {"correct": false, "query": "?u_0 <http://dbpedia.org/ontology/author> ?u_1 .?u_1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_1"}, {"correct": true, "query": "?u_1 <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> .?u_0 <http://dbpedia.org/ontology/author> ?u_1 .?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>", "target_var": "?u_0"}], "id": "2776", "query": "SELECT COUNT(DISTINCT ?uri) WHERE { ?x <http://dbpedia.org/ontology/restingPlace> <http://dbpedia.org/resource/Convent_of_the_Barefoot_Trinitarians> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}", "question": "Contar todos os livros escritos por um autor enterrado no Convento dos Trinit\u00e1rios Descal\u00e7os?"}]