!
#
#ent
&
(
)
+
,
-
.
/
//dbpedia.org
09
10
100
11e
1211_avenue_of_the_americas
13
14
14-15
15
16
162
17
1812
1929
1972
1972_oakland_raiders_season
1989
1989_portuguese_grand_prix
1994
1994_spanish_grand_prix
1996-1998
1999
19992000_watford_f.c._season
1999_san_marino_grand_prix
2
20
2002
2002_players_championship
2004
2006-07
200607_middlesbrough_f.c._season
2008
2009
2009-10
200910_marquette_golden_eagles_men's_basketball_team
200910_middlesbrough_f.c._season
2009_fifa_club_world_cup_squads
2011-12
201112_fc_spartak_moscow_season
2012
2012,13
201213_marquette_golden_eagles_men's_basketball_team
2013
201314_marquette_golden_eagles_men's_basketball_team
201314_panionios_g.s.s._season
201415_la_liga
2015
2015_alabama_crimson_tide_football_team
2015_argentine_primera_divisin
2015_fort_lauderdale_strikers_season
2015_north_american_soccer_league_season
2015_pro_duta_fc_season
2016
2016_fort_lauderdale_strikers_season
26
280
2d_command_and_control_squadron
2nd_foreign_infantry_regiment
333
39
39;70
39;den
39th_infantry_regiment_(war_of_1812)
3sub
400
470
5
5.1
5.1_surround_sound
6th_infantry_regiment_(united_states)
76
:
;
?
?u_0
?u_1
\
_
a
a-changin
a.
a_barrel_of_laughs,_a_vale_of_tears
a_foreign_policy_of_freedom
a_goon's_deed_in_a_weary_world
a_grand_day_out
a_literary_nightmare
a_rose_for_emily
aardman_animations
abbora
abertura
abiyev
abordados
abre
academia
academicadvisor
academicamente
academicdiscipline
academicjournal
academy_of_fine_arts_in_d
acadmica
acadmicas
acadmico
acadmicos
aceito
achatado
achievement
acionistas
aconselhado
aconteceram
aconteceu
actors
adams
address
adios
adis_amigo
administra
administrada
administrado
administram
administrao
administraram
administrativa
administrativeregion
administrativo
administrou
adriatic_sea
adritico
adultos
advanced_micro_devices
adventures
adventures_of_huckleberry_finn
adversrio
advocate_nasiruddin
advogado
advogado-geral
advogados
aeroporto
aeroportos
aes
afeganisto
affiliation
afghanistan
afiliadas
afiliados
afiliao
afluente
africa_'70_(band)
africana
africano
afrika_baby_bam
agaricus_bisporus
agatha_of_sicily
agncia
agncias
agnel
agora
agosto
ah141
ahead
ahmadiyya
aida
air
airline
airports
airtours
airtours_international_airways
airways
akira_ifukube
alabama
alan
alan_kusov__11
albert_einstein
album
alcal_de_henares
alcanados
alemanha
alemes
aleppo
alex_chalk
alexander
algo
algum
alguma
algumas
alguns
aliana
alice
alice&#39;s
alice's_wonderland
aliengenas
alimentar
alimentos
allen
allen_walker
alma
almamater
almunies
alpes
alpina
alpine_brigade_taurinense
alta
alton_ochsner
alugaram
alumini
aluno
alunos
alvin
alvin_bell
alvo
amaravila
ambas
ambientalismo
amblin_television
ambos
ambrose
amd
amendoim
america
american
american_basketball_league_(199698)
american_football_wellington
american_hockey_league
american_indian_wars
american_mediterranean_sea
american_pekin_duck
americana
americanas
americanfootballplayer
americanfootballteam
americano
americanos
amharic
amiga
amigo
amit_saigal
amp
amplo
amrica
amrico
an
an/fsq-7_combat_direction_central
ananda_college
ananda_weerasekara
ancient_rome
ancorados
and
anderson
andhra
andrea_poapst
andrew_jackson
angela
angela_trusty
angeles
anglo-frisian_languages
anglo-frsias
animada
animado
animador
animal
animator
ankh-morpork_city_watch
anlise
ann
ann_lewis
ano
anos
antecessor
antecessores
anterior
anteriores
anteriormente
antes
anthem
anthony
anthony_harvey
anthrax
antiga
antigas
antonio
antrtica
anupong_paochinda
ap
apanhador
aparecerem
aparelho
ape
apenas
apoio
apontador
apple
apple_productivity_experience_group
appointer
appple
apresentado
apresentador
apresentadoras
apresentados
apresentar
apresentaram
apresentou
aps
aptrida
aptridas
aquarius
aquarius_(rocket)
aquela
aqueles
ar
arabian_peninsula
arbica
archipelago
architect
architecturalstyle
arctic_ocean
arden
arden,_north_carolina
are
are&quot
area
areas
arena
argentina
arizona_state_sun_devils
arkansas
arlington
arlington_county,_virginia
arlington_national_cemetery
arm
arm_architecture
armadas
armas
arquiplago
arquiplagos
arquitecto
arquitetado
arquitetnico
arquiteto
arquitetos
arquitetou
arquitetura
arrasaram
art_students_league_of_new_york
arte
artes
artesanatos
arthur
arthur_d._levinson
artilharia
artist
artista
artistas
artstico
artsticos
arun_chandra_guha
as
ascendeu
ashot_grashi
ashton
asiana
asiana_airlines
asitico
assembleia
assembly
assentamento
assentamentos
assento
assinadas
assinaram
assinou
associada
associadas
associado
associados
associao
associate
associatedacts
associatedband
associatedmusicalartist
association_football
association_of_southeast_asian_institutions_of_higher_learning
assunto
assuntos
astronaut
astronautas
asus
at
atenas
atende
atendem
atendia
atendida
atendidas
atendidos
athlete
athletics
atividade
ativos
atkinson
atlantic_ocean
atlantium
atletismo
atlntico
atltica
atltico
atltico_petrleos_de_luanda_(handball)
ator
atores
atravessados
atravs
attorneys_in_sri_lanka
atua
atuais
atualmente
atuam
atuao
atuaram
atuou
audenried
audenried_tunnel
augusto
augustus
auletes
aunt_em
aureus
australia
australian
australian_alps
australian_of_the_year
australiano
australianos
austrlia
autdromo
author
authority
autodromo_enzo_e_dino_ferrari
automobile
automobileplatform
automotiva
automotivas
automveis
automvel
autor
autores
autoridade
autoridades
autorizadas
av
aventura
aventuras
avs
award
awards
ayres
azad
azerbaijan_state_academic_opera_and_ballet_theater
azul-pigmeu
b
b-17
babylon_5:_the_lost_tales
bacharel
bachelor
bachelor_of_arts
bacillales
bacilli
bacteria
bactria
bactrias
bafta
bafta_award_for_best_film_music
baikal
baikal_mountains
baixo
baker&#39;s
baker's_dozen_donuts
baku
baku_puppet_theatre
bal
balangir
balangir_district
balanidae
balaton
balaton_wine_region
banco
bancos
band
banda
bandas
bandmember
bando
banerjee
bangalore
bangkok
bankers_life_fieldhouse
bannock
bannock_(food)
baraily
barbarossa
barbatana
barber
barcelona
baronato
barony_of_caux
barrado
barragem
barrancas
base
baseadas
baseado
baseados
basearam
baseballplayer
baseballteam
basedon
baseia
basketball
basketballplayer
basquete
bass_guitar
batalha
batalhas
batata
bateria
batoka
batoka_gorge_hydroelectric_power_station
battisi
battle
battle_of_brownstown
battle_of_fort_stephenson
battle_of_france
battle_of_the_thames
battles
bay
bayley
bayou
bbc
bbc_hd
bbc_multimedia
bbc_news_(tv_channel)
bbc_one
bbc_two
be
beatificadas
beatificado
beatifiedby
beauty
bebida
bebidas
beckler
beckler_river
beer
before
before_i_let_you_go
beisebol
belas
beleza
bell
bellaire,_ohio
ben
ben_wilson_(american_football)
bend,_oregon
bengali
bengali_in_platforms
bengalis
benjamin_pulleyn
bento
berkeley,_california
berkshire
berlin
bernard
bernard_herrmann
bernstein
betts
beverage
beverly_hills,_california
bharatiya_janata_party
biblioteca
bibulus
big
big_creek_(texas_co._missouri)
big_spring_(missouri)
big_ticket_entertainment
bill
bill_clinton
bill_finger
bill_murphy_(baseball)
billed
billy
billy_clanton
binmios
binomial
binomialauthority
biolgica
biolgicos
bird
birmingham
birmingham_airport
birmingham_and_oxford_junction_railway
birthplace
bjelanica
bjelimika_rijeka
bjp
blayse
blizzard
blizzard_entertainment
bloco
blodpalt
blood
blowin
bmw_m10
board
board_game
boas
bob_hawke
bob_mcmullan
bobby_beasley
boca
bodydiscovered
bodyofwater
boeing
boeing_b-17_flying_fortress
boeing_field
bogdanua
boliche
bolsa
bomis
bon
book
border
bork
boston
boston_bruins
botas
box_girder_bridge
boys
boyt
brad
brad_paisley_discography
branco
brasileiro
braunfels
brazilian_jiu-jitsu
breeder
brentwood
bret
bret_simon
brian
brian_horwitz
bridge
briere
brigada
british_people
britnicos
broad_creek_(susquehanna_river)
broadcast
broadcast_syndication
broadcastarea
broadcastnetwork
bronze
bronzemedalist
brower
brower's_spring
brown
brown_hair
brownstown
bruce_bochy
bruce_lee
bruins
bruxos
bryant
brynn_carman
bsicas
buccinidae
buccinoidea
buckens
buckhurst
buckhurst_hill_county_high_school
bud_adams
buda
budapest
buddhism
budismo
builder
building
burbank,_california
burro_flats_painted_cave
butch_metzger
butter
butters'_very_own_episode
c
c++
c._e._webber
c.d._primeiro_de_agosto_(basketball)
c_(programming_language)
cabal
cabelos
cabo
cactinopterygii
cada
cadeias
cadillac_fleetwood
caf
caio_zanardi
caixa
calcut
calera,_oklahoma
california
califrnia
callisto
callisto_(moon)
calpurnius
camboja
cambojanos
camilla
camilla_martin
campanha
campeonato
campeonatos
campi
campo
campos
campus
canad
canada
canadians
canal
canal_&_river_trust
canaveral
canes
canidae
canonizada
canonizadas
canonizado
canonizados
canonizaram
canonizedby
canto
canton_of_fribourg
cantor
cantou
canut
capa
cape_canaveral_air_force_station
cape_canaveral_air_force_station_launch_complex_26
cape_canaveral_air_force_station_launch_complex_5
cape_canaveral_air_force_station_space_launch_complex_17
cape_town
capital
caprice
card
cardeal
cargo
cargos
carl_sagan
carlos
carlos_emmons_(american_football)
carmela_soprano
carne
carolina
carolina_panthers
carr
carreira
carreiras
carros
carter
cartoonito
casa
casado
cascade
casou
caspian_sea
castanhos
castelo
catarina_lindgren
catch
catch_my_soul_(uk_stage_version)
catcher
catedral
cathedral_peak_(california)
cathedral_range
catmull
causa
causas
caux
cavalcade_of_america
cavalos
caverna
cbs
cbs_corporation
cd
cdtv
ce
cegos
cell_(microprocessor)
cemitrio
cenrio
centrais
central
central_semitic_languages
central_washington
centro
cerco
cerebral
cerebral_blood_flow
cerejas
ceremonialcounty
cerimonial
cervelle
cervelle_de_canut
cfrx
chairman
chalota
chamada
chamado
champion
chanceler
chancellor
chandra
chandra_shekhar
changin
channel
channel_district
chap
charles
charles_ayres
charles_evans_hughes
charles_lemaire
charles_phelps_taft_ii
charles_v,_holy_roman_emperor
charlie
chatumongol_sonakul
cheasty_boulevard_south
cheers
chefe
chefes
chefiados
chefiava
chegou
chemistry
cherokee
cherry_chevapravatdumrong
chess
chestnut_(coat)
chevapravatdumrong
chevrolet
chevrolet_caprice
chicago
chicago_bulls
chicken
chicken_little_(1943_film)
child
children
china
chinesa
chiva
chiva_bus
chordate
chris-craft_industries
chris_knierim
chris_marve
christchurch
christianity
christmas
chunghee
church_of_england
cibano
cibao_international_airport
cidad
cidadania
cidade
cidades
cidados
cientfica
cientista
cientistas
cientologistas
cincias
cineasta
cinema
cinema_international_corporation
cinematografado
cinematography
circulam
circundam
cirque
cirque_du_soleil_discography
cite
cities
citizenship
city
city_of_new_orleans_(song)
city_of_newcastle
ckfm-fm
clanton
clar
clara
clark
class
classe
classic_rock
classificados
clatsop
clatsop_county,_oregon
clearwater
clearwater_county,_minnesota
clemente
cleopatra_v_of_egypt
clepatra
cline
cline_buckens
club
clube
clubes
clud
cmara
cncer
cnjuges
co-fundadores
coach
coberta
cobra
cobrados
coco
coconut
coffee
cogumelo
cohoes
cohoes,_new_york
coisas
colaboradores
colaborao
colaboraram
colaborou
colbert
colemanville
colemanville_covered_bridge
colgio
colin_powell
colinas
college
collin_county,_texas
colonel_(united_states)
coloniais
colonial_troops
colonials
colorado
colorado_avalanche
colour
colts
columbia
columbia_lake
columbia_records
columbia_university
columbus_crew_sc
com
comandado
comandante
comandantes
comando
combatant
combate
comdia
comea
comeam
comearam
comercial
comicscharacter
comicscreator
comigo
commander
commandstructure
commodore_64
commodore_cdtv
commodores
como
comodoro
companhia
companhias
companion
companion_(doctor_who)
company
compareceram
compartilham
compatveis
complexo
composer
compositor
compositora
compositores
composta
compostas
composto
compromissos
comps
computao
computers
computingplatform
comum
comumente
comuns
concedeu
concedido
concedidos
condado
condados
conde
confiana
confidencial
confidential
conflito
conflitos
congress_socialist_party
congresso
conhece
conhecida
conhecidas
conhecido
conhecidos
conjunto
connect
connecticut
connecticut_river
conowingo
conowingo_dam
conquistado
conquistados
conquistaram
conseguiu
conselho
conselhos
considerada
considerado
console
consoles
construdo
construes
construiu
construtor
construtora
construtores
consulta
conta
contagem
contar
conte
conte-me
contedo
contidas
continental
continental_army
continental_artillery_regiment
continente
continentes
contnet
contos
contra
contratados
contribui
controla
controladora
controle
convenes
conveno
convent_of_the_barefoot_trinitarians
convention
convento
cooke
cooper
cooper_mountain_vineyards
copa
cor
cordado
cordata
cordilheira
coreana
coreano
coreografada
cornelius
cornell_university_press
coronis
corp
corpo
corporation
corpos
corre
corredor
correm
correram
corrida
corridas
costa
costanzo_preve
costumava
costumavam
country
county
countyseat
coverartist
cowombat_flat
cozinhado
cpu
craig
craig_robinson_(actor)
craig_van_tilbury
creative_commons
creator
creators
creature_comforts
creek
crena
crenas
cria
criado
criador
criadores
criados
crianas
criao
cricket
crimson
criou
cristos
criteria_studios
croata
croatian_inline_hockey_league
cronenweth
crook_county,_oregon
cross-platform
crosses
croton
croton_river
crquete
crus
crusade
crusade_(tv_series)
crustacean
crustceos
cruz
cruzada
cruzam
csar
cspio
ctv
ctv_television_network
cucaso
cuja
cujas
cujo
cujos
cunningham
currency
current
current_river_(missouri)
currentmember
currentmembers
curso
curta-metragem
cy-fair_high_school
czech_extraliga
d
d&#39;aveneyre
d&#39;gua
d-me
da
dada
dadas
dado
dados
dafydd_benfras
daisi
daisi_pollard
dale
dale_mitchell_(ice_hockey)
dallas
dallas_cowboys
damasco
damasucs
damon_hill
dan
dan_otero
dan_river_(middle_east)
dana
daniel
daniel_l._d._granger
danny_felice
dart
dart_(programming_language)
dartmouth
das
datl
datla_satyanarayana_raju
daund
daund_junction_railway_station
dave_attell
david
david_bowens
david_isaacs_(writer)
david_johnston
david_paton
david_pressman
david_scherman
david_w._brown_house
davies
day
dc
de
dead_sea
deathcause
deathplace
debre_libanos
debutteam
decide
dee_dee_warwick
deed
defenceman
defense_security_command
defensor
defensores
defesa
deixada
delta_iii
demis_roussos
democrata
democratas
democratic_party_(united_states)
den
denomination
denton
denton_county,_texas
dentro
denver_broncos
departamento
depois
deputado
deputy
deram
deriva
desagua
descalos
descanso
descoberto
descobriu
desconhecido
desembocam
desenhada
desenhadas
desenhado
desenvolve
desenvolvedor
desenvolvedores
desenvolvem
desenvolveram
desenvolveu
desenvolvidas
desenvolvido
desenvolvimento
desgua
desguam
design
designcompany
designer
designers
destination
destinations
destinatrios
destino
destinos
detentores
detroit
detroit_pistons
deu
developer
device
devido
devolver
devon
dhamma
dharma
dhoondte
dhoondte_reh_jaaoge!_(1998_film)
dia
diana
diana_taylor_(superintendent)
diego
diferentes
diga
diga-me
dinheiro
dionne_warwick
diplomacy
diplomatas
diprotodontia
director
direito
direitos
direo
diretivo
diretor
diretores
diretoria
dirigente
dirigentes
dirigida
dirigidos
dirigiram
dirigiu
disciplina
disciplinas
discipline
discografia
discos
discoverer
disease
disney
disneytoon_studios
disponveis
dispositivo
dispositivos
disputadas
disputados
disputou
distinto
distpica
distribuda
distribudo
distribudos
distribui
distribuidor
distribuidora
distribuidores
distribuio
distributinglabel
distributor
district
distrito
dividido
divises
division
diviso
do
dobinsk
dobinsk_ice_cave
doctor
doctor_who:_the_mazes_of_time
doctor_who_confidential
doctor_who_extra
doctoraladvisor
doctoralstudent
dodge
doena
dois
dolley_madison
domain
dominican_republic
dominicana
domnio
don
don_r._berlin
donald
donald_wilson_(writer_and_producer)
donn
donn_barber
dono
donos
donuts
doodle
doonesbury
doonesbury_(musical)
dos
douard_mntries
doubleday
doubleday_(publisher)
douglas
douglas,_isle_of_man
douglas_netter
douglass
douglass_north
doutorado
dozen
draft
draftteam
dragon&#39;s
dragons
dragons'_den_(uk_tv_series)
dreamworks
dreamworks_television
drum_kit
dschinghis
dschinghis_khan_(song)
du
dubladora
dublin
dublin_airport
dufresne
dulles
duncan_sandys
duncan_u._fletcher
duong
duque
durante
durfee
duta
duwamish
e
e39
e8
eagle
eagles
earl
early_in_the_morning_and_late_at_night
east
east_norwalk_historical_cemetery
east_tilbury
eastern_washington
easy
easy_street_(film)
economist
eddie
eddie_anderson_(safety)
edifcio
edifcios
edimburgo
editadas
editado
edith
edith_vonnegut
editing
editor
editora
editoras
editores
editou
edmund
edmund_john
educacionais
educacional
educao
education
educationalinstitution
edward_douglass_white
edwin
edwin_catmull
egerton
egito
egpcio
egyptian_arabic
einstein
elas
ele
electoin
electronics_manufacturing_services
eleies
eleito
eleitoral
elenco
eletrnica
elizabeth
elizabeth_alexander_(press_secretary)
ellsworth_bunker
elton_john_and_tim_rice's_aida
em
emanuel_de_guzman
emi
emil_dean_zoghby
emilio_nez
emily
emirado
emissoras
emmitsburg,_maryland
emmons
empire_of_atlantium
employer
emprega
empregador
empregadores
empregos
empregou
empresa
empresa-me
empresa-pai
empresas
encontra
encontrados
encontramos
encontrar
encontre
enfatizam
engenheiros
engine
engineer
england
england_national_football_team
england_national_under-20_football_team
england_national_under-21_football_team
english_americans
english_language
enquadram
enrique_jos_varona
ensino
ent
enterradas
enterrado
enterrados
entertainment
entre
entregues
entroncamento
enumere
environmentalism
envolveu
envolvida
envolvido
envolvidos
episcopal
episcopal_church_(united_states)
episdio
equipe
equipes
era
eram
erban
erban_ieica
eric
eric_schiller
erica
erica_frank
erich_bagge
erich_kempka
erik
erik_bork
escalado
escalar
escalaram
escalou
esccia
escola
escolas
escreve
escreveram
escreveu
escrita
escritas
escrito
escritor
escritora
escritores
escritos
escritrios
escultor
espacial
espanha
espanhol
espanhola
espcie
espcies
especialidade
espies
esporte
esportes
esportiva
esportivas
esposa
esposas
esquadro
esqueleto
esquerda
esquerdo
esqui
esses
essex
est
estado
estado-maior
estados
estaduais
estadual
estaes
estao
estava
estavam
estdio
estdios
estendeu
esteve
esther_alder
estilista
estilo
estilstica
estimativa
estime
estiveram
esto
estocolmo
estrada
estrangeiro
estrearam
estreia
estrela
estrelando
estrelou
estreou
estria
estrutura
estruturas
estudantes
estudar
estudaram
estudou
esturio
eth
ethics
ethiopia
ethnicgroup
ethnicity
etinicidade
etipia
etnia
etpia
eua
europa
europe
european_route_e39
european_route_e8
europeias
eurovision
eurovision_(network)
eustus
evans
evenor
evenor_(collection)
event
eventos
everest
evergreen
evergreen_high_school_(king_county,_washington)
everybody
everything_will_be_ok
ewald
ex-aluno
ex-alunos
ex-companheiros
ex-coregrafo
ex-equipe
ex-equipes
ex-jogadores
ex-membro
ex-parceiro
ex-parceiros
ex-tcnico
ex-time
ex-times
ex-treinadora
executadas
executados
executiva
executiveproducer
executivo
exibidos
existe
existem
experience
expressa
exrcito
externa
extraliga
f
fabrica
fabricada
fabricadas
fabricados
fabricam
fabricante
fabricantes
fabricaram
fabricou
faces
faculdade
faculdades
fairfield,_connecticut
faixas
fala
faladas
falam
falcon
fama
fame
family
famlia
famlias
famosa
famosas
famoso
famosos
fanning
fantasia
fantasy
fantasy_television
fashiondesigner
faz
fazem
fazer
fazia
fbi
fbrica
fc
federal_bureau_of_investigation
feita
feitas
feito
feitos
female
feminino
femininos
feminism
fender_stratocaster
feng_zicai
ferramentas
ferreiros
ferrovia
ferrovias
ferroviria
ferrovirias
ferrovirio
festa
festival
festival_records
fez
fica
ficaram
ficava
fico
ficou
fictcio
fictcios
fictionalcharacter
field
field_marshal
fields
fifa
fighting
figura
figuras
figureskater
filbert
filbert's_old_time_root_beer
filha
filho
filhos
filiado
filipinas
film
filme
filmes
filmou
filo
filosofia
filsofo
filsofos
final
finding_nemo
fins
firmicutes
first_legislative_assembly_of_uttar_pradesh
first_national_bank_and_trust_building_(lima,_ohio)
firstascentperson
firstdriver
firstteam
fizeram
flatbread
flores
floresta
flow
flowering_plant
flrida
fluem
flui
fluir
fluxo
fluxos
flying
foguete
foguetes
foi
folk
fonte
food
football
footballmatch
fora
foram
foras
ford
ford_air_transport_service
ford_falcon_cobra
ford_kansas_city_assembly_plant
ford_model_c
ford_model_k
ford_motor_company
ford_sho_v8_engine
ford_y-block_engine
forks
formados
formaram
format
formato
formerbandmember
formerbroadcastnetwork
formerchoreographer
formercoach
formerpartner
formerteam
formulaoneracer
forn
fornea
fornecedor
fort
fort_barrancas
fort_gadsden
fort_lauderdale_strikers
forte
fortress
fotgrafos
fotografia
foundation
foundationplace
foundedby
founder
fox
fox_broadcasting_company
fox_sports_(united_states)
foxconn
foxy
foxy_brown_(rapper)
foz
fr
fr._agnel_multipurpose_school_and_junior_college
fr._orlando
fraiser
frana
francesas
francisco
francisco_lachowski
francs
frank
frank_stilwell
franois-marie_le_marchand_de_lignery
franois_hollande
franz_brentano
frasier
fred_hoiberg
frederick
frederick_cooke_(socialist)
fredis
fredis_refunjol
freedom_of_the_city
freescale_semiconductor
french_language
french_southern_and_antarctic_lands
frequenta
frequentaram
frequentou
friburgo
frica
friedman
friends
fritz
fritz_chess
front-engine,_four-wheel-drive_layout
fronteira
fronteiras
fsico
fsq-7
funciona
funcionam
funcionrio
funcionrios
fundada
fundadas
fundado
fundador
fundadores
fundiu
fundou
fusajiro_yamauchi
fusil_gras_mle_1874
fuso
futebol
gabriel_slaughter
gadsden
gales
gales_ferry,_connecticut
game
gandhi
ganhadores
ganharam
ganho
ganhos
ganhou
ganso
ganz_uv
garage
garbage
garbage_(band)
garca
garland
garne
garota
garrison
garry
garry_unger
gary
gary_garland
gary_holder-winfield
gary_portnoy
gary_snchez
gata
gato
gatwick
gatwick_airport
gelo
gender
geneva
genisys
genre
geoffrey_burgon
gerais
geral
gerald
gerald_gibbs_(cinematographer)
gerald_reaven
geralmente
gerao
gerard_marino
gerenciados
gerenciamento
gerente
german-occupied_europe
germanic_languages
germnicas
gestapo
gesto
gibb
gibbs
gibloux
gibraltar
gibson
gibson_les_paul
gimhae
gimhae_international_airport
ginstica
girl_from_the_north_country
girls
giuseppe_bertello
glasgow
glasgow_airport
gleason
glen
glen_and_les_charles
glendale,_california
globo
gloucestershire
glover
glover_(video_game)
gm
gm_b_platform
gnero
gneros
gnu
gnu_general_public_license
go
go_(programming_language)
gol
golan_heights
gold
golden
golden_globe_award
golfe
golfplayer
google
google_cloud_connect
google_custom_search
google_web_toolkit
goolwa
goolwa,_south_australia
goon&#39;s
goose_lake_valley
gorge
gough_whitlam
gounkina
governa
governada
governado
governador
governadoria
governados
governamentais
governamental
governando
governaram
governingbody
governmentagency
governmenttype
governo
governor
governou
govinda
govinda_(actor)
gp
gpl
gps
graduados
graham
graham_richardson
grand
grand_forks_air_force_base
grand_serail_of_aleppo
grande
grandes
grandprix
grandsire
granger
grape
grau
gravadas
gravado
gravadora
gravadoras
gravados
gravando
gravou
grays
greasy
greasy_pop_records
greater_napanee
greater_san_antonio
gredelj
greek_revival_architecture
green_river_(duwamish_river)
greg_daniels
gregg_toland
grego
gregorios_bernardakis
gridironfootballplayer
grigorian
grit
ground
group
grupo
grupos
gss
guarnecidas
guarnio
guerra
guerras
guild
guitar
guitarrista
guy
guy_(band)
gymnastics_at_the_2008_summer_olympics__women's_artistic_individual_all-around
gza
gza_horvth
h
habitacional
hagar
hagta,_guam
hahn
haircolor
haiti
haiti_i_am_sorry
hall
hallopus
hammond
hammond_organ
hang_chuon_naron
harlan_mathews
harlem
harris
harris_county,_texas
harry
harry_and_the_potters_(album)
harvard
harvard-westlake_school
harvard_college
harvard_medical_school
hasse
haunted
havia
hayes
hbo
hd
he's_a_liar
headquarter
headquarters
heisenberghttp
helsinki
helsinque
henri
henri,_duke_of_rohan
henri_putz
henry
henry_howard,_1st_earl_of_northampton
herald
herrmann
hidreltrica
high
highschool
highscool
hill
hino
his_new_job
histrias
histrico
histricos
hockey
hoffmann
hohenau
hohenau,_paraguay
holanda
holder-winfield
holland
holmes
holmes_colbert
homens
homestadium
homestadiums
homestead
homestead_grays_bridge
hometown
hominidae
honorrio
honorrios
honours
hora
hornito
hornito,_chiriqu
horrio
horse
horserace
horvth
horwitz
hospital
hotchkiss
hour
house
houston_astros
houve
howard
howard_hughes_medical_institute
hq
hquei
hub
hubairport
hubert
hubert_wiggs
hubs
hudson
hudson_river
hughes
hulk
human
human_rights_party_(cambodia)
humano
humanos
huntington-whiteley
hyderabad
hylebos
hylebos_creek
i
icehockeyplayer
idelogia
ideologia
ideology
idioma
idiomas
idowu-fearon
ieica
if_we_were_a_movie
igor_shpillband
igreja
igual
ii
ikaros_smederna
ike
ike_clanton
ilha
ilhas
illini
illinois
illinois_fighting_illini_men's_basketball
illustrator
ilya
ilya_savelev
importante
importantes
imprio
in
incidente
incio
incluram
incrveis
incrvel
incumbent
india
indian_english
indian_general_election,_2004_(andhra_pradesh)
indian_general_election,_2004_(delhi)
indian_general_election,_2009
indian_ocean
indian_standard_time
indiana
indianapolis
indianapolis_colts
indianas
indiano
indique
indira
indira_gandhi
indivduo
individuais
individual
indochina
indstria
industry
infantaria
inferior
inflow
influenced
influencedby
influenciador
influenciados
influenciaram
influenciou
informationappliance
inglaterra
inglesa
ingls
ingredient
ingrediente
ingredientes
ingressou
iniciadas
inkas
inline
inma_gonzlez
inquilino
inquilinos
inscreveram
inscrita
insetos
inside
inspirado
inspirao
instituies
instituio
institution
instituto
institutos
instrument
instrumento
instruments
insurgncia
integrada
integrante
integrantes
intendente
interesse
interesses
internacional
international
international_association_of_universities
interplay_entertainment
inthakin
intrprete
inventado
inyo
inyo_national_forest
ios
iowa
ireland
irlandeses
irm
irmos
irne_joliot-curie
irving_chernev
isaacs
isauricus
ishir_honda
isl
islam
islamic
islamic_azad_university_central_tehran_branch
island
island_bayou_(oklahoma)
islmica
islmico
ispartof
israel
israelita
it
italianos
italic_languages
italy
itens
itlico
ivan
ivan_toplak
ivanpah_solar_power_facility
ivory_coast_national_football_team
j
j.
j._michael_straczynski
j._t._krogh
ja,_vi_elsker_dette_landet
jaaoge
jack_mcgregor
jack_your_body
jaimatu
jaime_bateman_cayn
james
james_f._o'brien
james_horner
james_maker
james_needs
james_roberts_(trade_unionist)
jamiatu
jamiatu_muslim_mindanao
janata
janata_dal
janata_party
jane
jann_wenner
japan
japo
jared
jared_bernstein
jared_kushner
jasmine
jasmine_lowson
jason
jason_carter_(actor)
jawaharlal_nehru
jay_gogue
jazz
jazz_fusion
jean
jean_segura
jeff_conaway
jeffrey_werleman
jeju
jeju_international_airport
jenny_macklin
jens
jens_jensen_(landscape_architect)
jensen
jerome_b._chaffee
jerry
jerry_seinfeld
jerusalem_institute_of_justice
jerusalm
jessi_colter
jeyhun
jeyhun_abiyev
jill_krementz
jim
jim_harris_(entrepreneur)
jim_mcmillin
jim_sasser
jim_wylie
jimmy_wales
jiu-jitsu
jlio
jnior
jo_garcia
job
job_durfee
joe
joe_porter_(american_football)
joe_purcell
joe_schilling
joel_schumacher
joga
jogado
jogador
jogadores
jogados
jogam
jogando
jogar
jogaram
jogo
jogos
jogou
john
john_adams
john_betts_(connecticut_politician)
john_fanning_(businessman)
john_hospers
john_mcewen
john_michael_seabright
john_of_damascus
john_randolph_of_roanoke
john_roeslein
john_thomson_mason_(17871850)
john_tory
johnny_cash
johnson
jojo_chintoh
jon
jon_speelman
jonas
jonas_brothers
jones
joo
jordan
jordan_cronenweth
jordan_river
jordo
jornais
jornal
jos_luis_narom
josep_maria_bartomeu
josh
josh_bell_(gridiron_football)
josh_friedman
josiah
josiah_idowu-fearon
journal
journal_of_cerebral_blood_flow_&_metabolism
jowai
jr
jt
juan
judaism
judasmo
judge_advocate_general's_corps,_united_states_army
judges
judy_hart_angelo
juelz_santana
juiz
julgamento
juli
juli_ashton
julia_gillard
julie_gardner
julius_caesar
junction
junior
juno_i
juntam
juntos
jurado
jurisdiction
jurisdio
just_another_day...
justia
justo
juvenil
juvenis
juzes
k
kafue
kafue_river
kala
kala_pani_(1958_film)
kalutara
kalutara_electoral_district
kampuchean_united_front_for_national_salvation
kampucheana
kane
kansas
kapodistrian
kapur
karafarin
karafarin_bank
karen
karen_grigorian
kariba
kariba_dam
karl
karl_ewald_hasse
karu_jayasuriya
kaszanka
katy_b
kazan
keeler
keller
keller's_mill_covered_bridge
kelly_brook
kelsey_creek
ken
ken_holland
keningston
kennedy
kennedy_family
kensington
kensington,_maryland
kenthurst
kenthurst,_new_south_wales
kenya
kerguelen
kerguelen_islands
kevin_jonas
kevin_rudd
keyperson
kffg
khan
kharghar
khmer_issarak
kiev
kimberly_stewart
kimihiro
kimihiro_watanuki
king
king_county,_washington
king_crimson
kingdom
kingdom_of_israel_(united_monarchy)
kingdom_of_naples
kings
kingsley_wood
kit
knownfor
knows
kobalt_label_services
korean_fox
krapanski_potok
krasnye
krasnye_vorota_(moscow_metro)
kriminalpolizei
krogh
krom_ngoy
kron
ktxy
kubrick
kulim
kumasi
kumho
kumho_asiana_group
kumta
kusov
l&#39;isle
la
la_marseillaise
label
lachowski
ladnia
ladonia
ladonia_(micronation)
laemmle_theatres
lago
lagos
lagos_preparatory_school
lake
lake_county,_oregon
lake_mead
lake_ontario
lake_victoria
lanado
lanados
lanamento
lanao_del_sur
lanaram
lancy
language
language_integrated_query
languagefamily
languages
languages_of_ethiopia
lanka
lankan
lanou
laptev
laptev_sea
largestcity
larry
larry_david
larry_j._franco
lars
lars_pearson
latvian_wikipedia
lauderdale
launchsite
lava
lava_river_cave
lawrence
lawrence_f._cafero
layout
layouts
lbum
lbuns
lcia
lcifer
ld
lder
lderes
le
le_gibloux
leader
leadername
league
lebrnik
lee
lee_leffingwell
leffingwell
lefttributary
legacy
legislativa
lekh
lekh_castle
lena
lena_river
lennier
lentulus
leo
leonid_fedun
les
let
let_it_be_(musical)
letitia_mactavish_hargrave
leto
letra
letras
leuven
levaram
levinson
levou
lewis
lewis_hamilton
li_si
liberdade
licena
licenciadas
license
lida
liderada
lideradas
liderado
liderados
liderou
lies
lieutenant
life
liga
lightning_mcqueen
linda_hogan
linguagem
linguagens
linguistics
linha
linhas
lions
lista
listar
liste
literarygenre
literria
literrio
little
little_black_river_(missouri_-_arkansas)
little_colorado_river
live
live_in_detroit,_mi
liverpool&gt
liverpool_city_region
livres
livro
livros
lngua
lnguas
locais
local
localauthority
localizada
localizadas
localizado
localizados
localizao
locatedinarea
location
locationcity
locationcountry
locations
locationtown
locatrios
lodaiska
lodaiska_site
lodz
londo
londo_mollari
london
londres
loretta_ucelli
los
los_angeles
los_angeles_angels_of_anaheim
los_angeles_international_airport
los_angeles_kings
los_angeles_lakers
los_angeles_world_airports
louis
louis_brire_de_l'isle
louis_d._astorino
louisa_hill
lower_manhattan
lowson
lpga
lpide
ltimos
luanda
lucifer's_hammer
lucius
lucius_cornelius_lentulus_crus
lucrativos
lugar
lugares
lung_cancer
lusaka
lutadores
lutando
lutaram
lutou
luxuria
luxuria_(band)
luzhniki_stadium
lyrics
mac
mac_os
macaco
macacos
macieira
macintosh_quadra_660av
macros
madison,_wisconsin
madrid
magazine
magnlia
magnolia_place
maharashtra
maike_evers
main_course
maine
maine_school_of_science_and_mathematics
maininterests
maintainedby
mainter
maior
maiores
mais
major-general
major_general_(united_states)
majorshrine
mal-assombrada
malatraix
malaysia
malaysia_junior_hockey_league
malaysian_chinese_association
malaysian_public_works_department
male
malsia
malta
mamferos
mammal
man
manager
managerclub
managerclubs
mangsaysay
manh
manhatten
mantenedores
manthena
manthena_venkata_raju
mantida
mantidas
mantm
manufacturer
manufatura
manurewa_high_school
mar
maravilhas
marciais
marco
marcos
marcus
marcus_calpurnius_bibulus
marechais
mares
marfim
marido
marina_pankova
marinha
marino
mario
mario_garca_menocal
marion
marion_dufresne_(1995)
marionetes
mark
mark_johnson_(producer)
mark_sandrich
marquet
marquette
martelo
martha
martha's_vineyard
martialartist
martin
martin_molony
martin_prochzka
martini
martino
martino_martini
marvell
marvell_technology_group
mary
mary_poppins
mary_poppins_(musical)
maryland
mascot
mascote
masculina
masculino
masculinos
mason
massachusetts
massachusetts_house_of_representatives
master
mastercard_centre
matemtica
mater
mathematics
mathura
mathuravadodara_section
matinee
matou
matriz
matthew
matthew_kane_(actor)
mavro
mayor
mazes
mccurry
mcdonnell_aircraft
mcewen
mclaury
mcmilin
mcmullan
mdicos
mdio
me
meadow_soprano
medalha
medalhas
medalhista
medician
mediterranean_basketball_association
mediterrnea
mediterrneo
medley
meigs
meio-campista
memberofparliament
membro
membros
menetries
menetries's_warbler
menino
menocal
menos
mensageiros
mente
mentiroso
mergedintoparty
mergulhar
meriil
merritt
merritt_cabal
merritt_paulson
mesmo
metabolism
metafsica
metaphysics
metros
meu
mgico
miami
miao
miao_people
michael
michael_deeley
michael_dell
michael_hahn
michael_m._sears
michael_mayr
michael_powell_(lacrosse)
michigan
micronesia
microsoft
microsoft_azure
microsoft_expression_encoder
microsoft_office_picture_manager
microsoft_surface
microsoft_windows
mid_wales
middlebrough
middlesbrough
middlesbrough_f.c.
midfielder
midhurst
midland_college
miguel_de_cervantes
mika_hkkinen
mike
mike_mccurry_(press_secretary)
miley_cyrus
militar
militares
militarybranch
militaryconflict
militaryperson
militaryrank
militaryunit
minar
mind
mind_blowin'_(smooth_song)
mind_sport
mindanao
mindano
ministrio
ministro
ministry_of_railways_(india)
minjoo
minjoo_party_of_korea
minnesota
mississippi
mississippi_river
missouri
misto
mitchell
mixed-sex_education
mizoram
mizoram_legislative_assembly
model
modelo
modelos
moeda
moedas
mohamedia
mohamedia,_tunisia
moiss
mollari
mollusca
molony
moluscos
momoko_kchi
monarca
monarcas
monarch
montada
montado
montagem
montanha
montanhas
montauk
montauk_state_park
monte
monticello
monty_python
moondog
moondog_matinee
mora
moradores
moram
morfina
morozov
morphine
morreram
morreu
morris
morristown,_new_jersey
morte
morto
moscou
moscou-caz
moscou-kazan
moscow-kazan_high-speed_railway
moscow_governorate
moses
moskovsky
moskovsky_railway_station_(saint_petersburg)
mother
motherland_(anthem)
motivos
motor
motown
mount_bachelor_ski_area
mount_everest
mount_hoffmann
mountain
mountainrange
mouthcountry
mouthmountain
mouthplace
movement
movimento
mp
mr._jim's_pizza
msica
msicas
msico
msicos
mt
mtr
muito
multifuncional
multiplataforma
multipurpose
multiuso
mumbai
mumbai_vadodara_expressway
mundial
mundo
municipal
municipal_council
municipality
municpio
municpios
murphy
murray
murray_gleeson
murray_gold
murray_mouth
museu
museum
music
musicais
musical
musicalartist
musicalband
musicalwork
musicby
musiccomposer
musicgenre
muslim
mvel
my
my_truly,_truly_fair
n
na
nacional
nacionalidade
naes
name
name&quot
nao
napster
narrador
narrator
narrou
nas
nasa
nasce
nascem
nascente
nasceram
nasceu
nascidas
nascidos
nascimento
nasiruddin
natal
natao
natgeo
nathaniel_p._hill
national
national_and_kapodistrian_university_of_athens
national_basketball_association
national_collegiate_athletic_association
national_geographic_(magazine)
national_hockey_league
national_museum_of_racing_and_hall_of_fame
nationality
nationalteam
nativa
naval
naval_station_mobile
naval_support_activity_naples
navio
navios
nazi_germany
nazista
nba
nbc
ncaa
ndia
ndico
ndios
nea
nea_smyrni_stadium
nearestcity
nebraska
necessidades
necessrios
neighboringmunicipality
neil_cross
nemo
neretva
neria
neria_douglass
netter
network
networks
neuroimagem
neuroimaging
nevada
neverwhere
neverwhere_(radio_play)
new
new_braunfels,_texas
new_sanno_hotel
new_way_(israel)
new_york
new_york_city
new_york_city_housing_authority
new_york_post
new_york_state_route_470
newcastle
newell&#39;s
newell's_old_boys
newman_haynes_clanton
news
newspaper
ng
ngoy
nibus
nick
nick_castle
nick_park
nico
nicomedia
niederkirchnerstrae
night
nikolai
nikolai_morozov_(figure_skater)
nintendo
nittany
nku
nmero
no
no-fico
noite
nome
nomeie
nomeou
nomes
non-governmental_organization
non-profitorganisation
nonfictionsubject
nord
nord_(video_game)
nordeste
normalmente
noroeste
norte
norte-americano
norte-sul
north
north-western_province,_zambia
north_america
north_american_poker_tour
north_bend,_ohio
north_carolina
north_carolina_highway_280
north_caucasian_emirate
north_caucasus_railway
north_sea
northampton
northeast_library
northsouth_transport_corridor
noruega
noruegus
norwalk
norway
norwegian_language
nos
not
not_on_our_watch_(organization)
notablecommander
notableinstruments
notablework
notableworks
notveis
notvel
nova
nova-iorquino
novair_international_airways
novelas_ejemplares
novilho
novo
now
now_tv_(uk)
npoles
ny
nyc
o
oakland
objetivos
obra
obras
obrien
occupation
occupation_of_japan
oceano
ocidental
ocorreram
ocorreu
ocupa
ocupada
ocupaes
ocupao
ocuparam
ocupava
oddworld
oeste
of
oferece
office
officeholder
officiallanguage
oficiais
oficial
oficialmente
oh
oh!_darling
ohio
old
old_lyme,_connecticut
olivier_boulay
olmpicos
olyokma
olyokma_river
omaha
omaha,_nebraska
on
on_air_with_ryan_seacrest
onde
one
one_day_at_a_time_(em's_version)
ong
ongs
ontario
ontrio
ope
openingtheme
opera
operacionais
operacional
operado
operador
operadores
operados
operam
operando
operao
operatingsystem
operation_barbarossa
operator
oponente
oponentes
opponent
ordem
order
ordnungspolizei
oregon
organisation
organizaes
organizao
organizao-me
orientadas
orientador
oriental
origem
origens
origin
origina
originadas
original
originalmente
originam
originaram
originou
originrias
originrio
originrios
orleans
orthonychidae
ortoniqudeos
os
oscoda,_michigan
oslo
otero
otherparty
otomano
ottoman_empire
our
ouro
outflow
outra
outras
outro
outros
ouvir
owner
owningcompany
owningorganisation
owyhee
owyhee_river
oxford
oysterhead
oz
p
pacfico
pacific_ocean
padro
pahang
pai
pais
paisley
palang
palang_dharma_party
palco
pandaruan
pandaruan_bridge
pandaruan_river
pani
panionios
panki
panki_block
panthers
papa
papeete
papel
para
paraguai
paramount_domestic_television
paramount_television
pararam
parceira
parceiro
parceiros
parent
parentcompany
parente
parentes
parentmountainpeak
parentorganisation
paridade
paris
park
park_chung-hee
park_rankin
parlamento
parliament
parolin
parque
parsons_school_of_design
part
parte
partem
partes
participantes
participaram
participou
partidas
partido
partidos
partidrios
partner
party
pas
pases
passa
passado
passam
patente
patinador
patinadores
pato
patrcia_amorim
patrimnio
pattie_mallette
paul
paul_jones_(american_football)
paulo
pawan_hans
pblico
pcl
pcl_construction
pe
pea
peanuts
peanuts_motion_comics
pearson
pekin
pela
pelas
pelo
pelos
penn
penn_state_nittany_lions_football
pennsula
pennsylvania
pensilvnia
people's_bank_(sri_lanka)
pequeno
pera
peridico
peridicos
perkins
perkins_school_for_the_blind
persa
person
personagem
personagens
personalizada
pertence
pertencem
pertencente
pertencentes
pertencia
perth
perto
peruano
peruvian_army
pesadelo
pesquisa
pesquisadores
pessoa
pessoas
pessoas-chave
petersburgo
petroleos
phelps
phil_collinson
philippine_ports_authority
philosophy
phm
phm_vn_ng
phoenix_suns
photographer
phylum
pico
picos
pietro
pietro_parolin
piloto
pilotos
pintado
pintados
pintor
pintores
pio
pistes
pit
pittsburgh
pittsburgh_line
pixar
pixar_image_computer
pixarcascadia
pizza
place
placeofbirth
placeofburial
placeofdeath
planalto
planet_pit
planet_waves
planeta
plano
plant
plantas
plataforma
plataformas
platte
platte_river
playboy_enterprises
playedfor
playn
playstation
playstation_2
playtone
plymouth_savoy
pm
pms
po
pod
pode
podem
podemos
poder
pointe
pointe_d'aveneyre
poker
pole
poledriver
polet
polet_airlines
politcnica
politicalparty
politician
pollard
poltica
polticas
poltico
polticos
polytechnic_university_of_the_philippines_san_juan
polytechnic_university_of_the_philippines_taguig
ponte
pontes
pontiac
pontiac_building
pontiac_g8
pontuao
pop
pope
pope_benedict_xvi
pope_john_paul_ii
pope_paul_vi
pope_pius_x
poppins
populous
populous_(company)
por
pork
pornogrficos
port_klang
porter
portnoy
portrayer
portugal
porturia
posio
position
posso
possuem
possui
post
posteriormente
postura
potato
potters
povo
powell
pozna
pradesh
prata
praticadas
praticado
praticados
praticam
praticava
prato
pratos
precederam
precedeu
predecessor
prefeita
prefeito
pregny-chambsy
preo
preparao
preparatria
presenter
president
presidente
presididas
presididos
presta
preto
prevalecem
previouswork
primate
primavera
prime
prime_minister's_house_(colombo)
prime_time_entertainment_network
primeira
primeira-ministra
primeiras
primeiro
primeiro-ministro
primeiros
primeiros-ministros
primeminister
primera
primrios
principais
principal
privadas
private_university
prixes
prmio
prmios
pro
probus
probus_(journal)
processamento
producer
product
productions
productivity
produto
produtor
produtora
produtores
produtos
produz
produzida
produzido
produzidos
produziu
profession
profisses
profisso
programa
programao
programas
programmeformat
programminglanguage
project_runway_canada
projetadas
projetado
projetados
projeto
projetou
propriedade
proprietria
proprietrio
proprietrios
protectedarea
protegida
protegidas
provedor
provncia
prprio
prxima
prximas
prximo
prximos
pssaros
ptolemy_xii_auletes
ptolomeu
ptria
public
public_transport_authority_(western_australia)
publicada
publicadas
publicado
publicados
publicaes
publicam
publicaram
publicou
publisher
publius
publius_servilius_vatia_isauricus_(consul_48_bc)
pulmo
puppet
purcell
purnima
purpose
puss_in_boots_(1922_film)
pwd
pyusawhti
q
q-tip_(musician)
qf
qf_6-pounder_hotchkiss
qg
qu
quack
quack_(album)
quadrinhos
quagmire
quagmire's_quagmire
quais
qual
qualquer
quando
quantas
quanto
quantos
quarterback
quartermaster_corps_(united_states_army)
quatro
que
quebec
queensland
queer
queer_as_folk_(uk_tv_series)
queles
quem
querida
qumico
qunia
quot;to
quot;where
r
raa
raa_(river)
raas
rabe
race
racehorse
racing
racingdriver
racional
racism
radiostation
ragout
ragout_fin
raiders
railway
railwayline
rainhas
raj
raju
rakitnica
ralph
ralph_j._gleason
rama
rama_i
ramo
ramon
ramon_magsaysay_award
ramos
random_house
ranil
ranil_wickremesinghe
rank
rankin
raposa
raptors_905
rashid_behbudov_state_song_theatre
rational_analysis
ray
razes
rca
rca_records
rdio
rdios
rea
reading
reading,_berkshire
reais
real
realeza
realiza
realizadas
realizados
reas
reaven
rebelio
receberam
recebeu
recebidos
receitas
recolher
reconhecidos
recordedin
recordlabel
redatores
redding
redding,_connecticut
rede
redes
redor
reduto
refunjol
regies
regimento
regio
region
regionserved
registrada
registros
regula
regulamentado
reh
rei
reinados
reino
reis
reitor
relacionada
relacionadas
relacionado
relacionados
relacionamento
relaes
relao
related
relatedmeanoftransportation
relation
relative
relegante
relegio
religies
religio
religion
religiosa
religiosas
religiosos
remo
renascimento
renfe
renfe_class_333
rep_parasol
repblica
repouso
representantes
representaram
republic_of_korea_army
republican_river
republicano
residem
residence
residncia
resource
responsvel
restingplace
retornar
retratado
retratador
retratou
rev
rev_(drink)
revista
revistas
rgo
rhaetian_railway
rhode
rhode_island_route_15
rhythm_and_blues
riacho
riachos
richard
richard_m._sherman
richard_merrill_atkinson
richardson
rickenbacker
ricky_gervais
ridgewood,_new_jersey
righttributary
riley
ringgold
ringgold_high_school_(pennsylvania)
rio
rios
rishikesh
river
river_shannon
rivermouth
road
rob_pike
robert
robert_a._taft
robert_carr,_1st_earl_of_somerset
robert_hall_(economist)
robert_morris_colonials_football
robert_nederlander
robert_nutting
robert_ray_(australian_politician)
robert_t._herres
robert_wise
roberto
roberto_clemente_bridge
roberts
robin
robinson
robot_wars:_metal_mayhem
rochers_de_naye
rock
rock-a-doodle
rock_and_roll_hall_of_fame
rocket
roda
rodam
rodas
rodovia
roh_tae-woo
rohan
roll
roma
roman_abramovich
romance
romances
romano
rome
ronaldo
root
rosa
rosemont,_illinois
rosie
rosie_huntington-whiteley
rota
rotas
roteirista
roteiristas
roteiro
roundhead_(wyandot)
routeend
routejunction
routestart
royal
royal_designers_for_industry
royal_society
royal_thai_army
royalties
royalty
rtico
rtulo
ruben
ruben_j._villote
runaway
running_back
russel
russell
russell_t_davies
ryan
ryan_powell_(lacrosse)
ryan_seacrest
s
sabem
sagradas
saima_chowdhury
saint
saint_lawrence_river
saint_lucia_national_cricket_team
saint_petersburg__moscow_railway
salford_city_f.c.
salsette
salsette_island
salvao
sam_keller
sam_loyd
sammy
sammy_hagar_&_friends
sampson
samsu-iluna
samuel
samuel_hayes_(settler)
samuel_keeler
samurabsheron
samurabsheron_channel
san
san_diego_convention_center
san_diego_surf_(film)
san_francisco_49ers
san_francisco_art_institute
san_francisco_giants
san_marcos_river
sanchez
sandusky
sandusky_county,_ohio
sanguneo
sanremo_music_festival
santa
santa_clara_university
santo
santos
santurio
santurios
sapindales
sarah
sarah_kazemy
sarathchandra_rajakaruna
satish_kumar_sharma
satyanarayana
saumarez
saumarez_(horse)
savelev
sawyer
schiller
school
schutzstaffel
science_fiction
scientist
scientology
scios
scotland
scott_haran
screen
screen_actors_guild_life_achievement_award
screenplay
screenwriter
screenwriting
se
sea
seabright
seacrest
sean_young
sears
season
seattle
second_lieutenant
secrets
secrets_and_lies_(u.s._tv_series)
secundria
sede
sedes
sediadas
sediados
segue
seguem
seguida
seguidas
seguido
seguidores
seguidos
seguin,_texas
seguir
seguiram
seguiu
segunda
segundo
segundos-tenentes
segura
segurana
seinfeld
seja
selees
seleo
selo
sem
semelhante
semelhantes
semticas
senador
senator
senior
sepultado
sequia
sequoia_national_park
ser
serail
serbia_national_american_football_team
seria
series
sero
serra
serve
service
servido
servidos
servilius
servingrailwayline
servio
servios
serviram
serviu
seton
settlement
seu
seus
sexo
sexto
shaheed
shaheed_minar,_kolkata
shallot
shannon
shaun_the_sheep
shawn_fanning
shay
shays'_rebellion
shekhar
sherlock
sherlock_(software)
shimsa
shimsa_plateau
ship
shire
shire_river
sho
short_story
short_trips:_a_day_in_the_life
shorty_rogers
show
shows
